[
  {
    "zh-cn": {
      "$name": "属性转JSON",
      "$description": "属性转JSON是一款工具，允许用户将属性文件转换为JSON格式，使数据转换和操作更加容易。该工具简化了将属性文件转换为JSON的过程，使用户能够快速高效地转换其数据。",
      "$keywords": [
        "转换",
        "属性",
        "JSON",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "屬性轉JSON",
      "$description": "屬性轉JSON是一個工具，允許用戶將屬性文件轉換為JSON格式，使數據轉換和操作更加容易。此工具簡化了將屬性文件轉換為JSON的過程，使用戶能夠快速高效地轉換其數據。",
      "$keywords": [
        "轉換",
        "屬性",
        "JSON",
        "轉換"
      ]
    },
    "es": {
      "$name": "Propiedades a JSON",
      "$description": "Propiedades a JSON es una herramienta que permite a los usuarios convertir archivos de propiedades en formato JSON, lo que facilita la transformación y manipulación de datos. Esta herramienta simplifica el proceso de conversión de archivos de propiedades a JSON, permitiendo a los usuarios transformar sus datos de manera rápida y eficiente.",
      "$keywords": [
        "convertir",
        "Propiedades",
        "JSON",
        "transformar"
      ]
    },
    "ja": {
      "$name": "Properties to JSON",
      "$description": "Properties to JSONは、プロパティファイルをJSON形式に変換することができるツールであり、データの変換や操作を容易にします。このツールにより、プロパティファイルをJSONに変換するプロセスが簡素化され、ユーザーは迅速かつ効率的にデータを変換することができます。",
      "$keywords": [
        "変換",
        "プロパティ",
        "JSON",
        "変形"
      ]
    },
    "ko": {
      "$name": "Properties를 JSON으로 변환",
      "$description": "Properties를 JSON으로 변환하는 도구로 데이터를 변환하고 조작하기 쉬워집니다. 이 도구는 Properties 파일을 JSON으로 변환하는 과정을 간소화하여 사용자가 빠르고 효율적으로 데이터를 변환할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "Properties",
        "JSON",
        "조작"
      ]
    },
    "de": {
      "$name": "Eigenschaften zu JSON",
      "$description": "Eigenschaften zu JSON ist ein Tool, das es Benutzern ermöglicht, Eigenschaftsdateien in JSON-Format umzuwandeln, um Daten einfacher zu transformieren und zu manipulieren. Dieses Tool vereinfacht den Prozess der Umwandlung von Eigenschaftsdateien in JSON und ermöglicht es Benutzern, ihre Daten schnell und effizient zu transformieren.",
      "$keywords": [
        "umwandeln",
        "Eigenschaften",
        "JSON",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "Propriétés vers JSON",
      "$description": "Propriétés vers JSON est un outil qui permet aux utilisateurs de convertir des fichiers de propriétés en format JSON, facilitant ainsi la transformation et la manipulation des données. Cet outil simplifie le processus de conversion de fichiers de propriétés en JSON, permettant aux utilisateurs de transformer rapidement et efficacement leurs données.",
      "$keywords": [
        "convertir",
        "Propriétés",
        "JSON",
        "transformer"
      ]
    },
    "it": {
      "$name": "Proprietà in JSON",
      "$description": "Properties to JSON è uno strumento che consente agli utenti di convertire i file di proprietà nel formato JSON, rendendo più facile trasformare e manipolare i dati. Questo strumento semplifica il processo di conversione dei file di proprietà in JSON, consentendo agli utenti di trasformare i loro dati in modo rapido ed efficiente.",
      "$keywords": [
        "convertire",
        "Proprietà",
        "JSON",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "Свойства в JSON",
      "$description": "Свойства в JSON - это инструмент, который позволяет пользователям преобразовывать файлы свойств в формат JSON, что упрощает преобразование и манипулирование данными. Этот инструмент упрощает процесс преобразования файлов свойств в JSON, позволяя пользователям быстро и эффективно преобразовывать свои данные.",
      "$keywords": [
        "преобразовать",
        "Свойства",
        "JSON",
        "преобразование"
      ]
    },
    "pt": {
      "$name": "Propriedades para JSON",
      "$description": "Propriedades para JSON é uma ferramenta que permite aos usuários converter arquivos de propriedades para o formato JSON, tornando mais fácil transformar e manipular dados. Esta ferramenta simplifica o processo de conversão de arquivos de propriedades para JSON, permitindo que os usuários transformem seus dados de forma rápida e eficiente.",
      "$keywords": [
        "converter",
        "Propriedades",
        "JSON",
        "transformar"
      ]
    },
    "en": {
      "$name": "Properties to JSON",
      "$description": "Properties to JSON is a tool that allows users to convert properties files into JSON format, making it easier to transform and manipulate data. This tool simplifies the process of converting properties files to JSON, enabling users to quickly and efficiently transform their data.",
      "$keywords": [
        "convert",
        "Properties",
        "JSON",
        "transform"
      ]
    },
    "id": "properties-to-json"
  },
  {
    "zh-cn": {
      "$name": "JSON转Properties",
      "$description": "JSON转Properties是一款工具，允许用户轻松将JSON文件转换为Properties文件。这种转换使用户能够以更有结构和组织的方式处理JSON数据，使数据更易于管理和操作。",
      "$keywords": [
        "转换",
        "JSON",
        "Properties",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON轉Properties",
      "$description": "JSON轉Properties是一個工具，允許用戶輕鬆將JSON文件轉換為Properties文件。此轉換使用戶以更有結構和有組織的方式處理JSON數據，使數據更易於管理和操作。",
      "$keywords": [
        "轉換",
        "JSON",
        "Properties",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Propiedades",
      "$description": "JSON a Propiedades es una herramienta que permite a los usuarios convertir fácilmente archivos JSON en archivos de Propiedades. Esta transformación permite a los usuarios trabajar con datos JSON de manera más estructurada y organizada, lo que facilita la gestión y manipulación de datos.",
      "$keywords": [
        "convertir",
        "JSON",
        "Propiedades",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからPropertiesへの変換ツール",
      "$description": "JSONからPropertiesへの変換ツールは、ユーザーがJSONファイルを簡単にPropertiesファイルに変換できるようにするツールです。この変換により、ユーザーはJSONデータをより構造化された形式で扱い、データを管理および操作することが容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Properties",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Properties",
      "$description": "JSON to Properties는 사용자가 JSON 파일을 Properties 파일로 쉽게 변환할 수 있는 도구입니다. 이 변환은 사용자가 JSON 데이터를 보다 체계적이고 조직적인 방식으로 다룰 수 있도록 하여 데이터를 관리하고 조작하기 쉽게 만듭니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Properties",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Eigenschaften",
      "$description": "JSON to Properties ist ein Tool, das es Benutzern ermöglicht, JSON-Dateien einfach in Eigenschaftsdateien umzuwandeln. Diese Transformation ermöglicht es Benutzern, mit JSON-Daten auf eine strukturiertere und organisierte Weise zu arbeiten, was das Verwalten und Manipulieren von Daten erleichtert.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Eigenschaften",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Propriétés",
      "$description": "JSON vers Propriétés est un outil qui permet aux utilisateurs de convertir facilement des fichiers JSON en fichiers de propriétés. Cette transformation permet aux utilisateurs de travailler avec des données JSON de manière plus structurée et organisée, ce qui facilite la gestion et la manipulation des données.",
      "$keywords": [
        "convertir",
        "JSON",
        "Propriétés",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Properties",
      "$description": "JSON to Properties è uno strumento che consente agli utenti di convertire facilmente i file JSON in file Properties. Questa trasformazione consente agli utenti di lavorare con i dati JSON in modo più strutturato e organizzato, rendendo più facile la gestione e la manipolazione dei dati.",
      "$keywords": [
        "convertire",
        "JSON",
        "Properties",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в свойства",
      "$description": "JSON в свойства - это инструмент, который позволяет пользователям легко преобразовывать файлы JSON в файлы свойств. Это преобразование позволяет пользователям работать с данными JSON более структурированно и организованно, что упрощает управление и манипулирование данными.",
      "$keywords": [
        "преобразование",
        "JSON",
        "свойства",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Propriedades",
      "$description": "JSON para Propriedades é uma ferramenta que permite aos usuários converter facilmente arquivos JSON em arquivos de Propriedades. Essa transformação permite que os usuários trabalhem com dados JSON de maneira mais estruturada e organizada, tornando mais fácil gerenciar e manipular dados.",
      "$keywords": [
        "converter",
        "JSON",
        "Propriedades",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Properties",
      "$description": "JSON to Properties is a tool that allows users to easily convert JSON files into Properties files. This transformation enables users to work with JSON data in a more structured and organized manner, making it easier to manage and manipulate data.",
      "$keywords": [
        "convert",
        "JSON",
        "Properties",
        "transform"
      ]
    },
    "id": "json-to-properties"
  },
  {
    "zh-cn": {
      "$name": "JSON转Go结构体",
      "$description": "JSON转Go结构体是一款工具，允许用户轻松将JSON数据转换为Go结构体格式。这种转换使开发人员能够以更有结构和组织的方式处理JSON数据，使其更容易操作和分析。",
      "$keywords": [
        "转换",
        "JSON",
        "Go结构体",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Go Struct",
      "$description": "JSON 轉 Go Struct 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Go Struct 格式。這種轉換讓開發人員可以更有結構性和有組織地處理 JSON 資料，使其更容易操作和分析。",
      "$keywords": [
        "轉換",
        "JSON",
        "Go Struct",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Estructura de Go",
      "$description": "JSON a Estructura de Go es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de Estructura de Go. Esta transformación permite a los desarrolladores trabajar con datos JSON de una manera más estructurada y organizada, lo que facilita su manipulación y análisis.",
      "$keywords": [
        "convertir",
        "JSON",
        "Estructura de Go",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからGo Structへの変換ツール",
      "$description": "JSONからGo Structへの変換ツールは、ユーザーがJSONデータを簡単にGo Struct形式に変換できるようにするツールです。この変換により、開発者はJSONデータをより構造化された形式で扱い、操作や分析が容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Go Struct",
        "変形"
      ]
    },
    "ko": {
      "$name": "JSON to Go Struct",
      "$description": "JSON to Go Struct는 사용자가 JSON 데이터를 쉽게 Go Struct 형식으로 변환할 수 있는 도구입니다. 이 변환은 개발자가 JSON 데이터를 보다 체계적이고 조직적인 방식으로 다룰 수 있도록 하여 조작 및 분석을 보다 쉽게 만듭니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Go Struct",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Go Struct",
      "$description": "JSON zu Go Struct ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das Go Struct-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten auf eine strukturiertere und organisierte Weise zu arbeiten, was das Manipulieren und Analysieren erleichtert.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Go Struct",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Go Struct",
      "$description": "JSON vers Go Struct est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format Go Struct. Cette transformation permet aux développeurs de travailler avec des données JSON de manière plus structurée et organisée, ce qui facilite la manipulation et l'analyse.",
      "$keywords": [
        "convertir",
        "JSON",
        "Go Struct",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Go Struct",
      "$description": "JSON to Go Struct è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato Go Struct. Questa trasformazione consente agli sviluppatori di lavorare con i dati JSON in modo più strutturato e organizzato, rendendolo più facile da manipolare e analizzare.",
      "$keywords": [
        "convertire",
        "JSON",
        "Go Struct",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в Go Struct",
      "$description": "JSON в Go Struct - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат Go Struct. Это преобразование позволяет разработчикам работать с данными JSON более структурированно и организованно, что упрощает их манипулирование и анализ.",
      "$keywords": [
        "преобразование",
        "JSON",
        "Go Struct",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Estrutura Go",
      "$description": "JSON para Estrutura Go é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Estrutura Go. Essa transformação permite que os desenvolvedores trabalhem com dados JSON de maneira mais estruturada e organizada, tornando mais fácil manipular e analisar.",
      "$keywords": [
        "converter",
        "JSON",
        "Estrutura Go",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Go Struct",
      "$description": "JSON to Go Struct is a tool that allows users to easily convert JSON data into Go Struct format. This transformation enables developers to work with JSON data in a more structured and organized manner, making it easier to manipulate and analyze.",
      "$keywords": [
        "convert",
        "JSON",
        "Go Struct",
        "transform"
      ]
    },
    "id": "json-to-go-struct"
  },
  {
    "zh-cn": {
      "$name": "JSON转Java Bean",
      "$description": "JSON转Java Bean是一款工具，允许用户轻松将JSON数据转换为Java对象，使在基于Java的应用程序中处理和操作数据更加容易。该工具简化了将JSON数据转换为Java Bean的过程，节省了开发人员的时间和精力。",
      "$keywords": [
        "转换",
        "JSON",
        "JAVA Bean",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Java Bean",
      "$description": "JSON 轉 Java Bean 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Java 物件，使在基於 Java 的應用程式中處理和操作資料更加容易。這個工具簡化了將 JSON 資料轉換成 Java Beans 的過程，節省了開發人員的時間和精力。",
      "$keywords": [
        "轉換",
        "JSON",
        "JAVA Bean",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Java Bean",
      "$description": "JSON a Java Bean es una herramienta que permite a los usuarios convertir fácilmente datos JSON en objetos Java, lo que facilita el trabajo y la manipulación de datos en aplicaciones basadas en Java. Esta herramienta simplifica el proceso de transformar datos JSON en Java Beans, ahorrando tiempo y esfuerzo a los desarrolladores.",
      "$keywords": [
        "convertir",
        "JSON",
        "JAVA Bean",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからJava Beanへの変換ツール",
      "$description": "JSONからJava Beanへの変換ツールは、ユーザーがJSONデータを簡単にJavaオブジェクトに変換できるようにするツールであり、Javaベースのアプリケーションでデータを扱いやすく操作できるようにします。このツールは、JSONデータをJava Beansに変換するプロセスを簡素化し、開発者の時間と労力を節約します。",
      "$keywords": [
        "変換",
        "JSON",
        "JAVA Bean",
        "変形"
      ]
    },
    "ko": {
      "$name": "JSON to Java Bean",
      "$description": "JSON to Java Bean은 사용자가 JSON 데이터를 쉽게 Java 객체로 변환하여 Java 기반 애플리케이션에서 데이터를 더 쉽게 작업하고 조작할 수 있도록하는 도구입니다. 이 도구는 JSON 데이터를 Java Beans로 변환하는 과정을 간소화하여 개발자의 시간과 노력을 절약합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "JAVA Bean",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Java Bean",
      "$description": "JSON to Java Bean ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in Java-Objekte umzuwandeln, um die Arbeit mit und Manipulation von Daten in Java-basierten Anwendungen zu erleichtern. Dieses Tool vereinfacht den Prozess der Umwandlung von JSON-Daten in Java-Beans und spart Entwicklern Zeit und Mühe.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "JAVA Bean",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Java Bean",
      "$description": "JSON vers Java Bean est un outil qui permet aux utilisateurs de convertir facilement des données JSON en objets Java, facilitant ainsi le travail et la manipulation de données dans les applications basées sur Java. Cet outil simplifie le processus de transformation de données JSON en Java Beans, ce qui permet aux développeurs de gagner du temps et des efforts.",
      "$keywords": [
        "convertir",
        "JSON",
        "JAVA Bean",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Java Bean",
      "$description": "JSON to Java Bean è uno strumento che consente agli utenti di convertire facilmente i dati JSON in oggetti Java, semplificando il lavoro con i dati nelle applicazioni basate su Java. Questo strumento semplifica il processo di trasformazione dei dati JSON in Java Beans, risparmiando tempo ed sforzi agli sviluppatori.",
      "$keywords": [
        "convertire",
        "JSON",
        "JAVA Bean",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в Java Bean",
      "$description": "JSON в Java Bean - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в объекты Java, что упрощает работу с данными в приложениях на основе Java. Этот инструмент упрощает процесс преобразования данных JSON в Java Beans, экономя время и усилия разработчиков.",
      "$keywords": [
        "преобразование",
        "JSON",
        "Java Bean",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Java Bean",
      "$description": "JSON para Java Bean é uma ferramenta que permite aos usuários converter facilmente dados JSON em objetos Java, tornando mais fácil trabalhar e manipular dados em aplicativos baseados em Java. Esta ferramenta simplifica o processo de transformação de dados JSON em Java Beans, economizando tempo e esforço dos desenvolvedores.",
      "$keywords": [
        "converter",
        "JSON",
        "JAVA Bean",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Java Bean",
      "$description": "JSON to Java Bean is a tool that allows users to easily convert JSON data into Java objects, making it easier to work with and manipulate data in Java-based applications. This tool simplifies the process of transforming JSON data into Java Beans, saving developers time and effort.",
      "$keywords": [
        "convert",
        "JSON",
        "JAVA Bean",
        "transform"
      ]
    },
    "id": "json-to-java-bean"
  },
  {
    "zh-cn": {
      "$name": "JSON转Python类",
      "$description": "JSON转Python类是一款工具，允许用户轻松将JSON数据转换为Python类。这种转换使用户能够以更有组织和高效的方式操作和处理数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Python类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Python 類別",
      "$description": "JSON 轉 Python 類別是一個工具，讓使用者能夠輕鬆地將 JSON 資料轉換成 Python 類別。這個轉換讓使用者能夠以更有組織、更有效率的方式操作和處理資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "Python 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase de Python",
      "$description": "JSON a Clase de Python es una herramienta que permite a los usuarios convertir fácilmente datos JSON en clases de Python. Esta transformación permite a los usuarios manipular y trabajar con los datos de una manera más organizada y eficiente.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase de Python",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからPythonクラスへの変換ツール",
      "$description": "JSONからPythonクラスへの変換ツールは、ユーザーがJSONデータを簡単にPythonクラスに変換できるようにするツールです。この変換により、ユーザーはデータをより整理された効率的な方法で操作および処理できます。",
      "$keywords": [
        "変換",
        "JSON",
        "Pythonクラス",
        "変換"
      ]
    },
    "ko": {
      "$name": "JSON to Python Class",
      "$description": "JSON to Python Class는 사용자가 JSON 데이터를 쉽게 Python 클래스로 변환할 수 있는 도구입니다. 이 변환은 데이터를 더 체계적이고 효율적으로 조작하고 작업할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Python 클래스",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Python-Klasse",
      "$description": "JSON zu Python-Klasse ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in Python-Klassen umzuwandeln. Diese Transformation ermöglicht es Benutzern, mit den Daten auf eine organisierte und effiziente Weise zu arbeiten und sie zu manipulieren.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Python-Klasse",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe Python",
      "$description": "JSON vers Classe Python est un outil qui permet aux utilisateurs de convertir facilement des données JSON en classes Python. Cette transformation permet aux utilisateurs de manipuler et de travailler avec les données de manière plus organisée et efficace.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe Python",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Python Class",
      "$description": "JSON to Python Class è uno strumento che consente agli utenti di convertire facilmente i dati JSON in classi Python. Questa trasformazione consente agli utenti di manipolare e lavorare con i dati in modo più organizzato ed efficiente.",
      "$keywords": [
        "convertire",
        "JSON",
        "Python Class",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в класс Python",
      "$description": "JSON в Python Class - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в классы Python. Это преобразование позволяет пользователям более организованно и эффективно работать с данными.",
      "$keywords": [
        "преобразование",
        "JSON",
        "класс Python",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe Python",
      "$description": "JSON para Classe Python é uma ferramenta que permite aos usuários converter facilmente dados JSON em classes Python. Essa transformação permite que os usuários manipulem e trabalhem com os dados de maneira mais organizada e eficiente.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe Python",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Python Class",
      "$description": "JSON to Python Class is a tool that allows users to easily convert JSON data into Python classes. This transformation enables users to manipulate and work with the data in a more organized and efficient manner.",
      "$keywords": [
        "convert",
        "JSON",
        "Python Class",
        "transform"
      ]
    },
    "id": "json-to-python-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转Zod Schema",
      "$description": "JSON转Zod Schema是一款工具，允许用户轻松将JSON数据转换为Zod Schema格式。此转换使开发人员能够验证和强制数据类型和结构在其应用程序中，确保数据一致性并减少错误。",
      "$keywords": [
        "转换",
        "JSON",
        "Zod Schema",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Zod Schema",
      "$description": "JSON 轉 Zod Schema 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Zod Schema 格式。這個轉換讓開發人員可以驗證和強制資料類型和結構在他們的應用程式中，確保資料一致性和減少錯誤。",
      "$keywords": [
        "轉換",
        "JSON",
        "Zod Schema",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Esquema Zod",
      "$description": "JSON a Esquema Zod es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de Esquema Zod. Esta transformación permite a los desarrolladores validar y hacer cumplir los tipos y estructuras de datos en sus aplicaciones, asegurando la consistencia de los datos y reduciendo errores.",
      "$keywords": [
        "convertir",
        "JSON",
        "Esquema Zod",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからZodスキーマへの変換ツール",
      "$description": "JSON to Zod Schemaは、ユーザーが簡単にJSONデータをZodスキーマ形式に変換できるツールです。この変換により、開発者はアプリケーション内のデータ型と構造を検証および強制することができ、データの一貫性を確保し、エラーを減らすことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Zodスキーマ",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Zod Schema",
      "$description": "JSON to Zod Schema는 사용자가 JSON 데이터를 쉽게 Zod Schema 형식으로 변환할 수 있는 도구입니다. 이 변환은 개발자가 애플리케이션에서 데이터 유형과 구조를 검증하고 강제할 수 있도록 하여 데이터 일관성을 보장하고 오류를 줄이는 데 도움이 됩니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Zod Schema",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Zod Schema",
      "$description": "JSON to Zod Schema ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das Zod Schema-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, Datenarten und -strukturen in ihren Anwendungen zu validieren und durchzusetzen, um Datenkonsistenz zu gewährleisten und Fehler zu reduzieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Zod Schema",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Zod Schema",
      "$description": "JSON vers Zod Schema est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format de schéma Zod. Cette transformation permet aux développeurs de valider et d'imposer des types et des structures de données dans leurs applications, assurant ainsi la cohérence des données et réduisant les erreurs.",
      "$keywords": [
        "convertir",
        "JSON",
        "Zod Schema",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Zod Schema",
      "$description": "JSON to Zod Schema è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato dello schema Zod. Questa trasformazione consente agli sviluppatori di convalidare ed applicare i tipi e le strutture dei dati nelle loro applicazioni, garantendo la coerenza dei dati e riducendo gli errori.",
      "$keywords": [
        "convertire",
        "JSON",
        "Zod Schema",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в Zod Schema",
      "$description": "JSON в Zod Schema - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат Zod Schema. Это преобразование позволяет разработчикам проверять и принуждать типы данных и структуры в своих приложениях, обеспечивая согласованность данных и уменьшая ошибки.",
      "$keywords": [
        "преобразование",
        "JSON",
        "Zod Schema",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Esquema Zod",
      "$description": "JSON para Esquema Zod é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Esquema Zod. Essa transformação permite que os desenvolvedores validem e imponham tipos e estruturas de dados em suas aplicações, garantindo consistência de dados e reduzindo erros.",
      "$keywords": [
        "converter",
        "JSON",
        "Esquema Zod",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Zod Schema",
      "$description": "JSON to Zod Schema is a tool that allows users to easily convert JSON data into Zod Schema format. This transformation enables developers to validate and enforce data types and structures in their applications, ensuring data consistency and reducing errors.",
      "$keywords": [
        "convert",
        "JSON",
        "Zod Schema",
        "transform"
      ]
    },
    "id": "json-to-zod-schema"
  },
  {
    "zh-cn": {
      "$name": "JSON转Ruby模块",
      "$description": "JSON转Ruby模块是一款工具，允许用户轻松将JSON数据转换为Ruby模块格式。这种转换使开发人员能够更有效地组织和处理Ruby应用程序中的JSON数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Ruby模块",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Ruby 模組",
      "$description": "JSON 轉 Ruby 模組是一個工具，讓使用者能夠輕鬆地將 JSON 資料轉換成 Ruby 模組格式。這種轉換讓開發人員能夠在他們的 Ruby 應用程式中更有效率和有組織地處理 JSON 資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "Ruby 模組",
        "轉換"
      ]
    },
    "es": {
      "$name": "Módulo de Ruby a JSON",
      "$description": "JSON to Ruby Module es una herramienta que permite a los usuarios convertir fácilmente datos JSON en un formato de Módulo de Ruby. Esta transformación permite a los desarrolladores trabajar con datos JSON de manera más eficiente y organizada dentro de sus aplicaciones Ruby.",
      "$keywords": [
        "convertir",
        "JSON",
        "Módulo de Ruby",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからRubyモジュールへの変換ツール",
      "$description": "JSONからRubyモジュールへの変換ツールは、ユーザーがJSONデータを簡単にRubyモジュール形式に変換できるツールです。この変換により、開発者はRubyアプリケーション内でJSONデータをより効率的かつ整理された方法で扱うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Rubyモジュール",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Ruby Module",
      "$description": "JSON to Ruby Module은 사용자가 JSON 데이터를 쉽게 Ruby Module 형식으로 변환할 수 있는 도구입니다. 이 변환은 개발자가 Ruby 애플리케이션 내에서 JSON 데이터를 더 효율적이고 조직적인 방식으로 작업할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Ruby Module",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Ruby-Modul",
      "$description": "JSON zu Ruby-Modul ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in ein Ruby-Modul-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten auf eine effizientere und organisierte Weise innerhalb ihrer Ruby-Anwendungen zu arbeiten.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Ruby-Modul",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "Module Ruby vers JSON",
      "$description": "Module Ruby vers JSON est un outil qui permet aux utilisateurs de convertir facilement des données JSON en un format de module Ruby. Cette transformation permet aux développeurs de travailler avec des données JSON de manière plus efficace et organisée au sein de leurs applications Ruby.",
      "$keywords": [
        "convertir",
        "JSON",
        "Module Ruby",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Ruby Module",
      "$description": "JSON to Ruby Module è uno strumento che consente agli utenti di convertire facilmente i dati JSON in un formato di modulo Ruby. Questa trasformazione consente agli sviluppatori di lavorare con i dati JSON in modo più efficiente e organizzato all'interno delle loro applicazioni Ruby.",
      "$keywords": [
        "convertire",
        "JSON",
        "modulo Ruby",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в модуль Ruby",
      "$description": "JSON в модуль Ruby - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат модуля Ruby. Это преобразование позволяет разработчикам работать с данными JSON более эффективно и организованно в рамках их приложений на Ruby.",
      "$keywords": [
        "преобразование",
        "JSON",
        "модуль Ruby",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Módulo Ruby",
      "$description": "JSON para Módulo Ruby é uma ferramenta que permite aos usuários converter facilmente dados JSON em um formato de Módulo Ruby. Essa transformação permite que os desenvolvedores trabalhem com dados JSON de maneira mais eficiente e organizada em suas aplicações Ruby.",
      "$keywords": [
        "converter",
        "JSON",
        "Módulo Ruby",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Ruby Module",
      "$description": "JSON to Ruby Module is a tool that allows users to easily convert JSON data into a Ruby Module format. This transformation enables developers to work with JSON data in a more efficient and organized manner within their Ruby applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Ruby Module",
        "transform"
      ]
    },
    "id": "json-to-ruby-module"
  },
  {
    "zh-cn": {
      "$name": "JSON转Rust结构体",
      "$description": "JSON转Rust结构体是一款工具，允许用户轻松将JSON数据转换为Rust结构体格式。这种转换使开发人员能够在Rust编程语言中使用JSON数据，从而更容易地操作和分析应用程序中的数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Rust结构体",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Rust Struct",
      "$description": "JSON 轉 Rust Struct 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Rust Struct 格式。這個轉換讓開發者可以在 Rust 程式語言中使用 JSON 資料，使得在應用程式中操作和分析資料更加容易。",
      "$keywords": [
        "轉換",
        "JSON",
        "Rust Struct",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Estructura Rust",
      "$description": "JSON a Estructura Rust es una herramienta que permite a los usuarios convertir fácilmente datos JSON al formato de Estructura Rust. Esta transformación permite a los desarrolladores trabajar con datos JSON en el lenguaje de programación Rust, lo que facilita la manipulación y análisis de datos en sus aplicaciones.",
      "$keywords": [
        "convertir",
        "JSON",
        "Estructura Rust",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからRust Structへの変換ツール",
      "$description": "JSONからRust Structへの変換ツールは、ユーザーがJSONデータを簡単にRust Struct形式に変換できるようにするツールです。この変換により、開発者はRustプログラミング言語でJSONデータを扱い、アプリケーションでデータを操作および分析することが容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Rust Struct",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON을 Rust 구조체로 변환",
      "$description": "JSON을 Rust 구조체로 변환하는 도구로, 이 변환을 통해 개발자는 Rust 프로그래밍 언어에서 JSON 데이터를 다루기 쉬워져 애플리케이션에서 데이터를 조작하고 분석하기 쉬워집니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Rust 구조체",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Rust-Struktur",
      "$description": "JSON to Rust Struct ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das Rust-Strukturformat zu konvertieren. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten in der Rust-Programmiersprache zu arbeiten, was es einfacher macht, Daten in ihren Anwendungen zu manipulieren und zu analysieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Rust-Struktur",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Structure Rust",
      "$description": "JSON vers Structure Rust est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format Structure Rust. Cette transformation permet aux développeurs de travailler avec des données JSON dans le langage de programmation Rust, ce qui facilite la manipulation et l'analyse des données dans leurs applications.",
      "$keywords": [
        "convertir",
        "JSON",
        "Structure Rust",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Rust Struct",
      "$description": "JSON to Rust Struct è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato Rust Struct. Questa trasformazione consente ai programmatori di lavorare con i dati JSON nel linguaggio di programmazione Rust, semplificando la manipolazione e l'analisi dei dati nelle loro applicazioni.",
      "$keywords": [
        "convertire",
        "JSON",
        "Rust Struct",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в Rust Struct",
      "$description": "JSON в Rust Struct - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат Rust Struct. Это преобразование позволяет разработчикам работать с данными JSON на языке программирования Rust, что упрощает манипулирование и анализ данных в их приложениях.",
      "$keywords": [
        "преобразование",
        "JSON",
        "Rust Struct",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Estrutura Rust",
      "$description": "JSON para Estrutura Rust é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Estrutura Rust. Essa transformação permite que os desenvolvedores trabalhem com dados JSON na linguagem de programação Rust, tornando mais fácil manipular e analisar dados em suas aplicações.",
      "$keywords": [
        "converter",
        "JSON",
        "Estrutura Rust",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Rust Struct",
      "$description": "JSON to Rust Struct is a tool that allows users to easily convert JSON data into Rust Struct format. This transformation enables developers to work with JSON data in Rust programming language, making it easier to manipulate and analyze data in their applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Rust Struct",
        "transform"
      ]
    },
    "id": "json-to-rust-struct"
  },
  {
    "zh-cn": {
      "$name": "JSON转Dart类",
      "$description": "JSON转Dart类是一款工具，允许开发人员轻松将JSON数据转换为Dart类。这种转换简化了在基于Dart的应用程序中使用JSON数据的过程，使得管理和操作数据结构更加容易。",
      "$keywords": [
        "转换",
        "JSON",
        "Dart类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Dart 類別",
      "$description": "JSON 轉 Dart 類別是一個工具，允許開發人員輕鬆將 JSON 資料轉換為 Dart 類別。這種轉換簡化了在基於 Dart 的應用程式中處理 JSON 資料的過程，使管理和操作資料結構更加容易。",
      "$keywords": [
        "轉換",
        "JSON",
        "Dart 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase Dart",
      "$description": "JSON a Clase Dart es una herramienta que permite a los desarrolladores convertir fácilmente datos JSON en clases Dart. Esta transformación simplifica el proceso de trabajar con datos JSON en aplicaciones basadas en Dart, lo que facilita la gestión y manipulación de estructuras de datos.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase Dart",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからDartクラスへの変換ツール",
      "$description": "JSON to Dart Classは、開発者がJSONデータを簡単にDartクラスに変換できるツールです。この変換により、DartベースのアプリケーションでJSONデータを扱うプロセスが簡素化され、データ構造を管理および操作することが容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Dartクラス",
        "変換"
      ]
    },
    "ko": {
      "$name": "JSON to Dart Class",
      "$description": "JSON to Dart Class는 개발자가 JSON 데이터를 쉽게 Dart 클래스로 변환할 수 있는 도구입니다. 이 변환은 Dart 기반 애플리케이션에서 JSON 데이터를 다루는 과정을 단순화하여 데이터 구조를 관리하고 조작하기 쉽게 만듭니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Dart Class",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Dart-Klasse",
      "$description": "JSON to Dart Class ist ein Tool, das es Entwicklern ermöglicht, JSON-Daten einfach in Dart-Klassen umzuwandeln. Diese Transformation vereinfacht den Prozess der Arbeit mit JSON-Daten in Dart-basierten Anwendungen und erleichtert das Verwalten und Manipulieren von Datenstrukturen.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Dart-Klasse",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe Dart",
      "$description": "JSON vers Classe Dart est un outil qui permet aux développeurs de convertir facilement des données JSON en classes Dart. Cette transformation simplifie le processus de travail avec des données JSON dans les applications basées sur Dart, ce qui facilite la gestion et la manipulation des structures de données.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe Dart",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Dart Class",
      "$description": "JSON to Dart Class è uno strumento che consente agli sviluppatori di convertire facilmente i dati JSON in classi Dart. Questa trasformazione semplifica il processo di lavoro con i dati JSON nelle applicazioni basate su Dart, rendendo più facile gestire e manipolare le strutture dati.",
      "$keywords": [
        "convertire",
        "JSON",
        "Dart Class",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в класс Dart",
      "$description": "JSON to Dart Class - это инструмент, который позволяет разработчикам легко преобразовывать данные JSON в классы Dart. Это упрощает процесс работы с данными JSON в приложениях на основе Dart, делая управление и манипулирование структурами данных более простым.",
      "$keywords": [
        "преобразование",
        "JSON",
        "класс Dart",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe Dart",
      "$description": "JSON para Classe Dart é uma ferramenta que permite aos desenvolvedores converter facilmente dados JSON em classes Dart. Essa transformação simplifica o processo de trabalhar com dados JSON em aplicativos baseados em Dart, tornando mais fácil gerenciar e manipular estruturas de dados.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe Dart",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Dart Class",
      "$description": "JSON to Dart Class is a tool that allows developers to easily convert JSON data into Dart classes. This transformation simplifies the process of working with JSON data in Dart-based applications, making it easier to manage and manipulate data structures.",
      "$keywords": [
        "convert",
        "JSON",
        "Dart Class",
        "transform"
      ]
    },
    "id": "json-to-dart-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转C#类",
      "$description": "JSON转C#类是一款工具，允许用户轻松将JSON数据转换为C#类对象。这种转换使开发人员能够以更有结构和组织的方式处理JSON数据，使其更容易在应用程序中操作和利用。",
      "$keywords": [
        "转换",
        "JSON",
        "C#类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 C# 類別",
      "$description": "JSON 轉 C# 類別是一個工具，讓使用者能夠輕鬆地將 JSON 資料轉換為 C# 類別物件。這種轉換讓開發人員能夠以更有結構和組織的方式處理 JSON 資料，使其更容易在應用程式中操作和利用。",
      "$keywords": [
        "轉換",
        "JSON",
        "C# 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase C#",
      "$description": "JSON a Clase C# es una herramienta que permite a los usuarios convertir fácilmente datos JSON en objetos de clase C#. Esta transformación permite a los desarrolladores trabajar con datos JSON de manera más estructurada y organizada, lo que facilita su manipulación y utilización en sus aplicaciones.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase C#",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからC#クラスへの変換ツール",
      "$description": "JSONからC#クラスへの変換ツールは、ユーザーがJSONデータを簡単にC#クラスオブジェクトに変換できるようにするツールです。この変換により、開発者はJSONデータをより構造化された形式で扱い、アプリケーションでより簡単に操作および利用できるようになります。",
      "$keywords": [
        "変換",
        "JSON",
        "C#クラス",
        "変換"
      ]
    },
    "ko": {
      "$name": "JSON을 C# 클래스로 변환",
      "$description": "JSON을 C# 클래스 객체로 쉽게 변환할 수 있는 도구입니다. 이 변환은 개발자가 JSON 데이터를 보다 구조화되고 조직적인 방식으로 다룰 수 있게 하여 응용 프로그램에서 쉽게 조작하고 활용할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "C# 클래스",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu C# Klasse",
      "$description": "JSON zu C# Klasse ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in C#-Klassenobjekte umzuwandeln. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten auf eine strukturiertere und organisierte Weise zu arbeiten, was es einfacher macht, sie in ihren Anwendungen zu manipulieren und zu nutzen.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "C# Klasse",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe C#",
      "$description": "JSON vers Classe C# est un outil qui permet aux utilisateurs de convertir facilement des données JSON en objets de classe C#. Cette transformation permet aux développeurs de travailler avec des données JSON de manière plus structurée et organisée, ce qui facilite leur manipulation et leur utilisation dans leurs applications.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe C#",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to C# Class",
      "$description": "JSON to C# Class è uno strumento che consente agli utenti di convertire facilmente i dati JSON in oggetti di classe C#. Questa trasformazione consente ai programmatori di lavorare con i dati JSON in modo più strutturato e organizzato, rendendolo più facile da manipolare e utilizzare nelle loro applicazioni.",
      "$keywords": [
        "convertire",
        "JSON",
        "classe C#",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в C# класс",
      "$description": "JSON в C# Class - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в объекты классов C#. Это преобразование позволяет разработчикам работать с данными JSON более структурированно и организованно, что упрощает их манипулирование и использование в приложениях.",
      "$keywords": [
        "преобразование",
        "JSON",
        "C# класс",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe C#",
      "$description": "JSON para Classe C# é uma ferramenta que permite aos usuários converter facilmente dados JSON em objetos de classe C#. Essa transformação permite que os desenvolvedores trabalhem com dados JSON de maneira mais estruturada e organizada, tornando mais fácil manipulá-los e utilizá-los em suas aplicações.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe C#",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to C# Class",
      "$description": "JSON to C# Class is a tool that allows users to easily convert JSON data into C# class objects. This transformation enables developers to work with JSON data in a more structured and organized manner, making it easier to manipulate and utilize in their applications.",
      "$keywords": [
        "convert",
        "JSON",
        "C# Class",
        "transform"
      ]
    },
    "id": "json-to-c0-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转C++结构体",
      "$description": "JSON转C++结构体是一款工具，允许用户轻松将JSON数据转换为C++结构体格式。这种转换使开发人员能够高效地在C++编程语言中处理JSON数据。",
      "$keywords": [
        "转换",
        "JSON",
        "C++结构体",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 C++ Struct",
      "$description": "JSON 轉 C++ Struct 是一個工具，讓使用者能夠輕鬆地將 JSON 資料轉換為 C++ Struct 格式。這種轉換使開發人員能夠有效地在 C++ 程式語言中處理 JSON 資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "C++ Struct",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Estructura C++",
      "$description": "JSON a Estructura C++ es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de Estructura C++. Esta transformación permite a los desarrolladores trabajar eficientemente con datos JSON en el lenguaje de programación C++.",
      "$keywords": [
        "convertir",
        "JSON",
        "Estructura C++",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからC++構造体への変換ツール",
      "$description": "JSONからC++構造体への変換ツールは、ユーザーがJSONデータを簡単にC++構造体形式に変換できるようにするツールです。この変換により、開発者はC++プログラミング言語でJSONデータを効率的に扱うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "C++構造体",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON을 C++ 구조체로 변환",
      "$description": "JSON을 C++ 구조체로 변환하는 도구로, 이 변환을 통해 개발자는 C++ 프로그래밍 언어에서 JSON 데이터를 효율적으로 처리할 수 있습니다.",
      "$keywords": [
        "변환",
        "JSON",
        "C++ 구조체",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu C++ Struct",
      "$description": "JSON zu C++ Struct ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das C++ Struct-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, effizient mit JSON-Daten in der C++-Programmiersprache zu arbeiten.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "C++ Struct",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Struct C++",
      "$description": "JSON vers Struct C++ est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format Struct C++. Cette transformation permet aux développeurs de travailler efficacement avec des données JSON dans le langage de programmation C++.",
      "$keywords": [
        "convertir",
        "JSON",
        "Struct C++",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to C++ Struct",
      "$description": "JSON to C++ Struct è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato C++ Struct. Questa trasformazione consente agli sviluppatori di lavorare efficientemente con i dati JSON nel linguaggio di programmazione C++.",
      "$keywords": [
        "convertire",
        "JSON",
        "C++ Struct",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в C++ Struct",
      "$description": "JSON в C++ Struct - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат C++ Struct. Это преобразование позволяет разработчикам эффективно работать с данными JSON на языке программирования C++.",
      "$keywords": [
        "преобразование",
        "JSON",
        "C++ Struct",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Estrutura C++",
      "$description": "JSON para Estrutura C++ é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Estrutura C++. Essa transformação permite que os desenvolvedores trabalhem eficientemente com dados JSON na linguagem de programação C++.",
      "$keywords": [
        "converter",
        "JSON",
        "Estrutura C++",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to C++ Struct",
      "$description": "JSON to C++ Struct is a tool that allows users to easily convert JSON data into C++ Struct format. This transformation enables developers to efficiently work with JSON data in C++ programming language.",
      "$keywords": [
        "convert",
        "JSON",
        "C++ Struct",
        "transform"
      ]
    },
    "id": "json-to-c00-struct"
  },
  {
    "zh-cn": {
      "$name": "JSON转Swift结构体",
      "$description": "JSON转Swift结构体是一款工具，允许开发人员轻松将JSON数据转换为Swift结构体，使在基于Swift的应用程序中处理和操作数据更加容易。该工具简化了将JSON数据转换为可轻松集成到Swift代码中的格式的过程，节省了开发人员的时间和精力。",
      "$keywords": [
        "转换",
        "JSON",
        "Swift结构体",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Swift Struct",
      "$description": "JSON 轉 Swift Struct 是一個工具，讓開發人員可以輕鬆地將 JSON 資料轉換為 Swift Structs，使在基於 Swift 的應用程式中處理和操作資料更加容易。此工具簡化了將 JSON 資料轉換為可輕鬆整合到 Swift 代碼中的格式的過程，節省了開發人員的時間和精力。",
      "$keywords": [
        "轉換",
        "JSON",
        "Swift Struct",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Estructura Swift",
      "$description": "JSON a Estructura Swift es una herramienta que permite a los desarrolladores convertir fácilmente datos JSON en Estructuras Swift, lo que facilita el trabajo y la manipulación de datos en aplicaciones basadas en Swift. Esta herramienta simplifica el proceso de transformar datos JSON en un formato que puede integrarse fácilmente en el código Swift, ahorrando tiempo y esfuerzo a los desarrolladores.",
      "$keywords": [
        "convertir",
        "JSON",
        "Estructura Swift",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからSwift Structへの変換ツール",
      "$description": "JSON to Swift Structは、開発者がJSONデータを簡単にSwift Structに変換できるようにするツールであり、Swiftベースのアプリケーションでデータを扱いやすく操作できるようにします。このツールは、JSONデータをSwiftコードに簡単に統合できる形式に変換するプロセスを簡素化し、開発者の時間と労力を節約します。",
      "$keywords": [
        "変換",
        "JSON",
        "Swift Struct",
        "変形"
      ]
    },
    "ko": {
      "$name": "JSON을 Swift Struct로 변환하는 도구",
      "$description": "JSON을 Swift Struct로 변환하는 도구는 개발자가 JSON 데이터를 쉽게 Swift Struct로 변환할 수 있도록 도와줍니다. 이 도구는 JSON 데이터를 Swift 코드에 쉽게 통합할 수 있는 형식으로 변환하는 과정을 간소화하여 개발자들의 시간과 노력을 절약합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Swift Struct",
        "형식 변환"
      ]
    },
    "de": {
      "$name": "JSON zu Swift Struct",
      "$description": "JSON to Swift Struct ist ein Tool, das Entwicklern ermöglicht, JSON-Daten einfach in Swift-Strukturen umzuwandeln, um die Arbeit mit und Manipulation von Daten in Swift-basierten Anwendungen zu erleichtern. Dieses Tool vereinfacht den Prozess der Umwandlung von JSON-Daten in ein Format, das leicht in Swift-Code integriert werden kann, und spart Entwicklern Zeit und Mühe.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Swift Struct",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Struct Swift",
      "$description": "JSON vers Struct Swift est un outil qui permet aux développeurs de convertir facilement des données JSON en Structs Swift, facilitant ainsi le travail et la manipulation des données dans les applications basées sur Swift. Cet outil simplifie le processus de transformation des données JSON en un format pouvant être facilement intégré dans le code Swift, ce qui permet aux développeurs de gagner du temps et des efforts.",
      "$keywords": [
        "convertir",
        "JSON",
        "Struct Swift",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Swift Struct",
      "$description": "JSON to Swift Struct è uno strumento che consente agli sviluppatori di convertire facilmente i dati JSON in strutture Swift, semplificando il lavoro con i dati nelle applicazioni basate su Swift. Questo strumento semplifica il processo di trasformazione dei dati JSON in un formato facilmente integrabile nel codice Swift, risparmiando tempo ed sforzi agli sviluppatori.",
      "$keywords": [
        "convertire",
        "JSON",
        "Strutture Swift",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в структуру Swift",
      "$description": "JSON в структуру Swift - это инструмент, который позволяет разработчикам легко преобразовывать данные JSON в структуры Swift, что упрощает работу с данными в приложениях на основе Swift. Этот инструмент упрощает процесс преобразования данных JSON в формат, который можно легко интегрировать в код Swift, экономя время и усилия разработчиков.",
      "$keywords": [
        "преобразование",
        "JSON",
        "структура Swift",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Estrutura Swift",
      "$description": "JSON para Estrutura Swift é uma ferramenta que permite aos desenvolvedores converter facilmente dados JSON em Estruturas Swift, tornando mais fácil trabalhar e manipular dados em aplicativos baseados em Swift. Esta ferramenta simplifica o processo de transformar dados JSON em um formato que pode ser facilmente integrado ao código Swift, economizando tempo e esforço dos desenvolvedores.",
      "$keywords": [
        "converter",
        "JSON",
        "Estrutura Swift",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Swift Struct",
      "$description": "JSON to Swift Struct is a tool that allows developers to easily convert JSON data into Swift Structs, making it easier to work with and manipulate data in Swift-based applications. This tool simplifies the process of transforming JSON data into a format that can be easily integrated into Swift code, saving developers time and effort.",
      "$keywords": [
        "convert",
        "JSON",
        "Swift Struct",
        "transform"
      ]
    },
    "id": "json-to-swift-struct"
  },
  {
    "zh-cn": {
      "$name": "JSON到Objective-C接口",
      "$description": "JSON到Objective-C接口工具是一款软件应用程序，可以将JSON数据转换为Objective-C接口格式。该工具允许开发人员轻松地将JSON数据转换为可用于Objective-C编程的格式，从而更容易地将来自各种来源的数据集成到其应用程序中。",
      "$keywords": [
        "转换",
        "JSON",
        "Objective-C接口",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Objective-C 介面",
      "$description": "JSON 轉 Objective-C 介面工具是一款軟體應用程式，可將 JSON 資料轉換為 Objective-C 介面格式。此工具讓開發人員能輕鬆將 JSON 資料轉換為可用於 Objective-C 程式設計的格式，使整合來自各種來源的資料更加容易。",
      "$keywords": [
        "轉換",
        "JSON",
        "Objective-C 介面",
        "轉換"
      ]
    },
    "es": {
      "$name": "Interfaz JSON a Objective-C",
      "$description": "La herramienta Interfaz JSON a Objective-C es una aplicación de software que permite la conversión de datos JSON en un formato de Interfaz Objective-C. Esta herramienta permite a los desarrolladores transformar fácilmente datos JSON en un formato que se puede utilizar en la programación Objective-C, lo que facilita la integración de datos de diversas fuentes en sus aplicaciones.",
      "$keywords": [
        "convertir",
        "JSON",
        "Interfaz Objective-C",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからObjective-Cインターフェースへの変換ツール",
      "$description": "JSONからObjective-Cインターフェースへの変換ツールは、JSONデータをObjective-Cインターフェース形式に変換することができるソフトウェアアプリケーションです。このツールにより、開発者は簡単にJSONデータをObjective-Cプログラミングで使用できる形式に変換することができ、さまざまなソースからのデータをアプリケーションに統合することが容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Objective-Cインターフェース",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Objective-C 인터페이스",
      "$description": "JSON to Objective-C 인터페이스 도구는 JSON 데이터를 Objective-C 인터페이스 형식으로 변환하는 소프트웨어 애플리케이션입니다. 이 도구를 사용하면 개발자는 JSON 데이터를 Objective-C 프로그래밍에서 사용할 수 있는 형식으로 쉽게 변환할 수 있으므로 다양한 소스에서 데이터를 통합하는 것이 더욱 쉬워집니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Objective-C 인터페이스",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Objective-C Interface",
      "$description": "Das JSON zu Objective-C Interface-Tool ist eine Softwareanwendung, die die Konvertierung von JSON-Daten in ein Objective-C Interface-Format ermöglicht. Mit diesem Tool können Entwickler JSON-Daten einfach in ein Format umwandeln, das in der Objective-C-Programmierung verwendet werden kann. Dadurch wird es einfacher, Daten aus verschiedenen Quellen in ihre Anwendungen zu integrieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Objective-C Interface",
        "umwandeln"
      ]
    },
    "fr": {
      "$name": "Interface JSON vers Objective-C",
      "$description": "L'outil Interface JSON vers Objective-C est une application logicielle qui permet la conversion de données JSON en format Interface Objective-C. Cet outil permet aux développeurs de transformer facilement des données JSON en un format utilisable dans la programmation Objective-C, facilitant ainsi l'intégration de données provenant de sources diverses dans leurs applications.",
      "$keywords": [
        "convertir",
        "JSON",
        "Interface Objective-C",
        "transformer"
      ]
    },
    "it": {
      "$name": "Interfaccia JSON to Objective-C",
      "$description": "L'Interfaccia JSON to Objective-C è un'applicazione software che consente la conversione dei dati JSON in un formato di interfaccia Objective-C. Questo strumento consente agli sviluppatori di trasformare facilmente i dati JSON in un formato utilizzabile nella programmazione Objective-C, semplificando l'integrazione di dati provenienti da varie fonti nelle loro applicazioni.",
      "$keywords": [
        "convertire",
        "JSON",
        "Interfaccia Objective-C",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "Интерфейс JSON в Objective-C",
      "$description": "Инструмент Интерфейс JSON в Objective-C - это приложение, которое позволяет преобразовывать данные JSON в формат интерфейса Objective-C. Этот инструмент позволяет разработчикам легко преобразовывать данные JSON в формат, который можно использовать в программировании Objective-C, что упрощает интеграцию данных из различных источников в их приложения.",
      "$keywords": [
        "преобразование",
        "JSON",
        "интерфейс Objective-C",
        "преобразование"
      ]
    },
    "pt": {
      "$name": "Interface JSON para Objective-C",
      "$description": "A ferramenta Interface JSON para Objective-C é um aplicativo de software que permite a conversão de dados JSON em um formato de Interface Objective-C. Essa ferramenta permite que os desenvolvedores transformem facilmente dados JSON em um formato que pode ser usado na programação Objective-C, tornando mais fácil a integração de dados de várias fontes em suas aplicações.",
      "$keywords": [
        "converter",
        "JSON",
        "Interface Objective-C",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Objective-C Interface",
      "$description": "The JSON to Objective-C Interface tool is a software application that enables the conversion of JSON data into an Objective-C Interface format. This tool allows developers to easily transform JSON data into a format that can be used in Objective-C programming, making it easier to integrate data from various sources into their applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Objective-C Interface",
        "transform"
      ]
    },
    "id": "json-to-objective-c-interface"
  },
  {
    "zh-cn": {
      "$name": "JSON转Haskell模块",
      "$description": "JSON转Haskell模块是一款工具，允许用户将JSON数据转换为Haskell模块。这种转换使用户能够在Haskell编程语言中以更结构化和类型安全的方式处理JSON数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Haskell模块",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Haskell 模組",
      "$description": "JSON 轉 Haskell 模組是一個工具，允許使用者將 JSON 資料轉換為 Haskell 模組。這種轉換使得使用者可以在 Haskell 程式語言中以更有結構和類型安全的方式處理 JSON 資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "Haskell 模組",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Módulo Haskell",
      "$description": "JSON a Módulo Haskell es una herramienta que permite a los usuarios convertir datos JSON en un módulo Haskell. Esta transformación permite al usuario trabajar con los datos JSON de manera más estructurada y segura en el lenguaje de programación Haskell.",
      "$keywords": [
        "convertir",
        "JSON",
        "Módulo Haskell",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからHaskellモジュールへの変換ツール",
      "$description": "JSON to Haskell Moduleは、ユーザーがJSONデータをHaskellモジュールに変換できるツールです。この変換により、Haskellプログラミング言語内でJSONデータをより構造化された、型安全な方法で扱うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Haskellモジュール",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Haskell 모듈",
      "$description": "JSON to Haskell 모듈은 사용자가 JSON 데이터를 Haskell 모듈로 변환할 수 있는 도구입니다. 이 변환은 Haskell 프로그래밍 언어 내에서 JSON 데이터를 보다 구조화되고 타입 안전한 방식으로 작업할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Haskell 모듈",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Haskell-Modul",
      "$description": "JSON zu Haskell-Modul ist ein Tool, das es Benutzern ermöglicht, JSON-Daten in ein Haskell-Modul umzuwandeln. Diese Transformation ermöglicht es dem Benutzer, mit den JSON-Daten innerhalb der Haskell-Programmiersprache auf eine strukturiertere und typsichere Weise zu arbeiten.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Haskell-Modul",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Module Haskell",
      "$description": "JSON vers Module Haskell est un outil qui permet aux utilisateurs de convertir des données JSON en un module Haskell. Cette transformation permet à l'utilisateur de travailler avec les données JSON de manière plus structurée et sûre au sein du langage de programmation Haskell.",
      "$keywords": [
        "convertir",
        "JSON",
        "Module Haskell",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Haskell Module",
      "$description": "JSON to Haskell Module è uno strumento che consente agli utenti di convertire i dati JSON in un modulo Haskell. Questa trasformazione consente all'utente di lavorare con i dati JSON in modo più strutturato e sicuro dal punto di vista dei tipi all'interno del linguaggio di programmazione Haskell.",
      "$keywords": [
        "convertire",
        "JSON",
        "modulo Haskell",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в модуль Haskell",
      "$description": "JSON в модуль Haskell - это инструмент, который позволяет пользователям преобразовывать данные JSON в модуль Haskell. Это преобразование позволяет пользователю работать с данными JSON более структурированным и типобезопасным способом в языке программирования Haskell.",
      "$keywords": [
        "преобразование",
        "JSON",
        "модуль Haskell",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Módulo Haskell",
      "$description": "JSON para Módulo Haskell é uma ferramenta que permite aos usuários converter dados JSON em um módulo Haskell. Essa transformação permite que o usuário trabalhe com os dados JSON de maneira mais estruturada e segura em termos de tipo dentro da linguagem de programação Haskell.",
      "$keywords": [
        "converter",
        "JSON",
        "Módulo Haskell",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Haskell Module",
      "$description": "JSON to Haskell Module is a tool that allows users to convert JSON data into a Haskell module. This transformation enables the user to work with the JSON data in a more structured and type-safe manner within the Haskell programming language.",
      "$keywords": [
        "convert",
        "JSON",
        "Haskell Module",
        "transform"
      ]
    },
    "id": "json-to-haskell-module"
  },
  {
    "zh-cn": {
      "$name": "JSON转Pike类",
      "$description": "JSON转Pike类是一款工具，允许用户轻松将JSON数据转换为Pike类对象。这种转换使开发人员能够以更有结构和组织的方式处理JSON数据，使其更容易在应用程序中操作和利用。",
      "$keywords": [
        "转换",
        "JSON",
        "Pike类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Pike 類別",
      "$description": "JSON 轉 Pike 類別是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Pike 類別物件。這種轉換讓開發人員可以更有結構性和有組織地處理 JSON 資料，使其更容易在應用程式中操作和利用。",
      "$keywords": [
        "轉換",
        "JSON",
        "Pike 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase Pike",
      "$description": "JSON a Clase Pike es una herramienta que permite a los usuarios convertir fácilmente datos JSON en objetos de Clase Pike. Esta transformación permite a los desarrolladores trabajar con datos JSON de manera más estructurada y organizada, lo que facilita su manipulación y utilización en sus aplicaciones.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase Pike",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからPikeクラスへの変換ツール",
      "$description": "JSON to Pike Classは、ユーザーがJSONデータを簡単にPikeクラスオブジェクトに変換できるツールです。この変換により、開発者はJSONデータをより構造化された形式で扱い、アプリケーションでより簡単に操作および利用できるようになります。",
      "$keywords": [
        "変換",
        "JSON",
        "Pikeクラス",
        "変換"
      ]
    },
    "ko": {
      "$name": "JSON to Pike Class",
      "$description": "JSON to Pike Class는 사용자가 JSON 데이터를 쉽게 Pike Class 객체로 변환할 수 있는 도구입니다. 이 변환은 개발자가 JSON 데이터를 보다 구조화되고 조직적인 방식으로 다룰 수 있도록 하여 응용 프로그램에서 쉽게 조작하고 활용할 수 있게 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Pike Class",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Pike-Klasse",
      "$description": "JSON to Pike Class ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in Pike-Klassenobjekte umzuwandeln. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten auf eine strukturiertere und organisierte Weise zu arbeiten, was es einfacher macht, sie in ihren Anwendungen zu manipulieren und zu nutzen.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Pike-Klasse",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe Pike",
      "$description": "JSON vers Classe Pike est un outil qui permet aux utilisateurs de convertir facilement des données JSON en objets de classe Pike. Cette transformation permet aux développeurs de travailler avec des données JSON de manière plus structurée et organisée, ce qui facilite leur manipulation et leur utilisation dans leurs applications.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe Pike",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Pike Class",
      "$description": "JSON to Pike Class è uno strumento che consente agli utenti di convertire facilmente i dati JSON in oggetti di classe Pike. Questa trasformazione consente agli sviluppatori di lavorare con i dati JSON in modo più strutturato e organizzato, rendendolo più facile da manipolare e utilizzare nelle loro applicazioni.",
      "$keywords": [
        "convertire",
        "JSON",
        "Pike Class",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в класс Pike",
      "$description": "JSON в класс Pike - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в объекты класса Pike. Это преобразование позволяет разработчикам работать с данными JSON более структурированно и организованно, что упрощает их манипулирование и использование в приложениях.",
      "$keywords": [
        "преобразование",
        "JSON",
        "класс Pike",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe Pike",
      "$description": "JSON para Classe Pike é uma ferramenta que permite aos usuários converter facilmente dados JSON em objetos de Classe Pike. Essa transformação permite que os desenvolvedores trabalhem com dados JSON de maneira mais estruturada e organizada, tornando mais fácil manipulá-los e utilizá-los em suas aplicações.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe Pike",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Pike Class",
      "$description": "JSON to Pike Class is a tool that allows users to easily convert JSON data into Pike Class objects. This transformation enables developers to work with JSON data in a more structured and organized manner, making it easier to manipulate and utilize in their applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Pike Class",
        "transform"
      ]
    },
    "id": "json-to-pike-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转Elm模块",
      "$description": "JSON转Elm模块是一款工具，允许用户轻松将JSON数据转换为Elm模块格式。此转换使开发人员能够无缝地将JSON数据集成到他们的Elm应用程序中，从而更轻松地管理和操作应用程序中的数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Elm模块",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Elm 模組",
      "$description": "JSON 轉 Elm 模組是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 Elm 模組格式。這個轉換讓開發者可以無縫地將 JSON 資料整合到他們的 Elm 應用程式中，使得在應用程式中管理和操作資料更加容易。",
      "$keywords": [
        "轉換",
        "JSON",
        "Elm 模組",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Módulo Elm",
      "$description": "JSON a Módulo Elm es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de Módulo Elm. Esta transformación permite a los desarrolladores integrar sin problemas datos JSON en sus aplicaciones Elm, lo que facilita la gestión y manipulación de datos dentro de la aplicación.",
      "$keywords": [
        "convertir",
        "JSON",
        "Módulo Elm",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSON to Elm Module",
      "$description": "JSON to Elm Moduleは、ユーザーがJSONデータを簡単にElm Module形式に変換できるツールです。この変換により、開発者はJSONデータをElmアプリケーションにシームレスに統合し、アプリケーション内でデータを管理および操作することが容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Elm Module",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Elm Module",
      "$description": "JSON to Elm Module은 사용자가 JSON 데이터를 쉽게 Elm Module 형식으로 변환할 수 있는 도구입니다. 이 변환은 개발자가 JSON 데이터를 Elm 애플리케이션에 매끄럽게 통합할 수 있도록 하여 애플리케이션 내에서 데이터를 더 쉽게 관리하고 조작할 수 있게 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Elm Module",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Elm-Modul",
      "$description": "JSON zu Elm-Modul ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das Elm-Modul-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, JSON-Daten nahtlos in ihre Elm-Anwendungen zu integrieren, was die Verwaltung und Manipulation von Daten innerhalb der Anwendung erleichtert.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Elm-Modul",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Module Elm",
      "$description": "JSON vers Module Elm est un outil qui permet aux utilisateurs de convertir facilement des données JSON au format Module Elm. Cette transformation permet aux développeurs d'intégrer sans effort des données JSON dans leurs applications Elm, facilitant ainsi la gestion et la manipulation des données au sein de l'application.",
      "$keywords": [
        "convertir",
        "JSON",
        "Module Elm",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Elm Module",
      "$description": "JSON to Elm Module è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato di modulo Elm. Questa trasformazione consente agli sviluppatori di integrare senza soluzione di continuità i dati JSON nelle loro applicazioni Elm, rendendo più facile gestire e manipolare i dati all'interno dell'applicazione.",
      "$keywords": [
        "convertire",
        "JSON",
        "modulo Elm",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в модуль Elm",
      "$description": "JSON в модуль Elm - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат модуля Elm. Это преобразование позволяет разработчикам без проблем интегрировать данные JSON в свои приложения Elm, что упрощает управление и манипулирование данными в приложении.",
      "$keywords": [
        "преобразовать",
        "JSON",
        "модуль Elm",
        "преобразование"
      ]
    },
    "pt": {
      "$name": "JSON para Módulo Elm",
      "$description": "JSON para Módulo Elm é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Módulo Elm. Essa transformação permite que os desenvolvedores integrem facilmente dados JSON em suas aplicações Elm, tornando mais fácil gerenciar e manipular dados dentro da aplicação.",
      "$keywords": [
        "converter",
        "JSON",
        "Módulo Elm",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Elm Module",
      "$description": "JSON to Elm Module is a tool that allows users to easily convert JSON data into Elm Module format. This transformation enables developers to seamlessly integrate JSON data into their Elm applications, making it easier to manage and manipulate data within the application.",
      "$keywords": [
        "convert",
        "JSON",
        "Elm Module",
        "transform"
      ]
    },
    "id": "json-to-elm-module"
  },
  {
    "zh-cn": {
      "$name": "JSON转Crystal类",
      "$description": "JSON转Crystal类是一款工具，允许用户轻松将JSON数据转换为Crystal类格式。这种转换使开发人员能够在他们的Crystal应用程序中高效地处理JSON数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Crystal类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Crystal 類別",
      "$description": "JSON 轉 Crystal 類別是一個工具，讓使用者能夠輕鬆地將 JSON 資料轉換成 Crystal 類別格式。這個轉換讓開發人員能夠有效地在他們的 Crystal 應用程式中處理 JSON 資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "Crystal 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase Crystal",
      "$description": "JSON a Clase Crystal es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de Clase Crystal. Esta transformación permite a los desarrolladores trabajar eficientemente con datos JSON en sus aplicaciones de Crystal.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase Crystal",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSON to Crystal Class",
      "$description": "JSON to Crystal Classは、ユーザーがJSONデータを簡単にCrystal Class形式に変換できるツールです。この変換により、開発者はCrystalアプリケーションでJSONデータを効率的に扱うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Crystal Class",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Crystal Class",
      "$description": "JSON to Crystal Class는 사용자가 JSON 데이터를 쉽게 Crystal Class 형식으로 변환할 수 있는 도구입니다. 이 변환은 개발자가 Crystal 애플리케이션에서 JSON 데이터를 효율적으로 처리할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Crystal Class",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Crystal Class",
      "$description": "JSON to Crystal Class ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das Crystal Class-Format zu konvertieren. Diese Transformation ermöglicht es Entwicklern, effizient mit JSON-Daten in ihren Crystal-Anwendungen zu arbeiten.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Crystal Class",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe Crystal",
      "$description": "JSON vers Classe Crystal est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format de classe Crystal. Cette transformation permet aux développeurs de travailler efficacement avec des données JSON dans leurs applications Crystal.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe Crystal",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Crystal Class",
      "$description": "JSON to Crystal Class è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato di classe Crystal. Questa trasformazione consente agli sviluppatori di lavorare efficientemente con i dati JSON nelle loro applicazioni Crystal.",
      "$keywords": [
        "convertire",
        "JSON",
        "Classe Crystal",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в класс Crystal",
      "$description": "JSON в класс Crystal - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат класса Crystal. Это преобразование позволяет разработчикам эффективно работать с данными JSON в своих приложениях Crystal.",
      "$keywords": [
        "преобразование",
        "JSON",
        "класс Crystal",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe Crystal",
      "$description": "JSON para Classe Crystal é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato de Classe Crystal. Essa transformação permite que os desenvolvedores trabalhem eficientemente com dados JSON em suas aplicações Crystal.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe Crystal",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Crystal Class",
      "$description": "JSON to Crystal Class is a tool that allows users to easily convert JSON data into Crystal Class format. This transformation enables developers to efficiently work with JSON data in their Crystal applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Crystal Class",
        "transform"
      ]
    },
    "id": "json-to-crystal-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转JSON Schema",
      "$description": "JSON转JSON Schema是一款工具，允许用户将JSON数据转换为JSON schema格式。这种转换使用户能够根据预定义的模式验证和确保其JSON数据的一致性。",
      "$keywords": [
        "转换",
        "JSON",
        "Schema",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 JSON Schema",
      "$description": "JSON 轉 JSON Schema 是一個工具，允許使用者將 JSON 資料轉換成 JSON schema 格式。這個轉換讓使用者能夠驗證和確保他們的 JSON 資料符合預定義的 schema。",
      "$keywords": [
        "轉換",
        "JSON",
        "Schema",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a JSON Schema",
      "$description": "JSON a JSON Schema es una herramienta que permite a los usuarios convertir datos JSON en un formato de esquema JSON. Esta transformación permite a los usuarios validar y asegurar la consistencia de sus datos JSON contra un esquema predefinido.",
      "$keywords": [
        "convertir",
        "JSON",
        "esquema",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSON to JSON Schema",
      "$description": "JSON to JSON Schemaは、ユーザーがJSONデータをJSONスキーマ形式に変換できるツールです。この変換により、ユーザーは事前定義されたスキーマに対してJSONデータの整合性を検証し、確認することができます。",
      "$keywords": [
        "変換",
        "JSON",
        "スキーマ",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to JSON Schema",
      "$description": "JSON to JSON Schema는 사용자가 JSON 데이터를 JSON 스키마 형식으로 변환할 수 있는 도구입니다. 이 변환을 통해 사용자는 미리 정의된 스키마에 대해 JSON 데이터를 유효성 검사하고 일관성을 보장할 수 있습니다.",
      "$keywords": [
        "변환",
        "JSON",
        "스키마",
        "유형 변환"
      ]
    },
    "de": {
      "$name": "JSON zu JSON-Schema",
      "$description": "JSON to JSON Schema ist ein Tool, das es Benutzern ermöglicht, JSON-Daten in ein JSON-Schema-Format zu konvertieren. Diese Transformation ermöglicht es Benutzern, ihre JSON-Daten gegen ein vordefiniertes Schema zu validieren und deren Konsistenz sicherzustellen.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Schema",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers JSON Schema",
      "$description": "JSON vers JSON Schema est un outil qui permet aux utilisateurs de convertir des données JSON en un format de schéma JSON. Cette transformation permet aux utilisateurs de valider et d'assurer la cohérence de leurs données JSON par rapport à un schéma prédéfini.",
      "$keywords": [
        "convertir",
        "JSON",
        "Schéma",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to JSON Schema",
      "$description": "JSON to JSON Schema è uno strumento che consente agli utenti di convertire i dati JSON in un formato di schema JSON. Questa trasformazione consente agli utenti di convalidare e garantire la coerenza dei loro dati JSON rispetto a uno schema predefinito.",
      "$keywords": [
        "convertire",
        "JSON",
        "Schema",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в JSON Schema",
      "$description": "JSON в JSON Schema - это инструмент, который позволяет пользователям преобразовывать данные JSON в формат JSON схемы. Это преобразование позволяет пользователям проверять и обеспечивать согласованность своих данных JSON с предопределенной схемой.",
      "$keywords": [
        "преобразование",
        "JSON",
        "схема",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para JSON Schema",
      "$description": "JSON para JSON Schema é uma ferramenta que permite aos usuários converter dados JSON em um formato de esquema JSON. Essa transformação permite aos usuários validar e garantir a consistência de seus dados JSON em relação a um esquema predefinido.",
      "$keywords": [
        "converter",
        "JSON",
        "esquema",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to JSON Schema",
      "$description": "JSON to JSON Schema is a tool that allows users to convert JSON data into a JSON schema format. This transformation enables users to validate and ensure the consistency of their JSON data against a predefined schema.",
      "$keywords": [
        "convert",
        "JSON",
        "Schema",
        "transform"
      ]
    },
    "id": "json-to-json-schema"
  },
  {
    "zh-cn": {
      "$name": "JSON转Kotlin类",
      "$description": "JSON转Kotlin类是一款工具，允许开发人员轻松将JSON数据转换为Kotlin类。这种转换简化了在Kotlin中处理JSON数据的过程，使其更容易操作和在应用程序中使用。",
      "$keywords": [
        "转换",
        "JSON",
        "Kotlin类",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Kotlin 類別",
      "$description": "JSON 轉 Kotlin 類別是一個工具，允許開發人員輕鬆將 JSON 資料轉換為 Kotlin 類別。這個轉換簡化了在 Kotlin 中處理 JSON 資料的過程，使其更容易操作和應用於應用程式中。",
      "$keywords": [
        "轉換",
        "JSON",
        "Kotlin 類別",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Clase Kotlin",
      "$description": "JSON a Clase Kotlin es una herramienta que permite a los desarrolladores convertir fácilmente datos JSON en clases Kotlin. Esta transformación simplifica el proceso de trabajar con datos JSON en Kotlin, lo que facilita su manipulación y uso en aplicaciones.",
      "$keywords": [
        "convertir",
        "JSON",
        "Clase Kotlin",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからKotlinクラスへの変換ツール",
      "$description": "JSONからKotlinクラスへの変換ツールは、開発者がJSONデータを簡単にKotlinクラスに変換できるようにするツールです。この変換により、KotlinでJSONデータを扱うプロセスが簡素化され、アプリケーションでの操作や使用が容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "Kotlinクラス",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON을 Kotlin 클래스로 변환",
      "$description": "JSON을 Kotlin 클래스로 변환하는 도구로, 개발자들은 JSON 데이터를 쉽게 Kotlin 클래스로 변환할 수 있습니다. 이 변환은 Kotlin에서 JSON 데이터를 다루는 과정을 단순화하여 애플리케이션에서 쉽게 조작하고 사용할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Kotlin 클래스",
        "단순화"
      ]
    },
    "de": {
      "$name": "JSON zu Kotlin-Klasse",
      "$description": "JSON zu Kotlin-Klasse ist ein Tool, das es Entwicklern ermöglicht, JSON-Daten einfach in Kotlin-Klassen umzuwandeln. Diese Transformation vereinfacht den Prozess der Arbeit mit JSON-Daten in Kotlin und erleichtert die Manipulation und Verwendung in Anwendungen.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Kotlin-Klasse",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Classe Kotlin",
      "$description": "JSON vers Classe Kotlin est un outil qui permet aux développeurs de convertir facilement des données JSON en classes Kotlin. Cette transformation simplifie le processus de travail avec des données JSON en Kotlin, le rendant plus facile à manipuler et à utiliser dans les applications.",
      "$keywords": [
        "convertir",
        "JSON",
        "Classe Kotlin",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Kotlin Class",
      "$description": "JSON to Kotlin Class è uno strumento che consente agli sviluppatori di convertire facilmente i dati JSON in classi Kotlin. Questa trasformazione semplifica il processo di lavoro con i dati JSON in Kotlin, rendendolo più facile da manipolare e utilizzare nelle applicazioni.",
      "$keywords": [
        "convertire",
        "JSON",
        "classe Kotlin",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в класс Kotlin",
      "$description": "JSON в класс Kotlin - это инструмент, который позволяет разработчикам легко преобразовывать данные JSON в классы Kotlin. Это упрощает процесс работы с данными JSON в Kotlin, делая их более удобными для манипулирования и использования в приложениях.",
      "$keywords": [
        "преобразование",
        "JSON",
        "класс Kotlin",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Classe Kotlin",
      "$description": "JSON para Classe Kotlin é uma ferramenta que permite aos desenvolvedores converter facilmente dados JSON em classes Kotlin. Essa transformação simplifica o processo de trabalhar com dados JSON em Kotlin, tornando mais fácil manipulá-los e usá-los em aplicativos.",
      "$keywords": [
        "converter",
        "JSON",
        "Classe Kotlin",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Kotlin Class",
      "$description": "JSON to Kotlin Class is a tool that allows developers to easily convert JSON data into Kotlin classes. This transformation simplifies the process of working with JSON data in Kotlin, making it easier to manipulate and use in applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Kotlin Class",
        "transform"
      ]
    },
    "id": "json-to-kotlin-class"
  },
  {
    "zh-cn": {
      "$name": "JSON转TOML",
      "$description": "JSON转TOML是一款工具，允许用户轻松将JSON文件转换为TOML格式。这种转换使用户能够使用TOML文件，这些文件比JSON文件更易于阅读和编辑。",
      "$keywords": [
        "转换",
        "JSON",
        "TOML",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 TOML",
      "$description": "JSON 轉 TOML 是一個工具，讓使用者可以輕鬆地將 JSON 檔案轉換為 TOML 格式。這種轉換使使用者能夠使用比 JSON 檔案更易於閱讀和編輯的 TOML 檔案。",
      "$keywords": [
        "轉換",
        "JSON",
        "TOML",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a TOML",
      "$description": "JSON a TOML es una herramienta que permite a los usuarios convertir fácilmente archivos JSON al formato TOML. Esta transformación permite a los usuarios trabajar con archivos TOML, que son más legibles para los humanos y más fáciles de editar que los archivos JSON.",
      "$keywords": [
        "convertir",
        "JSON",
        "TOML",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからTOMLへの変換ツール",
      "$description": "JSONからTOMLへの変換ツールは、ユーザーが簡単にJSONファイルをTOML形式に変換できるようにするツールです。この変換により、TOMLファイルで作業することができ、JSONファイルよりも人間が読みやすく編集しやすくなります。",
      "$keywords": [
        "変換",
        "JSON",
        "TOML",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to TOML",
      "$description": "JSON to TOML은 사용자가 JSON 파일을 TOML 형식으로 쉽게 변환할 수 있는 도구입니다. 이 변환은 사용자가 JSON 파일보다 인간이 읽기 쉽고 편집하기 쉬운 TOML 파일로 작업할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "TOML",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu TOML",
      "$description": "JSON zu TOML ist ein Tool, das Benutzern ermöglicht, JSON-Dateien einfach in TOML-Format zu konvertieren. Diese Transformation ermöglicht es Benutzern, mit TOML-Dateien zu arbeiten, die lesbarer und einfacher zu bearbeiten sind als JSON-Dateien.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "TOML",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers TOML",
      "$description": "JSON vers TOML est un outil qui permet aux utilisateurs de convertir facilement des fichiers JSON au format TOML. Cette transformation permet aux utilisateurs de travailler avec des fichiers TOML, qui sont plus lisibles et plus faciles à éditer que les fichiers JSON.",
      "$keywords": [
        "convertir",
        "JSON",
        "TOML",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to TOML",
      "$description": "JSON to TOML è uno strumento che consente agli utenti di convertire facilmente i file JSON nel formato TOML. Questa trasformazione consente agli utenti di lavorare con file TOML, che sono più leggibili dall'essere umano e più facili da modificare rispetto ai file JSON.",
      "$keywords": [
        "convertire",
        "JSON",
        "TOML",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в TOML",
      "$description": "JSON в TOML - это инструмент, который позволяет пользователям легко преобразовывать файлы JSON в формат TOML. Это преобразование позволяет пользователям работать с файлами TOML, которые более удобочитаемы и проще редактируются, чем файлы JSON.",
      "$keywords": [
        "преобразование",
        "JSON",
        "TOML",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para TOML",
      "$description": "JSON para TOML é uma ferramenta que permite aos usuários converter facilmente arquivos JSON para o formato TOML. Essa transformação permite que os usuários trabalhem com arquivos TOML, que são mais legíveis para humanos e mais fáceis de editar do que arquivos JSON.",
      "$keywords": [
        "converter",
        "JSON",
        "TOML",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to TOML",
      "$description": "JSON to TOML is a conversion tool that allows users to transform JSON data into TOML format. This tool simplifies the process of converting JSON files to TOML, making it easier for users to work with different data formats.",
      "$keywords": [
        "convert",
        "JSON",
        "TOML",
        "transform"
      ]
    },
    "id": "json-to-toml"
  },
  {
    "zh-cn": {
      "$name": "JSON转XML",
      "$description": "JSON转XML是一款工具，允许用户轻松将JSON数据转换为XML格式。使用此工具，用户可以将其JSON数据转换为更结构化和可读的格式，从而更容易分析和操作。",
      "$keywords": [
        "转换",
        "JSON",
        "XML",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 XML",
      "$description": "JSON 轉 XML 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 XML 格式。使用此工具，使用者可以將其 JSON 資料轉換為更有結構和可讀性的格式，使其更容易分析和操作。",
      "$keywords": [
        "轉換",
        "JSON",
        "XML",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a XML",
      "$description": "JSON a XML es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato XML. Con esta herramienta, los usuarios pueden transformar sus datos JSON en un formato más estructurado y legible, lo que facilita su análisis y manipulación.",
      "$keywords": [
        "convertir",
        "JSON",
        "XML",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからXMLへの変換",
      "$description": "JSONからXMLは、ユーザーがJSONデータを簡単にXML形式に変換できるツールです。このツールを使用すると、ユーザーはJSONデータをより構造化された読みやすい形式に変換して、分析や操作をより簡単に行うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "XML",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to XML",
      "$description": "JSON to XML은 사용자가 JSON 데이터를 쉽게 XML 형식으로 변환할 수 있는 도구입니다. 이 도구를 사용하면 사용자는 JSON 데이터를 더 구조화되고 읽기 쉬운 형식으로 변환하여 분석 및 조작하기 쉬워집니다.",
      "$keywords": [
        "변환",
        "JSON",
        "XML",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu XML",
      "$description": "JSON zu XML ist ein Tool, mit dem Benutzer JSON-Daten einfach in das XML-Format konvertieren können. Mit diesem Tool können Benutzer ihre JSON-Daten in ein strukturierteres und lesbareres Format umwandeln, was die Analyse und Manipulation erleichtert.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "XML",
        "umwandeln"
      ]
    },
    "fr": {
      "$name": "JSON vers XML",
      "$description": "JSON vers XML est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format XML. Avec cet outil, les utilisateurs peuvent transformer leurs données JSON en un format plus structuré et lisible, ce qui facilite l'analyse et la manipulation.",
      "$keywords": [
        "convertir",
        "JSON",
        "XML",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to XML",
      "$description": "JSON to XML è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato XML. Con questo strumento, gli utenti possono trasformare i loro dati JSON in un formato più strutturato e leggibile, rendendolo più facile da analizzare e manipolare.",
      "$keywords": [
        "convertire",
        "JSON",
        "XML",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в XML",
      "$description": "JSON в XML - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат XML. С помощью этого инструмента пользователи могут преобразовать свои данные JSON в более структурированный и читаемый формат, что облегчает их анализ и манипулирование.",
      "$keywords": [
        "преобразование",
        "JSON",
        "XML",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para XML",
      "$description": "JSON para XML é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato XML. Com esta ferramenta, os usuários podem transformar seus dados JSON em um formato mais estruturado e legível, tornando mais fácil analisar e manipular.",
      "$keywords": [
        "converter",
        "JSON",
        "XML",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to XML",
      "$description": "JSON to XML is a tool that allows users to easily convert JSON data into XML format. With this tool, users can transform their JSON data into a more structured and readable format, making it easier to analyze and manipulate.",
      "$keywords": [
        "convert",
        "JSON",
        "XML",
        "transform"
      ]
    },
    "id": "json-to-xml"
  },
  {
    "zh-cn": {
      "$name": "JSON格式化",
      "$description": "JSON格式化是一款工具，允许用户以更可读和有组织的方式格式化其JSON代码。它还可以验证JSON代码的语法，以确保其结构正确。",
      "$keywords": [
        "json",
        "美化",
        "漂亮",
        "格式化",
        "fmt",
        "格式化程序",
        "验证",
        "验证器"
      ]
    },
    "zh-tw": {
      "$name": "JSON格式化",
      "$description": "JSON格式化是一個工具，允許用戶以更易讀和有組織的方式格式化其JSON代碼。它還可以驗證JSON代碼的語法，以確保其結構正確。",
      "$keywords": [
        "json",
        "美化",
        "漂亮",
        "格式化",
        "fmt",
        "格式化器",
        "驗證",
        "驗證器"
      ]
    },
    "es": {
      "$name": "Formateo de JSON",
      "$description": "El Formateo de JSON es una herramienta que permite a los usuarios formatear su código JSON de una manera más legible y organizada. También puede validar la sintaxis del código JSON para asegurarse de que esté correctamente estructurado.",
      "$keywords": [
        "json",
        "embellecer",
        "bonito",
        "formatear",
        "fmt",
        "formato",
        "formateador",
        "validar",
        "validador"
      ]
    },
    "ja": {
      "$name": "JSONフォーマット",
      "$description": "JSONフォーマットは、ユーザーがJSONコードをより読みやすく整理された形式でフォーマットできるツールです。また、JSONコードの構文が適切に構造化されていることを確認するために構文を検証することもできます。",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "ko": {
      "$name": "JSON 포맷팅",
      "$description": "JSON 포맷팅은 사용자가 JSON 코드를 더 가독성 있고 조직적인 방식으로 포맷팅할 수 있는 도구입니다. 또한 JSON 코드의 구문이 올바르게 구성되어 있는지 확인하여 유효성을 검사할 수도 있습니다.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "de": {
      "$name": "JSON-Formatierung",
      "$description": "JSON-Formatierung ist ein Tool, das Benutzern ermöglicht, ihren JSON-Code auf eine lesbarere und organisierte Weise zu formatieren. Es kann auch die Syntax des JSON-Codes validieren, um sicherzustellen, dass er ordnungsgemäß strukturiert ist.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "fr": {
      "$name": "Formatage JSON",
      "$description": "Le formatage JSON est un outil qui permet aux utilisateurs de formater leur code JSON de manière plus lisible et organisée. Il peut également valider la syntaxe du code JSON pour s'assurer qu'elle est correctement structurée.",
      "$keywords": [
        "json",
        "embellir",
        "joli",
        "formater",
        "fmt",
        "formatter",
        "valider",
        "validateur"
      ]
    },
    "it": {
      "$name": "Formattazione JSON",
      "$description": "La Formattazione JSON è uno strumento che consente agli utenti di formattare il loro codice JSON in modo più leggibile e organizzato. Può anche convalidare la sintassi del codice JSON per garantire che sia strutturato correttamente.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "ru": {
      "$name": "Форматирование JSON",
      "$description": "Форматирование JSON - это инструмент, который позволяет пользователям форматировать свой код JSON более читабельным и организованным способом. Он также может проверять синтаксис кода JSON, чтобы убедиться, что он правильно структурирован.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "pt": {
      "$name": "Formatação JSON",
      "$description": "A Formatação JSON é uma ferramenta que permite aos usuários formatar seu código JSON de maneira mais legível e organizada. Também pode validar a sintaxe do código JSON para garantir que esteja estruturado corretamente.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "en": {
      "$name": "JSON Formatting",
      "$description": "JSON Formatting is a tool that allows users to format their JSON code in a more readable and organized way. It can also validate the syntax of the JSON code to ensure it is properly structured.",
      "$keywords": [
        "json",
        "beautify",
        "pretty",
        "prettify",
        "fmt",
        "format",
        "formatter",
        "validate",
        "validator"
      ]
    },
    "id": "json-to-pretty"
  },
  {
    "zh-cn": {
      "$name": "JSON转TypeScript接口",
      "$description": "JSON转TypeScript接口工具是一款强大的工具，允许开发人员轻松将JSON数据转换为TypeScript接口。使用此工具，开发人员可以快速将其JSON数据转换为与TypeScript兼容的格式，使其更易于在其代码中使用和操作。该工具旨在简单直观，允许开发人员仅需几个点击即可快速从其JSON数据生成TypeScript接口。",
      "$keywords": [
        "转换",
        "JSON",
        "TypeScript接口",
        "转换",
        "ts"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 TypeScript 介面",
      "$description": "JSON 轉 TypeScript 介面工具是一個強大的工具，允許開發人員輕鬆將 JSON 數據轉換為 TypeScript 介面。使用此工具，開發人員可以快速將其 JSON 數據轉換為與 TypeScript 兼容的格式，使其更容易在代碼中使用和操作。該工具設計簡單直觀，讓開發人員只需點擊幾下即可快速從其 JSON 數據生成 TypeScript 介面。",
      "$keywords": [
        "轉換",
        "JSON",
        "TypeScript 介面",
        "轉換",
        "ts"
      ]
    },
    "es": {
      "$name": "JSON a Interfaz TypeScript",
      "$description": "La herramienta JSON a Interfaz TypeScript es una poderosa herramienta que permite a los desarrolladores convertir fácilmente datos JSON en interfaces TypeScript. Con esta herramienta, los desarrolladores pueden transformar rápidamente sus datos JSON en un formato compatible con TypeScript, lo que facilita su manipulación en su código. La herramienta está diseñada para ser simple e intuitiva, permitiendo a los desarrolladores generar interfaces TypeScript a partir de sus datos JSON con solo unos pocos clics.",
      "$keywords": [
        "convertir",
        "JSON",
        "Interfaz TypeScript",
        "transformar",
        "ts"
      ]
    },
    "ja": {
      "$name": "JSONからTypeScriptインターフェースへの変換ツール",
      "$description": "JSONからTypeScriptインターフェースへの変換ツールは、開発者がJSONデータを簡単にTypeScriptインターフェースに変換できる強力なツールです。このツールを使用すると、開発者はJSONデータをTypeScriptと互換性のある形式に迅速に変換し、コードで簡単に操作できるようになります。このツールはシンプルで直感的に設計されており、開発者はわずか数回のクリックでJSONデータからTypeScriptインターフェースを迅速に生成できます。",
      "$keywords": [
        "変換",
        "JSON",
        "TypeScriptインターフェース",
        "変換",
        "ts"
      ]
    },
    "ko": {
      "$name": "JSON to TypeScript Interface",
      "$description": "JSON to TypeScript Interface 도구는 개발자가 JSON 데이터를 TypeScript 인터페이스로 쉽게 변환할 수 있는 강력한 도구입니다. 이 도구를 사용하면 개발자는 JSON 데이터를 TypeScript와 호환 가능한 형식으로 빠르게 변환하여 코드에서 쉽게 작업하고 조작할 수 있습니다. 이 도구는 간단하고 직관적으로 설계되어 있어 개발자가 몇 번의 클릭만으로 JSON 데이터에서 TypeScript 인터페이스를 빠르게 생성할 수 있습니다.",
      "$keywords": [
        "변환",
        "JSON",
        "TypeScript 인터페이스",
        "변형",
        "ts"
      ]
    },
    "de": {
      "$name": "JSON zu TypeScript Interface",
      "$description": "Das JSON zu TypeScript Interface-Tool ist ein leistungsstarkes Tool, mit dem Entwickler JSON-Daten einfach in TypeScript-Interfaces konvertieren können. Mit diesem Tool können Entwickler ihre JSON-Daten schnell in ein Format umwandeln, das mit TypeScript kompatibel ist, was das Arbeiten und Manipulieren im Code erleichtert. Das Tool ist einfach und intuitiv gestaltet und ermöglicht es Entwicklern, mit nur wenigen Klicks TypeScript-Interfaces aus ihren JSON-Daten zu generieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "TypeScript Interface",
        "umwandeln",
        "ts"
      ]
    },
    "fr": {
      "$name": "JSON vers Interface TypeScript",
      "$description": "L'outil JSON vers Interface TypeScript est un outil puissant qui permet aux développeurs de convertir facilement des données JSON en interfaces TypeScript. Avec cet outil, les développeurs peuvent rapidement transformer leurs données JSON en un format compatible avec TypeScript, ce qui facilite leur manipulation dans leur code. L'outil est conçu pour être simple et intuitif, permettant aux développeurs de générer rapidement des interfaces TypeScript à partir de leurs données JSON en quelques clics.",
      "$keywords": [
        "convertir",
        "JSON",
        "Interface TypeScript",
        "transformer",
        "ts"
      ]
    },
    "it": {
      "$name": "JSON to TypeScript Interface",
      "$description": "Lo strumento JSON to TypeScript Interface è un potente strumento che consente agli sviluppatori di convertire facilmente i dati JSON in interfacce TypeScript. Con questo strumento, gli sviluppatori possono trasformare rapidamente i loro dati JSON in un formato compatibile con TypeScript, rendendolo più facile da lavorare e manipolare nel loro codice. Lo strumento è progettato per essere semplice e intuitivo, consentendo agli sviluppatori di generare rapidamente interfacce TypeScript dai loro dati JSON con pochi clic.",
      "$keywords": [
        "convertire",
        "JSON",
        "Interfaccia TypeScript",
        "trasformare",
        "ts"
      ]
    },
    "ru": {
      "$name": "JSON в TypeScript интерфейс",
      "$description": "Инструмент JSON в TypeScript интерфейс - это мощный инструмент, который позволяет разработчикам легко преобразовывать данные JSON в интерфейсы TypeScript. С помощью этого инструмента разработчики могут быстро преобразовывать свои данные JSON в формат, совместимый с TypeScript, что упрощает работу с ними и их манипулирование в коде. Инструмент разработан таким образом, чтобы быть простым и интуитивно понятным, позволяя разработчикам быстро генерировать интерфейсы TypeScript из своих данных JSON всего за несколько кликов.",
      "$keywords": [
        "преобразование",
        "JSON",
        "TypeScript интерфейс",
        "трансформация",
        "ts"
      ]
    },
    "pt": {
      "$name": "JSON para Interface TypeScript",
      "$description": "A ferramenta JSON para Interface TypeScript é uma poderosa ferramenta que permite aos desenvolvedores converter facilmente dados JSON em interfaces TypeScript. Com esta ferramenta, os desenvolvedores podem transformar rapidamente seus dados JSON em um formato compatível com TypeScript, tornando mais fácil trabalhar e manipular em seu código. A ferramenta é projetada para ser simples e intuitiva, permitindo que os desenvolvedores gerem rapidamente interfaces TypeScript a partir de seus dados JSON com apenas alguns cliques.",
      "$keywords": [
        "converter",
        "JSON",
        "Interface TypeScript",
        "transformar",
        "ts"
      ]
    },
    "en": {
      "$name": "JSON to TypeScript Interface",
      "$description": "The JSON to TypeScript Interface tool is a powerful tool that allows developers to easily convert JSON data into TypeScript interfaces. With this tool, developers can quickly transform their JSON data into a format that is compatible with TypeScript, making it easier to work with and manipulate in their code. The tool is designed to be simple and intuitive, allowing developers to quickly generate TypeScript interfaces from their JSON data with just a few clicks.",
      "$keywords": [
        "convert",
        "JSON",
        "TypeScript Interface",
        "transform",
        "ts"
      ]
    },
    "id": "json-to-typescript-interface"
  },
  {
    "zh-cn": {
      "$name": "JSON转Big Query模式",
      "$description": "JSON转Big Query模式是一款工具，允许用户轻松将JSON数据转换为Big Query模式格式。这个转换过程使用户能够高效地在Big Query中存储和分析他们的JSON数据，Big Query是一个基于云的数据仓库。",
      "$keywords": [
        "转换",
        "JSON",
        "Big Query模式",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉換為 Big Query Schema",
      "$description": "JSON 轉換為 Big Query Schema 是一個工具，允許使用者輕鬆將 JSON 資料轉換為 Big Query Schema 格式。這個轉換過程使使用者能夠有效地在 Big Query 中儲存和分析他們的 JSON 資料，這是一個基於雲端的資料倉庫。",
      "$keywords": [
        "轉換",
        "JSON",
        "Big Query Schema",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Esquema de Big Query",
      "$description": "JSON a Esquema de Big Query es una herramienta que permite a los usuarios convertir fácilmente datos JSON en un formato de esquema de Big Query. Este proceso de transformación permite a los usuarios almacenar y analizar eficientemente sus datos JSON en Big Query, un almacén de datos basado en la nube.",
      "$keywords": [
        "convertir",
        "JSON",
        "Esquema de Big Query",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからBig Queryスキーマへの変換ツール",
      "$description": "JSONからBig Queryスキーマへの変換ツールは、ユーザーがJSONデータを簡単にBig Queryスキーマ形式に変換できるツールです。この変換プロセスにより、ユーザーはクラウドベースのデータウェアハウスであるBig QueryにJSONデータを効率的に保存および分析することができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Big Queryスキーマ",
        "変換"
      ]
    },
    "ko": {
      "$name": "JSON to Big Query Schema",
      "$description": "JSON to Big Query Schema는 사용자가 JSON 데이터를 쉽게 Big Query Schema 형식으로 변환할 수 있는 도구입니다. 이 변환 과정을 통해 사용자는 클라우드 기반 데이터 웨어하우스인 Big Query에서 JSON 데이터를 효율적으로 저장하고 분석할 수 있습니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Big Query Schema",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu Big Query Schema",
      "$description": "JSON to Big Query Schema ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in ein Big Query Schema-Format zu konvertieren. Dieser Transformationsprozess ermöglicht es Benutzern, ihre JSON-Daten effizient in Big Query, einem cloudbasierten Data Warehouse, zu speichern und zu analysieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "Big Query Schema",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers le schéma Big Query",
      "$description": "JSON vers le schéma Big Query est un outil qui permet aux utilisateurs de convertir facilement des données JSON en un format de schéma Big Query. Ce processus de transformation permet aux utilisateurs de stocker et d'analyser efficacement leurs données JSON dans Big Query, un entrepôt de données basé sur le cloud.",
      "$keywords": [
        "convertir",
        "JSON",
        "schéma Big Query",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Big Query Schema",
      "$description": "JSON to Big Query Schema è uno strumento che consente agli utenti di convertire facilmente i dati JSON in un formato di schema Big Query. Questo processo di trasformazione consente agli utenti di archiviare ed analizzare in modo efficiente i loro dati JSON in Big Query, un data warehouse basato su cloud.",
      "$keywords": [
        "convertire",
        "JSON",
        "schema Big Query",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в схему Big Query",
      "$description": "JSON в схему Big Query - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат схемы Big Query. Этот процесс преобразования позволяет пользователям эффективно хранить и анализировать свои данные JSON в Big Query, облачном хранилище данных.",
      "$keywords": [
        "преобразование",
        "JSON",
        "схема Big Query",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Esquema do Big Query",
      "$description": "JSON para Esquema do Big Query é uma ferramenta que permite aos usuários converter facilmente dados JSON em um formato de Esquema do Big Query. Esse processo de transformação permite que os usuários armazenem e analisem eficientemente seus dados JSON no Big Query, um data warehouse baseado em nuvem.",
      "$keywords": [
        "converter",
        "JSON",
        "Esquema do Big Query",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Big Query Schema",
      "$description": "JSON to Big Query Schema is a tool that allows users to easily convert JSON data into a Big Query Schema format. This transformation process enables users to efficiently store and analyze their JSON data in Big Query, a cloud-based data warehouse.",
      "$keywords": [
        "convert",
        "JSON",
        "Big Query Schema",
        "transform"
      ]
    },
    "id": "json-to-big-query-schema"
  },
  {
    "zh-cn": {
      "$name": "JSON转IO-TS",
      "$description": "JSON转IO-TS是一款工具，允许开发人员使用IO-TS库轻松将JSON数据转换为TypeScript接口。这种转换简化了为JSON数据创建类型安全接口的过程，减少了错误的可能性，提高了代码质量。",
      "$keywords": [
        "转换",
        "JSON",
        "IO-TS",
        "转化"
      ]
    },
    "zh-tw": {
      "$name": "JSON to IO-TS",
      "$description": "JSON to IO-TS 是一個工具，讓開發人員可以使用 IO-TS 函式庫輕鬆將 JSON 資料轉換為 TypeScript 介面。這個轉換簡化了為 JSON 資料創建型別安全介面的過程，減少錯誤的可能性，提高代碼質量。",
      "$keywords": [
        "轉換",
        "JSON",
        "IO-TS",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a IO-TS",
      "$description": "JSON a IO-TS es una herramienta que permite a los desarrolladores convertir fácilmente datos JSON en interfaces TypeScript utilizando la biblioteca IO-TS. Esta transformación simplifica el proceso de creación de interfaces seguras para los datos JSON, reduciendo la probabilidad de errores y mejorando la calidad del código.",
      "$keywords": [
        "convertir",
        "JSON",
        "IO-TS",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSON to IO-TS",
      "$description": "JSON to IO-TSは、IO-TSライブラリを使用してJSONデータをTypeScriptインターフェースに簡単に変換できるツールです。この変換により、JSONデータの型安全なインターフェースを作成するプロセスが簡素化され、エラーの可能性が低くなり、コードの品質が向上します。",
      "$keywords": [
        "変換",
        "JSON",
        "IO-TS",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to IO-TS",
      "$description": "JSON to IO-TS는 IO-TS 라이브러리를 사용하여 JSON 데이터를 TypeScript 인터페이스로 쉽게 변환할 수 있는 도구입니다. 이 변환은 JSON 데이터에 대한 타입 안전 인터페이스를 생성하는 과정을 간소화하여 오류 가능성을 줄이고 코드 품질을 향상시킵니다.",
      "$keywords": [
        "변환",
        "JSON",
        "IO-TS",
        "트랜스폼"
      ]
    },
    "de": {
      "$name": "JSON zu IO-TS",
      "$description": "JSON zu IO-TS ist ein Tool, das Entwicklern ermöglicht, JSON-Daten mithilfe der IO-TS-Bibliothek einfach in TypeScript-Schnittstellen umzuwandeln. Diese Transformation vereinfacht den Prozess der Erstellung von typsicheren Schnittstellen für JSON-Daten, reduziert die Wahrscheinlichkeit von Fehlern und verbessert die Code-Qualität.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "IO-TS",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers IO-TS",
      "$description": "JSON vers IO-TS est un outil qui permet aux développeurs de convertir facilement des données JSON en interfaces TypeScript en utilisant la bibliothèque IO-TS. Cette transformation simplifie le processus de création d'interfaces sûres pour les données JSON, réduisant ainsi les risques d'erreurs et améliorant la qualité du code.",
      "$keywords": [
        "convertir",
        "JSON",
        "IO-TS",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to IO-TS",
      "$description": "JSON to IO-TS è uno strumento che consente agli sviluppatori di convertire facilmente i dati JSON in interfacce TypeScript utilizzando la libreria IO-TS. Questa trasformazione semplifica il processo di creazione di interfacce sicure dal punto di vista dei tipi per i dati JSON, riducendo la probabilità di errori e migliorando la qualità del codice.",
      "$keywords": [
        "convertire",
        "JSON",
        "IO-TS",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в IO-TS",
      "$description": "JSON в IO-TS - это инструмент, который позволяет разработчикам легко преобразовывать данные JSON в интерфейсы TypeScript с использованием библиотеки IO-TS. Это преобразование упрощает процесс создания интерфейсов, обеспечивая безопасность типов данных JSON, что снижает вероятность ошибок и улучшает качество кода.",
      "$keywords": [
        "преобразование",
        "JSON",
        "IO-TS",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para IO-TS",
      "$description": "JSON para IO-TS é uma ferramenta que permite aos desenvolvedores converter facilmente dados JSON em interfaces TypeScript usando a biblioteca IO-TS. Essa transformação simplifica o processo de criação de interfaces seguras para dados JSON, reduzindo a probabilidade de erros e melhorando a qualidade do código.",
      "$keywords": [
        "converter",
        "JSON",
        "IO-TS",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to IO-TS",
      "$description": "JSON to IO-TS is a tool that allows developers to easily convert JSON data into TypeScript interfaces using the IO-TS library. This transformation simplifies the process of creating type-safe interfaces for JSON data, reducing the likelihood of errors and improving code quality.",
      "$keywords": [
        "convert",
        "JSON",
        "IO-TS",
        "transform"
      ]
    },
    "id": "json-to-io-ts"
  },
  {
    "zh-cn": {
      "$name": "JSON转Scala",
      "$description": "JSON转Scala是一款工具，允许用户轻松将JSON数据转换为Scala代码。这种转换使开发人员能够在Scala应用程序中更高效、更流畅地处理JSON数据。",
      "$keywords": [
        "转换",
        "JSON",
        "Scala",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Scala",
      "$description": "JSON 轉 Scala 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換為 Scala 程式碼。這個轉換讓開發人員可以更有效率和流暢地在他們的 Scala 應用程式中處理 JSON 資料。",
      "$keywords": [
        "轉換",
        "JSON",
        "Scala",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Scala",
      "$description": "JSON a Scala es una herramienta que permite a los usuarios convertir fácilmente datos JSON en código Scala. Esta transformación permite a los desarrolladores trabajar con datos JSON de manera más eficiente y simplificada dentro de sus aplicaciones Scala.",
      "$keywords": [
        "convertir",
        "JSON",
        "Scala",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからScalaへの変換ツール",
      "$description": "JSON to Scalaは、ユーザーがJSONデータを簡単にScalaコードに変換できるツールです。この変換により、開発者はScalaアプリケーション内でJSONデータをより効率的かつスムーズに扱うことができます。",
      "$keywords": [
        "変換",
        "JSON",
        "Scala",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to Scala",
      "$description": "JSON to Scala는 사용자가 JSON 데이터를 쉽게 Scala 코드로 변환할 수 있는 도구입니다. 이 변환은 개발자가 Scala 애플리케이션 내에서 JSON 데이터를 더 효율적이고 간소화된 방식으로 작업할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "Scala",
        "트랜스폼"
      ]
    },
    "de": {
      "$name": "JSON zu Scala",
      "$description": "JSON zu Scala ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in Scala-Code umzuwandeln. Diese Transformation ermöglicht es Entwicklern, mit JSON-Daten auf eine effizientere und streamline Art innerhalb ihrer Scala-Anwendungen zu arbeiten.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "Scala",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Scala",
      "$description": "JSON vers Scala est un outil qui permet aux utilisateurs de convertir facilement des données JSON en code Scala. Cette transformation permet aux développeurs de travailler avec des données JSON de manière plus efficace et rationalisée au sein de leurs applications Scala.",
      "$keywords": [
        "convertir",
        "JSON",
        "Scala",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to Scala",
      "$description": "JSON to Scala è uno strumento che consente agli utenti di convertire facilmente i dati JSON in codice Scala. Questa trasformazione consente agli sviluppatori di lavorare con i dati JSON in modo più efficiente e snello all'interno delle loro applicazioni Scala.",
      "$keywords": [
        "convertire",
        "JSON",
        "Scala",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в Scala",
      "$description": "JSON в Scala - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в код Scala. Это преобразование позволяет разработчикам работать с данными JSON более эффективно и упорядоченно в рамках их приложений Scala.",
      "$keywords": [
        "преобразование",
        "JSON",
        "Scala",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Scala",
      "$description": "JSON para Scala é uma ferramenta que permite aos usuários converter facilmente dados JSON em código Scala. Essa transformação permite que os desenvolvedores trabalhem com dados JSON de maneira mais eficiente e simplificada em suas aplicações Scala.",
      "$keywords": [
        "converter",
        "JSON",
        "Scala",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to Scala",
      "$description": "JSON to Scala is a tool that allows users to easily convert JSON data into Scala code. This transformation enables developers to work with JSON data in a more efficient and streamlined manner within their Scala applications.",
      "$keywords": [
        "convert",
        "JSON",
        "Scala",
        "transform"
      ]
    },
    "id": "json-to-scala"
  },
  {
    "id": "json-to-sarcastic",
    "zh-cn": {
      "$name": "JSON 转 Sarcastic",
      "$description": "Json 转 Sarcastic 工具是为需要处理复杂数据结构和严格类型要求的开发人员提供的强大解决方案。通过使用Sarcastic库中的is.shape()方法，该工具可以将JSON数据转换为类型检查器并将其合并到对象中，使用户能够验证和格式化输入数据，以确保其符合预期的数据结构和类型规范。该工具专注于Sarcastic、JSON、类型检查、数据结构、输入验证和格式化，是任何希望简化工作流程并提高代码质量的开发人员的必备资源。",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "类型检查",
        "数据结构",
        "输入验证",
        "格式化"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 Sarcastic",
      "$description": "Json 轉 Sarcastic 工具是針對需要處理複雜資料結構和嚴格型別要求的開發人員提供的強大解決方案。通過使用 Sarcastic 函式庫中的 is.shape() 方法，此工具可以將 JSON 資料轉換為類型檢查器並結合為一個物件，讓使用者驗證和格式化輸入資料，以確保其符合預期的資料結構和型別規格。這個工具專注於 Sarcastic、JSON、型別檢查、資料結構、輸入驗證和格式化，是任何開發人員想要簡化工作流程並提高程式碼品質的必備資源。",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "型別檢查",
        "資料結構",
        "輸入驗證",
        "格式化"
      ]
    },
    "es": {
      "$name": "JSON a Sarcastic",
      "$description": "La herramienta Json a sarcástico es una solución poderosa para desarrolladores que necesitan trabajar con estructuras de datos complejas y requisitos estrictos de tipo. Al utilizar el método is.shape() de la biblioteca Sarcastic, esta herramienta puede convertir datos JSON en un verificador de tipos y combinarlo en un objeto, lo que permite a los usuarios validar y formatear los datos de entrada para asegurarse de que se adhieran a las especificaciones esperadas de estructura de datos y tipo. Con su enfoque en Sarcastic, JSON, verificación de tipos, estructura de datos, validación de entrada y formateo, esta herramienta es un recurso esencial para cualquier desarrollador que busque optimizar su flujo de trabajo y mejorar la calidad de su código.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "verificación de tipos",
        "estructura de datos",
        "validación de entrada",
        "formateo"
      ]
    },
    "ja": {
      "$name": "JSON から Sarcastic",
      "$description": "Json から Sarcastic ツールは、複雑なデータ構造と厳密な型要件で作業する必要がある開発者にとって強力なソリューションです。Sarcasticライブラリからis.shape()メソッドを利用することで、このツールはJSONデータを型チェッカーに変換し、オブジェクトに結合することができます。これにより、ユーザーは入力データを検証してフォーマットし、期待されるデータ構造と型仕様に準拠することを保証することができます。Sarcastic、JSON、型チェック、データ構造、入力検証、フォーマットに焦点を当てたこのツールは、ワークフローを効率化し、コードの品質を向上させたいすべての開発者にとって必須のリソースです。",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "型チェック",
        "データ構造",
        "入力検証",
        "フォーマット"
      ]
    },
    "ko": {
      "$name": "JSON 에서 Sarcastic로",
      "$description": "JSON 에서 Sarcastic로 도구는 복잡한 데이터 구조와 엄격한 유형 요구 사항을 처리해야하는 개발자들에게 강력한 솔루션입니다. Sarcastic 라이브러리의 is.shape() 메소드를 활용하여이 도구는 JSON 데이터를 유형 검사기로 변환하고 객체로 결합하여 사용자가 입력 데이터를 유효성 검사하고 형식을 지정하여 예상되는 데이터 구조와 유형 사양을 준수하는지 확인할 수 있습니다. Sarcastic, JSON, 유형 검사, 데이터 구조, 입력 유효성 검사 및 형식 지정에 중점을 둔이 도구는 작업 흐름을 간소화하고 코드의 품질을 향상시키기 위한 필수 자원입니다.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "유형 검사",
        "데이터 구조",
        "입력 유효성 검사",
        "형식 지정"
      ]
    },
    "de": {
      "$name": "JSON zu Sarcastic",
      "$description": "Das JSON zu Sarcastic ist eine leistungsstarke Lösung für Entwickler, die mit komplexen Datenstrukturen und strengen Typanforderungen arbeiten müssen. Durch die Verwendung der is.shape()-Methode aus der Sarcastic-Bibliothek kann dieses Tool JSON-Daten in einen Typ-Checker konvertieren und in ein Objekt kombinieren, sodass Benutzer Eingabedaten validieren und formatieren können, um sicherzustellen, dass sie den erwarteten Datenstrukturen und Typspezifikationen entsprechen. Mit seinem Fokus auf Sarcastic, JSON, Typüberprüfung, Datenstruktur, Eingabevalidierung und Formatierung ist dieses Tool eine unverzichtbare Ressource für jeden Entwickler, der seinen Workflow optimieren und die Qualität seines Codes verbessern möchte.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "Typüberprüfung",
        "Datenstruktur",
        "Eingabevalidierung",
        "Formatierung"
      ]
    },
    "fr": {
      "$name": "JSON vers Sarcastic",
      "$description": "L'outil JSON vers Sarcastic est une solution puissante pour les développeurs qui ont besoin de travailler avec des structures de données complexes et des exigences strictes en matière de type. En utilisant la méthode is.shape() de la bibliothèque Sarcastic, cet outil peut convertir des données JSON en un vérificateur de type et le combiner dans un objet, permettant aux utilisateurs de valider et de formater les données d'entrée pour s'assurer qu'elles respectent les spécifications de structure de données et de type attendues. Avec son accent sur Sarcastic, JSON, la vérification de type, la structure de données, la validation d'entrée et le formatage, cet outil est une ressource essentielle pour tout développeur cherchant à rationaliser son flux de travail et à améliorer la qualité de son code.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "vérification de type",
        "structure de données",
        "validation d'entrée",
        "formatage"
      ]
    },
    "it": {
      "$name": "JSON in Sarcastic",
      "$description": "Lo strumento JSON in Sarcastic è una soluzione potente per gli sviluppatori che devono lavorare con strutture dati complesse e requisiti di tipo rigorosi. Utilizzando il metodo is.shape() della libreria Sarcastic, questo strumento può convertire i dati JSON in un verificatore di tipo e combinarlo in un oggetto, consentendo agli utenti di convalidare e formattare i dati di input per garantire che aderiscano alle specifiche di struttura dati e tipo attese. Con il suo focus su Sarcastic, JSON, verifica del tipo, struttura dati, convalida dell'input e formattazione, questo strumento è una risorsa essenziale per qualsiasi sviluppatore che cerca di razionalizzare il proprio flusso di lavoro e migliorare la qualità del proprio codice.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "verifica del tipo",
        "struttura dati",
        "convalida dell'input",
        "formattazione"
      ]
    },
    "ru": {
      "$name": "JSON в Sarcastic",
      "$description": "Инструмент JSON в Sarcastic - это мощное решение для разработчиков, которые работают с комплексными структурами данных и строгими требованиями к типам. Используя метод is.shape() из библиотеки Sarcastic, этот инструмент может преобразовывать данные JSON в проверку типов и объединять их в объект, позволяя пользователям проверять и форматировать входные данные, чтобы убедиться, что они соответствуют ожидаемой структуре данных и спецификациям типов. С фокусом на Sarcastic, JSON, проверке типов, структуре данных, проверке ввода и форматировании, этот инструмент является необходимым ресурсом для любого разработчика, который хочет оптимизировать свой рабочий процесс и улучшить качество своего кода.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "проверка типов",
        "структура данных",
        "проверка ввода",
        "форматирование"
      ]
    },
    "pt": {
      "$name": "JSON para Sarcastic",
      "$description": "A ferramenta JSON para Sarcastic é uma solução poderosa para desenvolvedores que precisam trabalhar com estruturas de dados complexas e requisitos estritos de tipo. Ao utilizar o método is.shape() da biblioteca Sarcastic, esta ferramenta pode converter dados JSON em um verificador de tipo e combiná-lo em um objeto, permitindo que os usuários validem e formatem dados de entrada para garantir que eles aderem às especificações esperadas de estrutura de dados e tipo. Com seu foco em Sarcastic, JSON, verificação de tipo, estrutura de dados, validação de entrada e formatação, esta ferramenta é um recurso essencial para qualquer desenvolvedor que busca otimizar seu fluxo de trabalho e melhorar a qualidade de seu código.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "verificação de tipo",
        "estrutura de dados",
        "validação de entrada",
        "formatação"
      ]
    },
    "en": {
      "$name": "JSON to Sarcastic",
      "$description": "The JSON to Sarcastic tool is a powerful solution for developers who need to work with complex data structures and strict type requirements. By utilizing the is.shape() method from the Sarcastic library, this tool can convert JSON data into a type checker and combine it into an object, allowing users to validate and format input data to ensure it adheres to the expected data structure and type specifications. With its focus on Sarcastic, JSON, type checking, data structure, input validation, and formatting, this tool is an essential resource for any developer looking to streamline their workflow and improve the quality of their code.",
      "$keywords": [
        "Sarcastic",
        "JSON",
        "type checking",
        "data structure",
        "input validation",
        "formatting"
      ]
    }
  },
  {
    "zh-cn": {
      "$name": "JSON生成器",
      "$description": "JSON生成器是一款基于Web的工具，允许用户通过指定所需的数据结构和值轻松生成JSON代码。它简化了创建JSON对象、数组和嵌套结构的过程，是开发人员和数据分析师的必备工具。",
      "$keywords": [
        "json",
        "生成",
        "生成器"
      ]
    },
    "zh-tw": {
      "$name": "JSON 產生器",
      "$description": "JSON 產生器是一個基於網頁的工具，允許使用者通過指定所需的數據結構和值來輕鬆生成 JSON 代碼。它簡化了創建 JSON 對象、數組和嵌套結構的過程，是開發人員和數據分析師的必備工具。",
      "$keywords": [
        "json",
        "generate",
        "generator"
      ]
    },
    "es": {
      "$name": "Generador de JSON",
      "$description": "Generador de JSON es una herramienta basada en la web que permite a los usuarios generar fácilmente código JSON especificando la estructura de datos y los valores deseados. Simplifica el proceso de creación de objetos JSON, matrices y estructuras anidadas, convirtiéndose en una herramienta esencial para desarrolladores y analistas de datos.",
      "$keywords": [
        "json",
        "generar",
        "generador"
      ]
    },
    "ja": {
      "$name": "JSONジェネレーター",
      "$description": "JSONジェネレーターは、ユーザーが望むデータ構造と値を指定して簡単にJSONコードを生成できるWebベースのツールです。JSONオブジェクト、配列、およびネストされた構造を作成するプロセスを簡素化し、開発者やデータアナリストにとって必須のツールとなっています。",
      "$keywords": [
        "json",
        "generate",
        "generator"
      ]
    },
    "ko": {
      "$name": "JSON 생성기",
      "$description": "JSON 생성기는 사용자가 원하는 데이터 구조와 값을 지정하여 쉽게 JSON 코드를 생성할 수 있는 웹 기반 도구입니다. JSON 객체, 배열 및 중첩 구조를 생성하는 과정을 단순화하여 개발자 및 데이터 분석가에게 필수적인 도구입니다.",
      "$keywords": [
        "json",
        "생성",
        "생성기"
      ]
    },
    "de": {
      "$name": "JSON Generator",
      "$description": "JSON Generator ist ein webbasiertes Tool, mit dem Benutzer JSON-Code einfach generieren können, indem sie die gewünschte Datenstruktur und Werte angeben. Es vereinfacht den Prozess der Erstellung von JSON-Objekten, Arrays und verschachtelten Strukturen und ist damit ein unverzichtbares Werkzeug für Entwickler und Datenanalysten.",
      "$keywords": [
        "json",
        "generieren",
        "generator"
      ]
    },
    "fr": {
      "$name": "Générateur JSON",
      "$description": "Le Générateur JSON est un outil en ligne qui permet aux utilisateurs de générer facilement du code JSON en spécifiant la structure de données et les valeurs souhaitées. Il simplifie le processus de création d'objets JSON, de tableaux et de structures imbriquées, en faisant un outil essentiel pour les développeurs et les analystes de données.",
      "$keywords": [
        "json",
        "générer",
        "générateur"
      ]
    },
    "it": {
      "$name": "Generatore JSON",
      "$description": "Il Generatore JSON è uno strumento basato sul web che consente agli utenti di generare facilmente codice JSON specificando la struttura dei dati desiderati e i valori. Semplifica il processo di creazione di oggetti JSON, array e strutture nidificate, rendendolo uno strumento essenziale per sviluppatori e analisti di dati.",
      "$keywords": [
        "json",
        "generare",
        "generatore"
      ]
    },
    "ru": {
      "$name": "Генератор JSON",
      "$description": "Генератор JSON - это веб-инструмент, который позволяет пользователям легко генерировать код JSON, указывая желаемую структуру данных и значения. Он упрощает процесс создания объектов JSON, массивов и вложенных структур, что делает его необходимым инструментом для разработчиков и аналитиков данных.",
      "$keywords": [
        "json",
        "генерировать",
        "генератор"
      ]
    },
    "pt": {
      "$name": "Gerador de JSON",
      "$description": "O Gerador de JSON é uma ferramenta baseada na web que permite aos usuários gerar facilmente código JSON especificando a estrutura de dados e os valores desejados. Ele simplifica o processo de criação de objetos JSON, matrizes e estruturas aninhadas, tornando-se uma ferramenta essencial para desenvolvedores e analistas de dados.",
      "$keywords": [
        "json",
        "gerar",
        "gerador"
      ]
    },
    "en": {
      "$name": "JSON Generator",
      "$description": "JSON Generator is a web-based tool that allows users to easily generate JSON code by specifying the desired data structure and values. It simplifies the process of creating JSON objects, arrays, and nested structures, making it an essential tool for developers and data analysts.",
      "$keywords": [
        "json",
        "generate",
        "generator"
      ]
    },
    "id": "json-to-generator"
  },
  {
    "zh-cn": {
      "$name": "JSON转YAML",
      "$description": "JSON转YAML是一款工具，允许用户轻松将JSON数据转换为YAML格式。这种转换使用户能够以更可读和有组织的方式操作和分析数据，使其更易于处理和理解。",
      "$keywords": [
        "转换",
        "JSON",
        "YAML",
        "转换",
        "YML"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 YAML",
      "$description": "JSON 轉 YAML 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 YAML 格式。這種轉換使使用者能夠以更易讀且有組織的方式操作和分析資料，使其更容易處理和理解。",
      "$keywords": [
        "轉換",
        "JSON",
        "YAML",
        "轉換",
        "YML"
      ]
    },
    "es": {
      "$name": "JSON a YAML",
      "$description": "JSON a YAML es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato YAML. Esta transformación permite a los usuarios manipular y analizar datos de una manera más legible y organizada, lo que facilita el trabajo y la comprensión.",
      "$keywords": [
        "convertir",
        "JSON",
        "YAML",
        "transformar",
        "YML"
      ]
    },
    "ja": {
      "$name": "JSONからYAMLへの変換ツール",
      "$description": "JSONからYAMLへの変換ツールは、ユーザーがJSONデータを簡単にYAML形式に変換できるようにするツールです。この変換により、データをより読みやすく整理された方法で操作および分析できるため、作業および理解が容易になります。",
      "$keywords": [
        "変換",
        "JSON",
        "YAML",
        "変換する",
        "YML"
      ]
    },
    "ko": {
      "$name": "JSON to YAML",
      "$description": "JSON to YAML은 사용자가 JSON 데이터를 YAML 형식으로 쉽게 변환할 수 있는 도구입니다. 이 변환은 데이터를 더 가독성 있고 조직적인 방식으로 조작하고 분석할 수 있도록 하여 작업 및 이해를 더 쉽게 만듭니다.",
      "$keywords": [
        "변환",
        "JSON",
        "YAML",
        "변형",
        "YML"
      ]
    },
    "de": {
      "$name": "JSON zu YAML",
      "$description": "JSON zu YAML ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das YAML-Format zu konvertieren. Diese Transformation ermöglicht es Benutzern, Daten auf eine lesbarere und organisierte Weise zu manipulieren und zu analysieren, was die Arbeit mit und das Verständnis von Daten erleichtert.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "YAML",
        "transformieren",
        "YML"
      ]
    },
    "fr": {
      "$name": "JSON vers YAML",
      "$description": "JSON vers YAML est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format YAML. Cette transformation permet aux utilisateurs de manipuler et d'analyser les données de manière plus lisible et organisée, ce qui facilite le travail et la compréhension.",
      "$keywords": [
        "convertir",
        "JSON",
        "YAML",
        "transformer",
        "YML"
      ]
    },
    "it": {
      "$name": "JSON to YAML",
      "$description": "JSON to YAML è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato YAML. Questa trasformazione consente agli utenti di manipolare e analizzare i dati in modo più leggibile e organizzato, rendendolo più facile da lavorare e capire.",
      "$keywords": [
        "convertire",
        "JSON",
        "YAML",
        "trasformare",
        "YML"
      ]
    },
    "ru": {
      "$name": "JSON в YAML",
      "$description": "JSON в YAML - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат YAML. Это преобразование позволяет пользователям манипулировать и анализировать данные более читаемым и организованным способом, что упрощает работу и понимание.",
      "$keywords": [
        "преобразование",
        "JSON",
        "YAML",
        "трансформация",
        "YML"
      ]
    },
    "pt": {
      "$name": "JSON para YAML",
      "$description": "JSON para YAML é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato YAML. Essa transformação permite que os usuários manipulem e analisem dados de maneira mais legível e organizada, tornando mais fácil trabalhar e entender.",
      "$keywords": [
        "converter",
        "JSON",
        "YAML",
        "transformar",
        "YML"
      ]
    },
    "en": {
      "$name": "JSON to YAML",
      "$description": "JSON to YAML is a tool that allows users to easily convert JSON data into YAML format. This transformation enables users to manipulate and analyze data in a more readable and organized way, making it easier to work with and understand.",
      "$keywords": [
        "convert",
        "JSON",
        "YAML",
        "transform",
        "YML"
      ]
    },
    "id": "json-to-yaml"
  },
  {
    "zh-cn": {
      "$name": "JSON转CSV",
      "$description": "JSON转CSV是一款工具，允许用户轻松将JSON数据转换为CSV格式。使用此工具，用户可以将其JSON数据转换为更易于阅读和组织的格式，以进行分析或共享。",
      "$keywords": [
        "转换",
        "JSON",
        "CSV",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 CSV",
      "$description": "JSON 轉 CSV 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換成 CSV 格式。使用此工具，使用者可以將其 JSON 資料轉換為更易讀且有組織的格式，以進行分析或分享。",
      "$keywords": [
        "轉換",
        "JSON",
        "CSV",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a CSV",
      "$description": "JSON a CSV es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato CSV. Con esta herramienta, los usuarios pueden transformar sus datos JSON en un formato más legible y organizado para su análisis o compartición.",
      "$keywords": [
        "convertir",
        "JSON",
        "CSV",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからCSVへの変換ツール",
      "$description": "JSONからCSVへの変換ツールは、ユーザーがJSONデータを簡単にCSV形式に変換できるようにするツールです。このツールを使用すると、ユーザーはJSONデータをより読みやすく整理された形式に変換して分析や共有ができます。",
      "$keywords": [
        "変換",
        "JSON",
        "CSV",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to CSV",
      "$description": "JSON to CSV는 사용자가 JSON 데이터를 쉽게 CSV 형식으로 변환할 수 있는 도구입니다. 이 도구를 사용하면 사용자는 JSON 데이터를 분석이나 공유를 위해 더 읽기 쉽고 조직화된 형식으로 변환할 수 있습니다.",
      "$keywords": [
        "변환",
        "JSON",
        "CSV",
        "변형"
      ]
    },
    "de": {
      "$name": "JSON zu CSV",
      "$description": "JSON zu CSV ist ein Tool, mit dem Benutzer JSON-Daten einfach in das CSV-Format konvertieren können. Mit diesem Tool können Benutzer ihre JSON-Daten in ein lesbareres und organisierteres Format für Analyse oder Freigabe umwandeln.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "CSV",
        "umwandeln"
      ]
    },
    "fr": {
      "$name": "JSON vers CSV",
      "$description": "JSON vers CSV est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format CSV. Avec cet outil, les utilisateurs peuvent transformer leurs données JSON en un format plus lisible et organisé pour l'analyse ou le partage.",
      "$keywords": [
        "convertir",
        "JSON",
        "CSV",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to CSV",
      "$description": "JSON to CSV è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato CSV. Con questo strumento, gli utenti possono trasformare i loro dati JSON in un formato più leggibile e organizzato per l'analisi o la condivisione.",
      "$keywords": [
        "convertire",
        "JSON",
        "CSV",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в CSV",
      "$description": "JSON в CSV - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат CSV. С помощью этого инструмента пользователи могут преобразовать свои данные JSON в более читаемый и организованный формат для анализа или обмена.",
      "$keywords": [
        "преобразование",
        "JSON",
        "CSV",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para CSV",
      "$description": "JSON para CSV é uma ferramenta que permite aos usuários converter facilmente dados JSON para o formato CSV. Com esta ferramenta, os usuários podem transformar seus dados JSON em um formato mais legível e organizado para análise ou compartilhamento.",
      "$keywords": [
        "converter",
        "JSON",
        "CSV",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to CSV",
      "$description": "JSON to CSV is a tool that allows users to easily convert JSON data into CSV format. With this tool, users can transform their JSON data into a more readable and organized format for analysis or sharing.",
      "$keywords": [
        "convert",
        "JSON",
        "CSV",
        "transform"
      ]
    },
    "id": "json-to-csv"
  },
  {
    "zh-cn": {
      "$name": "JSON压缩器",
      "$description": "JSON压缩器是一款工具，可通过删除不必要的空格、换行符和注释来减小JSON代码的大小。它使用缩小、压缩和丑化技术使代码更加紧凑和高效。",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "zh-tw": {
      "$name": "JSON壓縮器",
      "$description": "JSON壓縮器是一個工具，可以通過刪除不必要的空格、換行符和註釋來減小JSON代碼的大小。它使用縮小、壓縮和醜化技術，使代碼更加緊湊和高效。",
      "$keywords": [
        "json",
        "縮小",
        "壓縮",
        "醜化"
      ]
    },
    "es": {
      "$name": "Compresor JSON",
      "$description": "El Compresor JSON es una herramienta que ayuda a reducir el tamaño del código JSON eliminando espacios en blanco innecesarios, saltos de línea y comentarios. Utiliza técnicas de minificación, compresión y fealdad para hacer que el código sea más compacto y eficiente.",
      "$keywords": [
        "json",
        "minificar",
        "comprimir",
        "fealdad"
      ]
    },
    "ja": {
      "$name": "JSONコンプレッサー",
      "$description": "JSONコンプレッサーは、不必要な空白、改行、コメントを削除してJSONコードのサイズを縮小するためのツールです。最小化、圧縮、難読化技術を使用して、コードをよりコンパクトで効率的にします。",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "ko": {
      "$name": "JSON 압축기",
      "$description": "JSON 압축기는 불필요한 공백, 줄 바꿈 및 주석을 제거하여 JSON 코드의 크기를 줄이는 데 도움이 되는 도구입니다. 코드를 더 간결하고 효율적으로 만들기 위해 최소화, 압축 및 난독화 기술을 사용합니다.",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "de": {
      "$name": "JSON-Kompressor",
      "$description": "JSON-Kompressor ist ein Tool, das hilft, die Größe von JSON-Code zu reduzieren, indem unnötige Leerzeichen, Zeilenumbrüche und Kommentare entfernt werden. Es verwendet Minifizierung, Komprimierung und Verunstaltungstechniken, um den Code kompakter und effizienter zu machen.",
      "$keywords": [
        "json",
        "minifizieren",
        "komprimieren",
        "verunstalten"
      ]
    },
    "fr": {
      "$name": "Compresseur JSON",
      "$description": "Le Compresseur JSON est un outil qui aide à réduire la taille du code JSON en supprimant les espaces blancs, les sauts de ligne et les commentaires inutiles. Il utilise des techniques de minification, de compression et d'obfuscation pour rendre le code plus compact et efficace.",
      "$keywords": [
        "json",
        "minifier",
        "compresser",
        "obfusquer"
      ]
    },
    "it": {
      "$name": "Compressore JSON",
      "$description": "Il Compressore JSON è uno strumento che aiuta a ridurre le dimensioni del codice JSON rimuovendo spazi vuoti, interruzioni di linea e commenti superflui. Utilizza tecniche di minificazione, compressione e uglification per rendere il codice più compatto ed efficiente.",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "ru": {
      "$name": "JSON Компрессор",
      "$description": "JSON Компрессор - это инструмент, который помогает уменьшить размер кода JSON, удаляя ненужные пробелы, переносы строк и комментарии. Он использует техники минификации, сжатия и угловатости, чтобы сделать код более компактным и эффективным.",
      "$keywords": [
        "json",
        "минификация",
        "сжатие",
        "угловатость"
      ]
    },
    "pt": {
      "$name": "Compressor JSON",
      "$description": "O Compressor JSON é uma ferramenta que ajuda a reduzir o tamanho do código JSON removendo espaços em branco, quebras de linha e comentários desnecessários. Ele usa técnicas de minificação, compressão e uglificação para tornar o código mais compacto e eficiente.",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "en": {
      "$name": "JSON Compressor",
      "$description": "JSON Compressor is a tool that helps to reduce the size of JSON code by removing unnecessary white spaces, line breaks, and comments. It uses minification, compression, and uglification techniques to make the code more compact and efficient.",
      "$keywords": [
        "json",
        "minify",
        "compress",
        "uglify"
      ]
    },
    "id": "json-to-minify"
  },
  {
    "zh-cn": {
      "$name": "JSON转PHP",
      "$description": "JSON转PHP是一款工具，允许用户轻松将JSON数据转换为PHP代码。这种转换使开发人员能够无缝地将JSON数据集成到他们的PHP应用程序中。",
      "$keywords": [
        "转换",
        "JSON",
        "PHP",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON 轉 PHP",
      "$description": "JSON 轉 PHP 是一個工具，讓使用者可以輕鬆地將 JSON 資料轉換為 PHP 程式碼。這個轉換讓開發人員可以無縫地將 JSON 資料整合到他們的 PHP 應用程式中。",
      "$keywords": [
        "轉換",
        "JSON",
        "PHP",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a PHP",
      "$description": "JSON a PHP es una herramienta que permite a los usuarios convertir fácilmente datos JSON en código PHP. Esta transformación permite a los desarrolladores integrar sin problemas datos JSON en sus aplicaciones PHP.",
      "$keywords": [
        "convertir",
        "JSON",
        "PHP",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからPHPへ",
      "$description": "JSONからPHPへは、ユーザーがJSONデータを簡単にPHPコードに変換できるツールです。この変換により、開発者はJSONデータをPHPアプリケーションにシームレスに統合できます。",
      "$keywords": [
        "変換",
        "JSON",
        "PHP",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to PHP",
      "$description": "JSON to PHP는 사용자가 JSON 데이터를 쉽게 PHP 코드로 변환할 수 있는 도구입니다. 이 변환은 개발자가 JSON 데이터를 PHP 애플리케이션에 매끄럽게 통합할 수 있도록 합니다.",
      "$keywords": [
        "변환",
        "JSON",
        "PHP",
        "트랜스폼"
      ]
    },
    "de": {
      "$name": "JSON zu PHP",
      "$description": "JSON zu PHP ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in PHP-Code umzuwandeln. Diese Transformation ermöglicht es Entwicklern, JSON-Daten nahtlos in ihre PHP-Anwendungen zu integrieren.",
      "$keywords": [
        "umwandeln",
        "JSON",
        "PHP",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers PHP",
      "$description": "JSON vers PHP est un outil qui permet aux utilisateurs de convertir facilement des données JSON en code PHP. Cette transformation permet aux développeurs d'intégrer sans effort des données JSON dans leurs applications PHP.",
      "$keywords": [
        "convertir",
        "JSON",
        "PHP",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to PHP",
      "$description": "JSON to PHP è uno strumento che consente agli utenti di convertire facilmente i dati JSON in codice PHP. Questa trasformazione consente agli sviluppatori di integrare senza soluzione di continuità i dati JSON nelle loro applicazioni PHP.",
      "$keywords": [
        "convertire",
        "JSON",
        "PHP",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в PHP",
      "$description": "JSON в PHP - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в код PHP. Это преобразование позволяет разработчикам без проблем интегрировать данные JSON в свои приложения на PHP.",
      "$keywords": [
        "преобразование",
        "JSON",
        "PHP",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para PHP",
      "$description": "JSON para PHP é uma ferramenta que permite aos usuários converter facilmente dados JSON em código PHP. Essa transformação permite que os desenvolvedores integrem perfeitamente dados JSON em suas aplicações PHP.",
      "$keywords": [
        "converter",
        "JSON",
        "PHP",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to PHP",
      "$description": "JSON to PHP is a tool that allows users to easily convert JSON data into PHP code. This transformation enables developers to seamlessly integrate JSON data into their PHP applications.",
      "$keywords": [
        "convert",
        "JSON",
        "PHP",
        "transform"
      ]
    },
    "id": "json-to-php"
  },
  {
    "zh-cn": {
      "$name": "JSON转SQL模式",
      "$description": "JSON转SQL模式是一款工具，允许用户轻松将JSON数据转换为SQL模式格式。使用此工具，用户可以将其JSON数据转换为结构化的SQL数据库，从而更轻松地管理和分析其数据。",
      "$keywords": [
        "转换",
        "JSON",
        "SQL模式",
        "转换"
      ]
    },
    "zh-tw": {
      "$name": "JSON轉SQL架構",
      "$description": "JSON轉SQL架構是一個工具，允許用戶輕鬆將JSON數據轉換為SQL架構格式。使用此工具，用戶可以將其JSON數據轉換為結構化的SQL數據庫，從而更輕鬆地管理和分析其數據。",
      "$keywords": [
        "轉換",
        "JSON",
        "SQL架構",
        "轉換"
      ]
    },
    "es": {
      "$name": "JSON a Esquema SQL",
      "$description": "JSON a Esquema SQL es una herramienta que permite a los usuarios convertir fácilmente datos JSON en formato de esquema SQL. Con esta herramienta, los usuarios pueden transformar sus datos JSON en una base de datos SQL estructurada, lo que facilita la gestión y el análisis de sus datos.",
      "$keywords": [
        "convertir",
        "JSON",
        "Esquema SQL",
        "transformar"
      ]
    },
    "ja": {
      "$name": "JSONからSQLスキーマへの変換ツール",
      "$description": "JSON to SQL Schemaは、ユーザーがJSONデータを簡単にSQLスキーマ形式に変換できるツールです。このツールを使用すると、ユーザーはJSONデータを構造化されたSQLデータベースに変換して、データを管理および分析しやすくすることができます。",
      "$keywords": [
        "変換",
        "JSON",
        "SQLスキーマ",
        "変換する"
      ]
    },
    "ko": {
      "$name": "JSON to SQL 스키마",
      "$description": "JSON to SQL 스키마는 사용자가 JSON 데이터를 쉽게 SQL 스키마 형식으로 변환할 수 있는 도구입니다. 이 도구를 사용하면 사용자는 JSON 데이터를 구조화된 SQL 데이터베이스로 변환하여 데이터를 관리하고 분석하기 쉬워집니다.",
      "$keywords": [
        "변환",
        "JSON",
        "SQL 스키마",
        "구조화"
      ]
    },
    "de": {
      "$name": "JSON zu SQL Schema",
      "$description": "JSON to SQL Schema ist ein Tool, das es Benutzern ermöglicht, JSON-Daten einfach in das SQL-Schema-Format zu konvertieren. Mit diesem Tool können Benutzer ihre JSON-Daten in eine strukturierte SQL-Datenbank transformieren, um ihre Daten einfacher zu verwalten und zu analysieren.",
      "$keywords": [
        "konvertieren",
        "JSON",
        "SQL-Schema",
        "transformieren"
      ]
    },
    "fr": {
      "$name": "JSON vers Schéma SQL",
      "$description": "JSON vers Schéma SQL est un outil qui permet aux utilisateurs de convertir facilement des données JSON en format de schéma SQL. Avec cet outil, les utilisateurs peuvent transformer leurs données JSON en une base de données SQL structurée, ce qui facilite la gestion et l'analyse de leurs données.",
      "$keywords": [
        "convertir",
        "JSON",
        "Schéma SQL",
        "transformer"
      ]
    },
    "it": {
      "$name": "JSON to SQL Schema",
      "$description": "JSON to SQL Schema è uno strumento che consente agli utenti di convertire facilmente i dati JSON nel formato dello schema SQL. Con questo strumento, gli utenti possono trasformare i loro dati JSON in un database SQL strutturato, rendendo più facile gestire e analizzare i loro dati.",
      "$keywords": [
        "convertire",
        "JSON",
        "schema SQL",
        "trasformare"
      ]
    },
    "ru": {
      "$name": "JSON в SQL схему",
      "$description": "JSON в SQL Schema - это инструмент, который позволяет пользователям легко преобразовывать данные JSON в формат схемы SQL. С помощью этого инструмента пользователи могут преобразовать свои данные JSON в структурированную базу данных SQL, что упрощает управление и анализ данных.",
      "$keywords": [
        "преобразование",
        "JSON",
        "SQL схема",
        "трансформация"
      ]
    },
    "pt": {
      "$name": "JSON para Esquema SQL",
      "$description": "JSON para Esquema SQL é uma ferramenta que permite aos usuários converter facilmente dados JSON em formato de esquema SQL. Com esta ferramenta, os usuários podem transformar seus dados JSON em um banco de dados SQL estruturado, tornando mais fácil gerenciar e analisar seus dados.",
      "$keywords": [
        "converter",
        "JSON",
        "Esquema SQL",
        "transformar"
      ]
    },
    "en": {
      "$name": "JSON to SQL Schema",
      "$description": "JSON to SQL Schema is a tool that allows users to easily convert JSON data into SQL schema format. With this tool, users can transform their JSON data into a structured SQL database, making it easier to manage and analyze their data.",
      "$keywords": [
        "convert",
        "JSON",
        "SQL Schema",
        "transform"
      ]
    },
    "id": "json-to-sql-schema"
  }
]