{
  "zh-cn": {
    "$name": "Hosts 编辑器",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "record",
      "localhost",
      "127",
      "192",
      "168",
      "domain",
      "ip",
      "Hosts文件编辑器",
      "网络连接管理",
      "自动保存",
      "网络管理",
      "网络安全",
      "网络开发",
      "DNS记录",
      "本地主机",
      "IP地址",
      "域名"
    ],
    "$description": "工具名称：Hosts编辑器\n\n功能描述：\n\nHosts编辑器是一款用于编辑系统hosts文件的工具。它允许用户轻松编辑和保存hosts文件，以便更好地管理网络连接。\n\n1. 编辑hosts文件：用户可以使用Hosts编辑器编辑系统hosts文件，以便更好地管理网络连接。\n\n2. 保存hosts文件：用户可以使用Hosts编辑器保存编辑后的hosts文件，以便更好地管理网络连接。\n\n3. 自动保存：Hosts编辑器支持自动保存hosts文件，使用户无需手动保存。\n\n使用场景：\n\n1. 网络管理：在网络管理中，管理员经常需要编辑和保存hosts文件。使用Hosts编辑器可以使管理员更轻松地管理网络连接。\n\n2. 网络安全：在网络安全中，安全人员经常需要编辑和保存hosts文件。使用Hosts编辑器可以使安全人员更轻松地管理网络连接。\n\n3. 网络开发：在网络开发中，开发人员经常需要编辑和保存hosts文件。使用Hosts编辑器可以使开发人员更轻松地管理网络连接。"
  },
  "zh-tw": {
    "$name": "Hosts 編輯器",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "record",
      "localhost",
      "127",
      "192",
      "168",
      "domain",
      "ip",
      "Hosts file editor",
      "Network connection management",
      "Auto-save",
      "Network management",
      "Network security",
      "Network development",
      "DNS records",
      "Local host",
      "IP address",
      "Domain name"
    ],
    "$description": "工具名稱：Hosts Editor\n\n功能描述：\n\nHosts Editor 是一個用於編輯系統 hosts 檔案的工具。它允許用戶輕鬆編輯和保存 hosts 檔案，以實現更好的網絡連接管理。\n\n1. 編輯 hosts 檔案：用戶可以使用 Hosts Editor 編輯系統 hosts 檔案，以實現更好的網絡連接管理。\n\n2. 保存 hosts 檔案：用戶可以使用 Hosts Editor 保存編輯後的 hosts 檔案，以實現更好的網絡連接管理。\n\n3. 自動保存：Hosts Editor 支持 hosts 檔案的自動保存，使用戶不必手動保存。\n\n使用場景：\n\n1. 網絡管理：在網絡管理中，管理員經常需要編輯和保存 hosts 檔案。使用 Hosts Editor 可以使管理員更輕鬆地管理網絡連接。\n\n2. 網絡安全：在網絡安全中，安全人員經常需要編輯和保存 hosts 檔案。使用 Hosts Editor 可以使安全人員更輕鬆地管理網絡連接。\n\n3. 網絡開發：在網絡開發中，開發人員經常需要編輯和保存 hosts 檔案。使用 Hosts Editor 可以使開發人員更輕鬆地管理網絡連接。"
  },
  "es": {
    "$name": "Editor de Hosts",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "registro",
      "localhost",
      "127",
      "192",
      "168",
      "dominio",
      "ip",
      "Editor de archivo Hosts",
      "Gestión de conexión de red",
      "Auto-guardado",
      "Gestión de red",
      "Seguridad de red",
      "Desarrollo de red",
      "Registros DNS",
      "Anfitrión local",
      "Dirección IP",
      "Nombre de dominio"
    ],
    "$description": "Nombre de la herramienta: Editor de hosts\n\nDescripción de la función:\n\nEl Editor de hosts es una herramienta utilizada para editar el archivo de hosts del sistema. Permite a los usuarios editar y guardar fácilmente el archivo de hosts para una mejor gestión de la conexión de red.\n\n1. Editar archivo de hosts: Los usuarios pueden utilizar el Editor de hosts para editar el archivo de hosts del sistema para una mejor gestión de la conexión de red.\n\n2. Guardar archivo de hosts: Los usuarios pueden utilizar el Editor de hosts para guardar el archivo de hosts editado para una mejor gestión de la conexión de red.\n\n3. Auto-guardado: El Editor de hosts admite el auto-guardado del archivo de hosts para que los usuarios no tengan que guardarlo manualmente.\n\nEscenarios de uso:\n\n1. Gestión de red: En la gestión de red, los administradores a menudo necesitan editar y guardar el archivo de hosts. El uso del Editor de hosts puede hacer que sea más fácil para los administradores gestionar las conexiones de red.\n\n2. Seguridad de red: En la seguridad de red, el personal de seguridad a menudo necesita editar y guardar el archivo de hosts. El uso del Editor de hosts puede hacer que sea más fácil para el personal de seguridad gestionar las conexiones de red.\n\n3. Desarrollo de red: En el desarrollo de red, los desarrolladores a menudo necesitan editar y guardar el archivo de hosts. El uso del Editor de hosts puede hacer que sea más fácil para los desarrolladores gestionar las conexiones de red."
  },
  "ja": {
    "$name": "ホストエディター",
    "$keywords": [
      "ホスト",
      "エディター",
      "/etc/hosts",
      "DNS",
      "レコード",
      "localhost",
      "127",
      "192",
      "168",
      "ドメイン",
      "IP",
      "ホストファイルエディター",
      "ネットワーク接続管理",
      "自動保存",
      "ネットワーク管理",
      "ネットワークセキュリティ",
      "ネットワーク開発",
      "DNSレコード",
      "ローカルホスト",
      "IPアドレス",
      "ドメイン名"
    ],
    "$description": "ツール名：ホストエディター\n\n機能説明：\n\nホストエディターは、システムのホストファイルを編集するためのツールです。ユーザーは、ホストファイルを簡単に編集して保存し、ネットワーク接続の管理を改善することができます。\n\n1. ホストファイルの編集：ユーザーは、ホストエディターを使用してシステムのホストファイルを編集し、ネットワーク接続の管理を改善することができます。\n\n2. ホストファイルの保存：ユーザーは、ホストエディターを使用して編集したホストファイルを保存し、ネットワーク接続の管理を改善することができます。\n\n3. 自動保存：ホストエディターは、ユーザーが手動で保存する必要がないように、ホストファイルの自動保存をサポートしています。\n\n使用シナリオ：\n\n1. ネットワーク管理：ネットワーク管理では、管理者がしばしばホストファイルを編集して保存する必要があります。ホストエディターを使用することで、管理者はネットワーク接続を管理しやすくすることができます。\n\n2. ネットワークセキュリティ：ネットワークセキュリティでは、セキュリティ担当者がしばしばホストファイルを編集して保存する必要があります。ホストエディターを使用することで、セキュリティ担当者はネットワーク接続を管理しやすくすることができます。\n\n3. ネットワーク開発：ネットワーク開発では、開発者がしばしばホストファイルを編集して保存する必要があります。ホストエディターを使用することで、開発者はネットワーク接続を管理しやすくすることができます。"
  },
  "ko": {
    "$name": "호스트 편집기",
    "$keywords": [
      "호스트",
      "에디터",
      "/etc/hosts",
      "DNS",
      "레코드",
      "로컬호스트",
      "127",
      "192",
      "168",
      "도메인",
      "IP",
      "호스트 파일 에디터",
      "네트워크 연결 관리",
      "자동 저장",
      "네트워크 관리",
      "네트워크 보안",
      "네트워크 개발",
      "DNS 레코드",
      "로컬 호스트",
      "IP 주소",
      "도메인 이름"
    ],
    "$description": "도구 이름: 호스트 편집기\n\n기능 설명:\n\n호스트 편집기는 시스템 호스트 파일을 편집하는 데 사용되는 도구입니다. 사용자는 호스트 파일을 쉽게 편집하고 저장하여 더 나은 네트워크 연결 관리를 할 수 있습니다.\n\n1. 호스트 파일 편집: 사용자는 호스트 편집기를 사용하여 더 나은 네트워크 연결 관리를 위해 시스템 호스트 파일을 편집할 수 있습니다.\n\n2. 호스트 파일 저장: 사용자는 호스트 편집기를 사용하여 편집한 호스트 파일을 저장할 수 있습니다.\n\n3. 자동 저장: 호스트 편집기는 호스트 파일의 자동 저장을 지원하여 사용자가 수동으로 저장할 필요가 없도록 합니다.\n\n사용 시나리오:\n\n1. 네트워크 관리: 네트워크 관리에서 관리자는 종종 호스트 파일을 편집하고 저장해야 합니다. 호스트 편집기를 사용하면 관리자가 네트워크 연결을 관리하기 쉬워집니다.\n\n2. 네트워크 보안: 네트워크 보안에서 보안 담당자는 종종 호스트 파일을 편집하고 저장해야 합니다. 호스트 편집기를 사용하면 보안 담당자가 네트워크 연결을 관리하기 쉬워집니다.\n\n3. 네트워크 개발: 네트워크 개발에서 개발자는 종종 호스트 파일을 편집하고 저장해야 합니다. 호스트 편집기를 사용하면 개발자가 네트워크 연결을 관리하기 쉬워집니다."
  },
  "de": {
    "$name": "Hosts Editor",
    "$keywords": [
      "Hosts",
      "Editor",
      "/etc/hosts",
      "DNS",
      "Record",
      "Localhost",
      "127",
      "192",
      "168",
      "Domain",
      "IP",
      "Hosts-Datei-Editor",
      "Netzwerkverbindungsverwaltung",
      "Automatisches Speichern",
      "Netzwerkverwaltung",
      "Netzwerksicherheit",
      "Netzwerkentwicklung",
      "DNS-Einträge",
      "Lokaler Host",
      "IP-Adresse",
      "Domain-Name"
    ],
    "$description": "Werkzeugname: Hosts Editor\n\nFunktionsbeschreibung:\n\nHosts Editor ist ein Werkzeug, das verwendet wird, um die System-Hosts-Datei zu bearbeiten. Es ermöglicht Benutzern, die Hosts-Datei für eine bessere Netzwerkverbindung zu bearbeiten und zu speichern.\n\n1. Bearbeiten der Hosts-Datei: Benutzer können Hosts Editor verwenden, um die System-Hosts-Datei für eine bessere Netzwerkverbindung zu bearbeiten.\n\n2. Speichern der Hosts-Datei: Benutzer können Hosts Editor verwenden, um die bearbeitete Hosts-Datei für eine bessere Netzwerkverbindung zu speichern.\n\n3. Automatisches Speichern: Hosts Editor unterstützt das automatische Speichern der Hosts-Datei, damit Benutzer es nicht manuell speichern müssen.\n\nAnwendungsszenarien:\n\n1. Netzwerkmanagement: Im Netzwerkmanagement müssen Administratoren oft die Hosts-Datei bearbeiten und speichern. Die Verwendung von Hosts Editor kann es Administratoren erleichtern, Netzwerkverbindungen zu verwalten.\n\n2. Netzwerksicherheit: In der Netzwerksicherheit müssen Sicherheitspersonal oft die Hosts-Datei bearbeiten und speichern. Die Verwendung von Hosts Editor kann es Sicherheitspersonal erleichtern, Netzwerkverbindungen zu verwalten.\n\n3. Netzwerkentwicklung: In der Netzwerkentwicklung müssen Entwickler oft die Hosts-Datei bearbeiten und speichern. Die Verwendung von Hosts Editor kann es Entwicklern erleichtern, Netzwerkverbindungen zu verwalten."
  },
  "fr": {
    "$name": "Éditeur de fichiers hosts",
    "$keywords": [
      "hôtes",
      "éditeur",
      "/etc/hosts",
      "dns",
      "enregistrement",
      "localhost",
      "127",
      "192",
      "168",
      "domaine",
      "ip",
      "Éditeur de fichier Hosts",
      "Gestion de la connexion réseau",
      "Sauvegarde automatique",
      "Gestion du réseau",
      "Sécurité du réseau",
      "Développement du réseau",
      "Enregistrements DNS",
      "Hôte local",
      "Adresse IP",
      "Nom de domaine"
    ],
    "$description": "Nom de l'outil: Éditeur de fichiers hosts\n\nDescription de la fonction:\n\nÉditeur de fichiers hosts est un outil utilisé pour éditer le fichier hosts du système. Il permet aux utilisateurs d'éditer facilement et de sauvegarder le fichier hosts pour une meilleure gestion de la connexion réseau.\n\n1. Éditer le fichier hosts: Les utilisateurs peuvent utiliser Éditeur de fichiers hosts pour éditer le fichier hosts du système pour une meilleure gestion de la connexion réseau.\n\n2. Sauvegarder le fichier hosts: Les utilisateurs peuvent utiliser Éditeur de fichiers hosts pour sauvegarder le fichier hosts édité pour une meilleure gestion de la connexion réseau.\n\n3. Sauvegarde automatique: Éditeur de fichiers hosts prend en charge la sauvegarde automatique du fichier hosts afin que les utilisateurs n'aient pas à le sauvegarder manuellement.\n\nScénarios d'utilisation:\n\n1. Gestion de réseau: En gestion de réseau, les administrateurs ont souvent besoin d'éditer et de sauvegarder le fichier hosts. L'utilisation d'Éditeur de fichiers hosts peut faciliter la gestion des connexions réseau pour les administrateurs.\n\n2. Sécurité réseau: En sécurité réseau, le personnel de sécurité a souvent besoin d'éditer et de sauvegarder le fichier hosts. L'utilisation d'Éditeur de fichiers hosts peut faciliter la gestion des connexions réseau pour le personnel de sécurité.\n\n3. Développement de réseau: En développement de réseau, les développeurs ont souvent besoin d'éditer et de sauvegarder le fichier hosts. L'utilisation d'Éditeur de fichiers hosts peut faciliter la gestion des connexions réseau pour les développeurs."
  },
  "it": {
    "$name": "Editor di Hosts",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "record",
      "localhost",
      "127",
      "192",
      "168",
      "domain",
      "ip",
      "Editor file hosts",
      "Gestione connessione di rete",
      "Auto-salvataggio",
      "Gestione di rete",
      "Sicurezza di rete",
      "Sviluppo di rete",
      "Record DNS",
      "Host locale",
      "Indirizzo IP",
      "Nome di dominio"
    ],
    "$description": "Nome dello strumento: Editor di Hosts\n\nDescrizione della funzione:\n\nL'Editor di Hosts è uno strumento utilizzato per modificare il file hosts di sistema. Consente agli utenti di modificare e salvare facilmente il file hosts per una migliore gestione della connessione di rete.\n\n1. Modifica del file hosts: gli utenti possono utilizzare l'Editor di Hosts per modificare il file hosts di sistema per una migliore gestione della connessione di rete.\n\n2. Salvataggio del file hosts: gli utenti possono utilizzare l'Editor di Hosts per salvare il file hosts modificato per una migliore gestione della connessione di rete.\n\n3. Salvataggio automatico: l'Editor di Hosts supporta il salvataggio automatico del file hosts in modo che gli utenti non debbano salvarlo manualmente.\n\nScenari di utilizzo:\n\n1. Gestione di rete: nella gestione di rete, gli amministratori spesso devono modificare e salvare il file hosts. Utilizzando l'Editor di Hosts, gli amministratori possono gestire le connessioni di rete in modo più semplice.\n\n2. Sicurezza di rete: nella sicurezza di rete, il personale di sicurezza spesso deve modificare e salvare il file hosts. Utilizzando l'Editor di Hosts, il personale di sicurezza può gestire le connessioni di rete in modo più semplice.\n\n3. Sviluppo di rete: nello sviluppo di rete, gli sviluppatori spesso devono modificare e salvare il file hosts. Utilizzando l'Editor di Hosts, gli sviluppatori possono gestire le connessioni di rete in modo più semplice."
  },
  "ru": {
    "$name": "Редактор хостов",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "record",
      "localhost",
      "127",
      "192",
      "168",
      "domain",
      "ip",
      "Hosts file editor",
      "Network connection management",
      "Auto-save",
      "Network management",
      "Network security",
      "Network development",
      "DNS records",
      "Local host",
      "IP address",
      "Domain name",
      "хосты",
      "редактор",
      "/etc/hosts",
      "dns",
      "запись",
      "localhost",
      "127",
      "192",
      "168",
      "домен",
      "ip",
      "Редактор файла хостов",
      "Управление сетевым подключением",
      "Автосохранение",
      "Управление сетью",
      "Безопасность сети",
      "Разработка сети",
      "DNS-записи",
      "Локальный хост",
      "IP-адрес",
      "Имя домена"
    ],
    "$description": "Название инструмента: Редактор хостов\n\nОписание функций:\n\nРедактор хостов - это инструмент, используемый для редактирования системного файла хостов. Он позволяет пользователям легко редактировать и сохранять файл хостов для более эффективного управления сетевым подключением.\n\n1. Редактирование файла хостов: Пользователи могут использовать Редактор хостов для редактирования системного файла хостов для более эффективного управления сетевым подключением.\n\n2. Сохранение файла хостов: Пользователи могут использовать Редактор хостов для сохранения отредактированного файла хостов для более эффективного управления сетевым подключением.\n\n3. Автосохранение: Редактор хостов поддерживает автоматическое сохранение файла хостов, чтобы пользователи не должны были сохранять его вручную.\n\nСценарии использования:\n\n1. Управление сетью: При управлении сетью администраторы часто должны редактировать и сохранять файл хостов. Использование Редактора хостов может упростить управление сетевыми подключениями для администраторов.\n\n2. Безопасность сети: При обеспечении безопасности сети сотрудники службы безопасности часто должны редактировать и сохранять файл хостов. Использование Редактора хостов может упростить управление сетевыми подключениями для сотрудников службы безопасности.\n\n3. Разработка сети: При разработке сети разработчики часто должны редактировать и сохранять файл хостов. Использование Редактора хостов может упростить управление сетевыми подключениями для разработчиков."
  },
  "pt": {
    "$name": "Editor de Hosts",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "registro",
      "localhost",
      "127",
      "192",
      "168",
      "domínio",
      "ip",
      "Editor de arquivo Hosts",
      "Gerenciamento de conexão de rede",
      "Auto-salvar",
      "Gerenciamento de rede",
      "Segurança de rede",
      "Desenvolvimento de rede",
      "Registros DNS",
      "Host local",
      "Endereço IP",
      "Nome de domínio"
    ],
    "$description": "Nome da Ferramenta: Editor de Hosts\n\nDescrição da Função:\n\nO Editor de Hosts é uma ferramenta usada para editar o arquivo de hosts do sistema. Ele permite que os usuários editem e salvem facilmente o arquivo de hosts para melhor gerenciamento da conexão de rede.\n\n1. Editar arquivo de hosts: Os usuários podem usar o Editor de Hosts para editar o arquivo de hosts do sistema para melhor gerenciamento da conexão de rede.\n\n2. Salvar arquivo de hosts: Os usuários podem usar o Editor de Hosts para salvar o arquivo de hosts editado para melhor gerenciamento da conexão de rede.\n\n3. Auto-salvar: O Editor de Hosts suporta o auto-salvamento do arquivo de hosts para que os usuários não precisem salvá-lo manualmente.\n\nCenários de Uso:\n\n1. Gerenciamento de rede: No gerenciamento de rede, os administradores frequentemente precisam editar e salvar o arquivo de hosts. Usando o Editor de Hosts, pode ser mais fácil para os administradores gerenciarem as conexões de rede.\n\n2. Segurança de rede: Na segurança de rede, o pessoal de segurança frequentemente precisa editar e salvar o arquivo de hosts. Usando o Editor de Hosts, pode ser mais fácil para o pessoal de segurança gerenciar as conexões de rede.\n\n3. Desenvolvimento de rede: No desenvolvimento de rede, os desenvolvedores frequentemente precisam editar e salvar o arquivo de hosts. Usando o Editor de Hosts, pode ser mais fácil para os desenvolvedores gerenciarem as conexões de rede."
  },
  "en": {
    "$name": "Hosts Editor",
    "$keywords": [
      "hosts",
      "editor",
      "/etc/hosts",
      "dns",
      "record",
      "localhost",
      "127",
      "192",
      "168",
      "domain",
      "ip",
      "Hosts file editor",
      "Network connection management",
      "Auto-save",
      "Network management",
      "Network security",
      "Network development",
      "DNS records",
      "Local host",
      "IP address",
      "Domain name"
    ],
    "$description": "Tool Name: Hosts Editor\n\nFunction Description:\n\nHosts Editor is a tool used to edit the system hosts file. It allows users to easily edit and save the hosts file for better network connection management.\n\n1. Edit hosts file: Users can use Hosts Editor to edit the system hosts file for better network connection management.\n\n2. Save hosts file: Users can use Hosts Editor to save the edited hosts file for better network connection management.\n\n3. Auto-save: Hosts Editor supports auto-saving of the hosts file so that users do not have to manually save it.\n\nUsage Scenarios:\n\n1. Network management: In network management, administrators often need to edit and save the hosts file. Using Hosts Editor can make it easier for administrators to manage network connections.\n\n2. Network security: In network security, security personnel often need to edit and save the hosts file. Using Hosts Editor can make it easier for security personnel to manage network connections.\n\n3. Network development: In network development, developers often need to edit and save the hosts file. Using Hosts Editor can make it easier for developers to manage network connections."
  }
}