{
  "zh-cn": {
    "$name": "图片转图标",
    "$keywords": [
      "图标",
      "生成",
      "缩放",
      "调整大小",
      "图片",
      "照片",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "图像转换为图标工具是一种将图像转换为图标的工具。用户可以选择不同的设备类型和图标大小，将图像转换为相应的图标，并将所有图标作为一个包下载。\n\n特点：\n\n1. 用户可以将图像上传到工具中。\n\n2. 该工具支持 iPhone、iPad、macOS、watchOS 和 Android 等不同设备类型和图标大小。\n\n3. 用户可以选择他们想要转换的设备类型和图标大小。\n\n4. 用户可以为生成的图标命名。\n\n5. 该工具将所有生成的图标打包成一个 zip 文件，并提供下载链接。\n\n用例：\n\n1. 移动应用程序开发：在移动应用程序开发过程中，开发人员需要为不同的设备类型生成不同大小的图标。使用图像转换为图标工具可以快速生成所有所需的图标。\n\n2. 设计师：设计师需要为不同的设备类型生成不同大小的图标。使用图像转换为图标工具可以快速生成所有所需的图标并为它们命名。\n\n3. 图标创建：在创建图标时，使用图像转换为图标工具可以快速生成所有所需的图标并将它们作为一个包下载。"
  },
  "zh-tw": {
    "$name": "圖像轉換成圖示",
    "$keywords": [
      "圖示",
      "生成",
      "縮放",
      "調整大小",
      "圖像",
      "圖片",
      "照片",
      "PNG",
      "JPG",
      "JPEG",
      "WebP",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "圖像轉換成圖示工具是一種工具，用於將圖像轉換為圖示。用戶可以選擇不同的設備類型和圖示大小，將圖像轉換為相應的圖示，並下載所有圖示作為一個包。\n\n特點：\n\n1. 用戶可以將圖像上傳到工具中。\n\n2. 該工具支持 iPhone、iPad、macOS、watchOS 和 Android 的不同設備類型和圖示大小。\n\n3. 用戶可以選擇他們想要轉換的設備類型和圖示大小。\n\n4. 用戶可以為生成的圖示命名。\n\n5. 該工具將所有生成的圖示打包成壓縮文件並提供下載鏈接。\n\n用例：\n\n1. 移動應用程序開發：在移動應用程序開發過程中，開發人員需要為不同的設備類型生成不同大小的圖示。使用圖像轉換成圖示工具可以快速生成所有所需的圖示。\n\n2. 設計師：設計師需要為不同的設備類型生成不同大小的圖示。使用圖像轉換成圖示工具可以快速生成所有所需的圖示並為它們命名。\n\n3. 圖示創建：在創建圖示時，使用圖像轉換成圖示工具可以快速生成所有所需的圖示並下載它們作為一個包。"
  },
  "es": {
    "$name": "Imagen a Icono",
    "$keywords": [
      "icon",
      "generar",
      "escalar",
      "redimensionar",
      "imagen",
      "foto",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "La herramienta \"Image to Icon\" es una herramienta utilizada para convertir imágenes en iconos. Los usuarios pueden seleccionar diferentes tipos de dispositivos y tamaños de iconos para convertir imágenes en iconos correspondientes, y descargar todos los iconos como un paquete.\n\nCaracterísticas:\n\n1. Los usuarios pueden cargar imágenes en la herramienta.\n\n2. La herramienta admite diferentes tipos de dispositivos y tamaños de iconos para iPhone, iPad, macOS, watchOS y Android.\n\n3. Los usuarios pueden seleccionar el tipo de dispositivo y el tamaño de icono que desean convertir.\n\n4. Los usuarios pueden nombrar los iconos generados.\n\n5. La herramienta empaqueta todos los iconos generados en un archivo zip y proporciona un enlace de descarga.\n\nCasos de uso:\n\n1. Desarrollo de aplicaciones móviles: En el proceso de desarrollo de aplicaciones móviles, los desarrolladores necesitan generar iconos de diferentes tamaños para diferentes tipos de dispositivos. Usando la herramienta \"Image to Icon\" se pueden generar rápidamente todos los iconos requeridos.\n\n2. Diseñadores: Los diseñadores necesitan generar iconos de diferentes tamaños para diferentes tipos de dispositivos. Usando la herramienta \"Image to Icon\" se pueden generar rápidamente todos los iconos requeridos y nombrarlos.\n\n3. Creación de iconos: Al crear iconos, usando la herramienta \"Image to Icon\" se pueden generar rápidamente todos los iconos requeridos y descargarlos como un paquete."
  },
  "ja": {
    "$name": "Image to Icon",
    "$keywords": [
      "アイコン",
      "生成",
      "スケール",
      "リサイズ",
      "画像",
      "写真",
      "写真",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "画像をアイコンに変換するためのツールである「Image to Icon」は、異なるデバイスタイプやアイコンサイズを選択して、画像を対応するアイコンに変換し、すべてのアイコンをパッケージとしてダウンロードすることができます。\n\n特徴：\n\n1. ユーザーはツールに画像をアップロードできます。\n\n2. ツールは、iPhone、iPad、macOS、watchOS、Androidなどの異なるデバイスタイプやアイコンサイズをサポートしています。\n\n3. ユーザーは、変換したいデバイスタイプやアイコンサイズを選択できます。\n\n4. ユーザーは、生成されたアイコンに名前を付けることができます。\n\n5. ツールは、すべての生成されたアイコンをzipファイルにまとめて、ダウンロードリンクを提供します。\n\n使用例：\n\n1. モバイルアプリ開発：モバイルアプリ開発のプロセスで、開発者は異なるデバイスタイプ用に異なるサイズのアイコンを生成する必要があります。Image to Iconツールを使用することで、すべての必要なアイコンを迅速に生成できます。\n\n2. デザイナー：デザイナーは、異なるデバイスタイプ用に異なるサイズのアイコンを生成する必要があります。Image to Iconツールを使用することで、すべての必要なアイコンを迅速に生成し、名前を付けることができます。\n\n3. アイコン作成：アイコンを作成する際に、Image to Iconツールを使用することで、すべての必要なアイコンを迅速に生成し、パッケージとしてダウンロードすることができます。"
  },
  "ko": {
    "$name": "이미지를 아이콘으로",
    "$keywords": [
      "아이콘",
      "생성",
      "크기 조정",
      "이미지",
      "사진",
      "그림",
      "PNG",
      "JPG",
      "JPEG",
      "WebP",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "이미지를 아이콘으로 변환하는 도구인 Image to Icon 도구는 이미지를 해당하는 아이콘으로 변환하기 위해 다양한 기기 유형과 아이콘 크기를 선택할 수 있으며, 모든 아이콘을 패키지로 다운로드할 수 있습니다.\n\n특징:\n\n1. 사용자는 도구에 이미지를 업로드할 수 있습니다.\n\n2. 도구는 iPhone, iPad, macOS, watchOS 및 Android를 위한 다양한 기기 유형과 아이콘 크기를 지원합니다.\n\n3. 사용자는 변환하려는 기기 유형과 아이콘 크기를 선택할 수 있습니다.\n\n4. 사용자는 생성된 아이콘의 이름을 지을 수 있습니다.\n\n5. 도구는 모든 생성된 아이콘을 zip 파일로 패키지화하고 다운로드 링크를 제공합니다.\n\n사용 사례:\n\n1. 모바일 앱 개발: 모바일 앱 개발 과정에서, 개발자는 다양한 기기 유형에 대한 다양한 크기의 아이콘을 생성해야 합니다. Image to Icon 도구를 사용하면 필요한 모든 아이콘을 빠르게 생성할 수 있습니다.\n\n2. 디자이너: 디자이너는 다양한 기기 유형에 대한 다양한 크기의 아이콘을 생성해야 합니다. Image to Icon 도구를 사용하면 필요한 모든 아이콘을 빠르게 생성하고 이름을 지을 수 있습니다.\n\n3. 아이콘 생성: 아이콘을 생성할 때, Image to Icon 도구를 사용하면 필요한 모든 아이콘을 빠르게 생성하고 패키지로 다운로드할 수 있습니다."
  },
  "de": {
    "$name": "Bild zu Icon",
    "$keywords": [
      "Symbol",
      "generieren",
      "skalieren",
      "Größe ändern",
      "Bild",
      "Bild",
      "Foto",
      "PNG",
      "JPG",
      "JPEG",
      "WebP",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "Das Image to Icon-Tool ist ein Werkzeug, das verwendet wird, um Bilder in Icons umzuwandeln. Benutzer können verschiedene Gerätetypen und Icon-Größen auswählen, um Bilder in entsprechende Icons umzuwandeln und alle Icons als Paket herunterzuladen.\n\nFunktionen:\n\n1. Benutzer können Bilder in das Tool hochladen.\n\n2. Das Tool unterstützt verschiedene Gerätetypen und Icon-Größen für iPhone, iPad, macOS, watchOS und Android.\n\n3. Benutzer können den gewünschten Gerätetyp und die gewünschte Icon-Größe auswählen.\n\n4. Benutzer können die generierten Icons benennen.\n\n5. Das Tool packt alle generierten Icons in eine Zip-Datei und stellt einen Download-Link bereit.\n\nAnwendungsfälle:\n\n1. Mobile App-Entwicklung: Im Prozess der mobilen App-Entwicklung müssen Entwickler Icons in verschiedenen Größen für verschiedene Gerätetypen generieren. Mit dem Image to Icon-Tool können schnell alle erforderlichen Icons generiert werden.\n\n2. Designer: Designer müssen Icons in verschiedenen Größen für verschiedene Gerätetypen generieren. Mit dem Image to Icon-Tool können schnell alle erforderlichen Icons generiert und benannt werden.\n\n3. Icon-Erstellung: Bei der Erstellung von Icons können mit dem Image to Icon-Tool schnell alle erforderlichen Icons generiert und als Paket heruntergeladen werden."
  },
  "fr": {
    "$name": "Image to Icon",
    "$keywords": [
      "icône",
      "générer",
      "échelle",
      "redimensionner",
      "image",
      "photo",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "L'outil Image to Icon est un outil utilisé pour convertir des images en icônes. Les utilisateurs peuvent sélectionner différents types d'appareils et tailles d'icônes pour convertir les images en icônes correspondantes, et télécharger toutes les icônes sous forme de package.\n\nFonctionnalités:\n\n1. Les utilisateurs peuvent télécharger des images dans l'outil.\n\n2. L'outil prend en charge différents types d'appareils et tailles d'icônes pour iPhone, iPad, macOS, watchOS et Android.\n\n3. Les utilisateurs peuvent sélectionner le type d'appareil et la taille d'icône qu'ils souhaitent convertir.\n\n4. Les utilisateurs peuvent nommer les icônes générées.\n\n5. L'outil regroupe toutes les icônes générées dans un fichier zip et fournit un lien de téléchargement.\n\nCas d'utilisation:\n\n1. Développement d'applications mobiles: Dans le processus de développement d'applications mobiles, les développeurs doivent générer des icônes de différentes tailles pour différents types d'appareils. En utilisant l'outil Image to Icon, ils peuvent rapidement générer toutes les icônes requises.\n\n2. Designers: Les designers doivent générer des icônes de différentes tailles pour différents types d'appareils. En utilisant l'outil Image to Icon, ils peuvent rapidement générer toutes les icônes requises et les nommer.\n\n3. Création d'icônes: Lors de la création d'icônes, en utilisant l'outil Image to Icon, ils peuvent rapidement générer toutes les icônes requises et les télécharger sous forme de package."
  },
  "it": {
    "$name": "Immagine in Icona",
    "$keywords": [
      "icon",
      "generare",
      "scalare",
      "ridimensionare",
      "immagine",
      "foto",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "Lo strumento Image to Icon è uno strumento utilizzato per convertire le immagini in icone. Gli utenti possono selezionare diversi tipi di dispositivi e dimensioni delle icone per convertire le immagini in icone corrispondenti e scaricare tutte le icone come pacchetto.\n\nCaratteristiche:\n\n1. Gli utenti possono caricare le immagini nello strumento.\n\n2. Lo strumento supporta diversi tipi di dispositivi e dimensioni delle icone per iPhone, iPad, macOS, watchOS e Android.\n\n3. Gli utenti possono selezionare il tipo di dispositivo e la dimensione dell'icona che desiderano convertire.\n\n4. Gli utenti possono dare un nome alle icone generate.\n\n5. Lo strumento raggruppa tutte le icone generate in un file zip e fornisce un link per il download.\n\nCasi d'uso:\n\n1. Sviluppo di app mobili: nel processo di sviluppo di app mobili, gli sviluppatori devono generare icone di diverse dimensioni per diversi tipi di dispositivi. Utilizzando lo strumento Image to Icon, è possibile generare rapidamente tutte le icone richieste.\n\n2. Designer: i designer devono generare icone di diverse dimensioni per diversi tipi di dispositivi. Utilizzando lo strumento Image to Icon, è possibile generare rapidamente tutte le icone richieste e dar loro un nome.\n\n3. Creazione di icone: durante la creazione di icone, utilizzando lo strumento Image to Icon, è possibile generare rapidamente tutte le icone richieste e scaricarle come pacchetto."
  },
  "ru": {
    "$name": "Изображение в иконку",
    "$keywords": [
      "иконка",
      "генерировать",
      "масштабировать",
      "изменить размер",
      "изображение",
      "картинка",
      "фото",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "Инструмент \"Image to Icon\" используется для преобразования изображений в иконки. Пользователи могут выбрать различные типы устройств и размеры иконок для преобразования изображений в соответствующие иконки и загрузить все иконки в виде пакета.\n\nОсобенности:\n\n1. Пользователи могут загружать изображения в инструмент.\n\n2. Инструмент поддерживает различные типы устройств и размеры иконок для iPhone, iPad, macOS, watchOS и Android.\n\n3. Пользователи могут выбрать тип устройства и размер иконки, которую они хотят преобразовать.\n\n4. Пользователи могут назвать сгенерированные иконки.\n\n5. Инструмент упаковывает все сгенерированные иконки в zip-файл и предоставляет ссылку для скачивания.\n\nПрименение:\n\n1. Разработка мобильных приложений: В процессе разработки мобильных приложений разработчикам необходимо создавать иконки разных размеров для разных типов устройств. Использование инструмента \"Image to Icon\" позволяет быстро создавать все необходимые иконки.\n\n2. Дизайнеры: Дизайнерам необходимо создавать иконки разных размеров для разных типов устройств. Использование инструмента \"Image to Icon\" позволяет быстро создавать все необходимые иконки и называть их.\n\n3. Создание иконок: При создании иконок использование инструмента \"Image to Icon\" позволяет быстро создавать все необходимые иконки и загружать их в виде пакета."
  },
  "pt": {
    "$name": "Imagem para Ícone",
    "$keywords": [
      "ícone",
      "gerar",
      "escala",
      "redimensionar",
      "imagem",
      "foto",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "A ferramenta Image to Icon é usada para converter imagens em ícones. Os usuários podem selecionar diferentes tipos de dispositivos e tamanhos de ícones para converter imagens em ícones correspondentes e baixar todos os ícones como um pacote.\n\nRecursos:\n\n1. Os usuários podem fazer upload de imagens na ferramenta.\n\n2. A ferramenta suporta diferentes tipos de dispositivos e tamanhos de ícones para iPhone, iPad, macOS, watchOS e Android.\n\n3. Os usuários podem selecionar o tipo de dispositivo e o tamanho do ícone que desejam converter.\n\n4. Os usuários podem nomear os ícones gerados.\n\n5. A ferramenta empacota todos os ícones gerados em um arquivo zip e fornece um link para download.\n\nCasos de uso:\n\n1. Desenvolvimento de aplicativos móveis: No processo de desenvolvimento de aplicativos móveis, os desenvolvedores precisam gerar ícones de diferentes tamanhos para diferentes tipos de dispositivos. Usando a ferramenta Image to Icon, é possível gerar rapidamente todos os ícones necessários.\n\n2. Designers: Os designers precisam gerar ícones de diferentes tamanhos para diferentes tipos de dispositivos. Usando a ferramenta Image to Icon, é possível gerar rapidamente todos os ícones necessários e nomeá-los.\n\n3. Criação de ícones: Ao criar ícones, usando a ferramenta Image to Icon, é possível gerar rapidamente todos os ícones necessários e baixá-los como um pacote."
  },
  "en": {
    "$name": "Image to Icon",
    "$keywords": [
      "icon",
      "generate",
      "scale",
      "resize",
      "image",
      "pic",
      "picture",
      "photo",
      "png",
      "jpg",
      "jpeg",
      "webp",
      "16x16",
      "20x20",
      "29x29",
      "32x32",
      "40x40",
      "48x48",
      "50x50",
      "55x55",
      "57x57",
      "58x58",
      "60x60",
      "66x66",
      "64x64",
      "72x72",
      "76x76",
      "80x80",
      "87x87",
      "88x88",
      "92x92",
      "96x96",
      "100x100",
      "102x102",
      "114x114",
      "120x120",
      "128x128",
      "144x144",
      "152x152",
      "167x167",
      "172x172",
      "180x180",
      "196x196",
      "216x216",
      "256x256",
      "512x512",
      "1024x1024"
    ],
    "$description": "The Image to Icon tool is a tool used to convert images into icons. Users can select different device types and icon sizes to convert images into corresponding icons, and download all icons as a package.\n\nFeatures:\n\n1. Users can upload images to the tool.\n\n2. The tool supports different device types and icon sizes for iPhone, iPad, macOS, watchOS, and Android.\n\n3. Users can select the device type and icon size they want to convert.\n\n4. Users can name the generated icons.\n\n5. The tool packages all generated icons into a zip file and provides a download link.\n\nUse cases:\n\n1. Mobile app development: In the process of mobile app development, developers need to generate icons of different sizes for different device types. Using the Image to Icon tool can quickly generate all the required icons.\n\n2. Designers: Designers need to generate icons of different sizes for different device types. Using the Image to Icon tool can quickly generate all the required icons and name them.\n\n3. Icon creation: When creating icons, using the Image to Icon tool can quickly generate all the required icons and download them as a package."
  }
}