{
  "zh-cn": {
    "$name": "AES解密",
    "$keywords": [
      "AES",
      "解密",
      "解密",
      "对称",
      "256",
      "192",
      "128",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "AES解密",
      "加密模式选择",
      "填充模式选择",
      "密钥隐藏",
      "IV隐藏"
    ],
    "$description": "AES解密工具是一种用于解密AES加密数据的工具。它可以解密输入的密文，并提供加密模式和填充方法的选择。\n\n特点：\n\n1. 支持解密输入的密文。\n\n2. 支持选择加密模式和填充方法。\n\n3. 支持将解密后的明文输出到文件。\n\n4. 支持隐藏和显示密钥和偏移量。\n\n用途：\n\n1. 数据解密：AES解密工具可用于解密AES加密数据。\n\n2. 选择加密模式和填充方法：AES解密工具可用于选择不同的加密模式和填充方法，以满足不同的加密需求。\n\n3. 隐藏密钥和偏移量：AES解密工具可用于隐藏输入时的密钥和偏移量，以保护敏感信息。"
  },
  "zh-tw": {
    "$name": "AES解密",
    "$keywords": [
      "AES",
      "解密",
      "解密",
      "對稱",
      "256",
      "192",
      "128",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "AES解密",
      "加密模式選擇",
      "填充模式選擇",
      "密鑰隱藏",
      "IV隱藏"
    ],
    "$description": "AES 解密工具是一個用於解密 AES 加密數據的工具。它可以解密輸入的密文，並提供加密模式和填充方法的選擇。\n\n特點：\n\n1. 支持解密輸入的密文。\n\n2. 支持選擇加密模式和填充方法。\n\n3. 支持將解密後的明文輸出到文件中。\n\n4. 支持隱藏和顯示密鑰和偏移量。\n\n使用場景：\n\n1. 數據解密：AES 解密工具可用於解密 AES 加密數據。\n\n2. 選擇加密模式和填充方法：AES 解密工具可用於選擇不同的加密模式和填充方法，以滿足不同的加密需求。\n\n3. 隱藏密鑰和偏移量：AES 解密工具可用於隱藏輸入的密鑰和偏移量，以保護敏感信息。"
  },
  "es": {
    "$name": "Descifrado AES",
    "$keywords": [
      "aes",
      "descifrado",
      "descifrar",
      "simétrico",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "selección de modo de descifrado AES",
      "selección de modo de relleno",
      "ocultación de clave",
      "ocultación de iv"
    ],
    "$description": "La herramienta de descifrado AES es una herramienta utilizada para descifrar datos cifrados con AES. Puede descifrar el texto cifrado de entrada y proporciona una selección de modos de cifrado y métodos de relleno.\n\nCaracterísticas:\n\n1. Admite el descifrado del texto cifrado de entrada.\n\n2. Admite la selección del modo de cifrado y el método de relleno.\n\n3. Admite la salida de archivos del texto plano descifrado.\n\n4. Admite ocultar y mostrar la clave y el desplazamiento.\n\nCasos de uso:\n\n1. Descifrado de datos: la herramienta de descifrado AES se puede utilizar para descifrar datos cifrados con AES.\n\n2. Selección del modo de cifrado y el método de relleno: la herramienta de descifrado AES se puede utilizar para seleccionar diferentes modos de cifrado y métodos de relleno para el cifrado de datos y satisfacer diferentes necesidades de cifrado.\n\n3. Ocultación de la clave y el desplazamiento: la herramienta de descifrado AES se puede utilizar para ocultar la clave y el desplazamiento al ingresarlos para proteger información confidencial."
  },
  "ja": {
    "$name": "AES 復号化",
    "$keywords": [
      "aes",
      "復号化",
      "復号",
      "対称",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES復号化",
      "暗号化モード選択",
      "パディングモード選択",
      "鍵の隠蔽",
      "ivの隠蔽"
    ],
    "$description": "AES復号ツールは、AESで暗号化されたデータを復号化するために使用されるツールです。入力された暗号文を復号化し、暗号化モードとパディング方法の選択肢を提供します。\n\n特徴：\n\n1. 入力された暗号文の復号化をサポートします。\n\n2. 暗号化モードとパディング方法の選択をサポートします。\n\n3. 復号化された平文のファイル出力をサポートします。\n\n4. キーとオフセットの非表示と表示をサポートします。\n\n使用例：\n\n1. データの復号化：AES復号ツールは、AESで暗号化されたデータを復号化するために使用できます。\n\n2. 暗号化モードとパディング方法の選択：AES復号ツールは、異なる暗号化ニーズに対応するために、異なる暗号化モードとパディング方法を選択するために使用できます。\n\n3. キーとオフセットの非表示：AES復号ツールは、機密情報を保護するために、キーとオフセットを入力する際に非表示にすることができます。"
  },
  "ko": {
    "$name": "AES 복호화",
    "$keywords": [
      "AES",
      "복호화",
      "복호화",
      "대칭",
      "256",
      "192",
      "128",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "AES 복호화",
      "암호화 모드 선택",
      "패딩 모드 선택",
      "키 숨기기",
      "IV 숨기기"
    ],
    "$description": "AES 복호화 도구는 AES 암호화된 데이터를 복호화하는 데 사용되는 도구입니다. 입력 암호문을 복호화하고 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n기능:\n\n1. 입력 암호문의 복호화를 지원합니다.\n\n2. 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n3. 복호화된 평문의 파일 출력을 지원합니다.\n\n4. 키와 오프셋을 숨기거나 표시할 수 있습니다.\n\n사용 사례:\n\n1. 데이터 복호화: AES 복호화 도구는 AES 암호화된 데이터를 복호화하는 데 사용할 수 있습니다.\n\n2. 암호화 모드와 패딩 방법 선택: AES 복호화 도구는 다양한 암호화 모드와 패딩 방법을 선택하여 다양한 암호화 요구 사항을 충족시킬 수 있습니다.\n\n3. 키와 오프셋 숨기기: 민감한 정보를 보호하기 위해 입력할 때 키와 오프셋을 숨기는 데 AES 복호화 도구를 사용할 수 있습니다."
  },
  "de": {
    "$name": "AES-Entschlüsselung",
    "$keywords": [
      "aes",
      "entschlüsselung",
      "entschlüsseln",
      "symmetrisch",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES-Entschlüsselung",
      "Verschlüsselungsmodusauswahl",
      "Polstermodusauswahl",
      "Schlüsselversteckung",
      "IV-Versteckung"
    ],
    "$description": "AES Entschlüsselungswerkzeug ist ein Werkzeug, das zur Entschlüsselung von AES-verschlüsselten Daten verwendet wird. Es kann den Eingabe-Chiffretext entschlüsseln und bietet eine Auswahl an Verschlüsselungsmodi und Padding-Methoden.\n\nFunktionen:\n\n1. Unterstützt die Entschlüsselung des Eingabe-Chiffretextes.\n\n2. Unterstützt die Auswahl des Verschlüsselungsmodus und der Padding-Methode.\n\n3. Unterstützt die Dateiausgabe des entschlüsselten Klartextes.\n\n4. Unterstützt das Verbergen und Anzeigen des Schlüssels und des Offsets.\n\nAnwendungsfälle:\n\n1. Datenentschlüsselung: AES Entschlüsselungswerkzeug kann zur Entschlüsselung von AES-verschlüsselten Daten verwendet werden.\n\n2. Auswahl des Verschlüsselungsmodus und der Padding-Methode: AES Entschlüsselungswerkzeug kann verwendet werden, um verschiedene Verschlüsselungsmodi und Padding-Methoden für die Datenverschlüsselung auszuwählen, um unterschiedlichen Verschlüsselungsanforderungen gerecht zu werden.\n\n3. Verbergen von Schlüssel und Offset: AES Entschlüsselungswerkzeug kann verwendet werden, um den Schlüssel und das Offset beim Eingeben zu verbergen, um sensible Informationen zu schützen."
  },
  "fr": {
    "$name": "Déchiffrement AES",
    "$keywords": [
      "aes",
      "décryptage",
      "décrypter",
      "symétrique",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "sélection du mode de décryptage AES",
      "sélection du mode de chiffrement",
      "sélection du mode de remplissage",
      "cacher la clé",
      "cacher l'IV"
    ],
    "$description": "Outil de décryptage AES est un outil utilisé pour décrypter des données chiffrées en AES. Il peut décrypter le texte chiffré en entrée et offre une sélection de modes de chiffrement et de méthodes de remplissage.\n\nFonctionnalités :\n\n1. Prise en charge du décryptage du texte chiffré en entrée.\n\n2. Prise en charge de la sélection du mode de chiffrement et de la méthode de remplissage.\n\n3. Prise en charge de la sortie de fichier du texte en clair décrypté.\n\n4. Prise en charge de la dissimulation et de l'affichage de la clé et du décalage.\n\nCas d'utilisation :\n\n1. Décryptage de données : l'outil de décryptage AES peut être utilisé pour décrypter des données chiffrées en AES.\n\n2. Sélection du mode de chiffrement et de la méthode de remplissage : l'outil de décryptage AES peut être utilisé pour sélectionner différents modes de chiffrement et de méthodes de remplissage pour le chiffrement de données afin de répondre à différents besoins de chiffrement.\n\n3. Dissimulation de la clé et du décalage : l'outil de décryptage AES peut être utilisé pour masquer la clé et le décalage lors de leur saisie pour protéger les informations sensibles."
  },
  "it": {
    "$name": "Decrittazione AES",
    "$keywords": [
      "aes",
      "decrittografia",
      "decrittografare",
      "simmetrico",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "selezione modalità di decrittografia",
      "selezione modalità di padding",
      "nascondere la chiave",
      "nascondere l'iv"
    ],
    "$description": "Lo strumento di decrittografia AES è uno strumento utilizzato per decrittografare dati crittografati con AES. Può decrittografare il testo cifrato in input e fornisce una selezione di modalità di crittografia e metodi di riempimento.\n\nCaratteristiche:\n\n1. Supporta la decrittografia del testo cifrato in input.\n\n2. Supporta la selezione della modalità di crittografia e del metodo di riempimento.\n\n3. Supporta l'output del file del testo in chiaro decrittografato.\n\n4. Supporta la visualizzazione e la nascita della chiave e dell'offset.\n\nCasi d'uso:\n\n1. Decrittografia dei dati: lo strumento di decrittografia AES può essere utilizzato per decrittografare dati crittografati con AES.\n\n2. Selezione della modalità di crittografia e del metodo di riempimento: lo strumento di decrittografia AES può essere utilizzato per selezionare diverse modalità di crittografia e metodi di riempimento per la crittografia dei dati per soddisfare diverse esigenze di crittografia.\n\n3. Nascondere la chiave e l'offset: lo strumento di decrittografia AES può essere utilizzato per nascondere la chiave e l'offset quando vengono inseriti per proteggere informazioni sensibili."
  },
  "ru": {
    "$name": "Расшифровка AES",
    "$keywords": [
      "aes",
      "дешифрование",
      "расшифровка",
      "симметричное",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "выбор режима шифрования",
      "выбор режима заполнения",
      "скрытие ключа",
      "скрытие iv"
    ],
    "$description": "Инструмент дешифрования AES - это инструмент, используемый для расшифровки данных, зашифрованных с помощью AES. Он может расшифровать входной шифротекст и предоставляет выбор режимов шифрования и методов дополнения.\n\nОсобенности:\n\n1. Поддерживает расшифровку входного шифротекста.\n\n2. Поддерживает выбор режима шифрования и метода дополнения.\n\n3. Поддерживает файловый вывод расшифрованного открытого текста.\n\n4. Поддерживает скрытие и отображение ключа и смещения.\n\nПрименение:\n\n1. Расшифровка данных: Инструмент дешифрования AES может использоваться для расшифровки данных, зашифрованных с помощью AES.\n\n2. Выбор режима шифрования и метода дополнения: Инструмент дешифрования AES может использоваться для выбора различных режимов шифрования и методов дополнения для шифрования данных, чтобы удовлетворить различные потребности в шифровании.\n\n3. Скрытие ключа и смещения: Инструмент дешифрования AES может использоваться для скрытия ключа и смещения при вводе их, чтобы защитить конфиденциальную информацию."
  },
  "pt": {
    "$name": "Descriptografia AES",
    "$keywords": [
      "aes",
      "decifração",
      "decifrar",
      "simétrico",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "decifração AES",
      "seleção do modo de criptografia",
      "seleção do modo de preenchimento",
      "ocultação da chave",
      "ocultação do iv"
    ],
    "$description": "Ferramenta de Descriptografia AES é uma ferramenta usada para descriptografar dados criptografados com AES. Ela pode descriptografar o texto cifrado de entrada e oferece uma seleção de modos de criptografia e métodos de preenchimento.\n\nRecursos:\n\n1. Suporta descriptografia do texto cifrado de entrada.\n\n2. Suporta seleção de modo de criptografia e método de preenchimento.\n\n3. Suporta saída de arquivo do texto simples descriptografado.\n\n4. Suporta ocultação e exibição da chave e do deslocamento.\n\nCasos de uso:\n\n1. Descriptografia de dados: A Ferramenta de Descriptografia AES pode ser usada para descriptografar dados criptografados com AES.\n\n2. Seleção de modo de criptografia e método de preenchimento: A Ferramenta de Descriptografia AES pode ser usada para selecionar diferentes modos de criptografia e métodos de preenchimento para criptografia de dados para atender a diferentes necessidades de criptografia.\n\n3. Ocultação de chave e deslocamento: A Ferramenta de Descriptografia AES pode ser usada para ocultar a chave e o deslocamento ao inseri-los para proteger informações sensíveis."
  },
  "en": {
    "$name": "AES Decryption",
    "$keywords": [
      "aes",
      "decryption",
      "decrypt",
      "symmetric",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES decryption",
      "encryption mode selection",
      "padding mode selection",
      "key hiding",
      "iv hiding"
    ],
    "$description": "AES Decryption Tool is a tool used to decrypt AES encrypted data. It can decrypt the input ciphertext and provides a selection of encryption modes and padding methods.\n\nFeatures:\n\n1. Supports decryption of input ciphertext.\n\n2. Supports selection of encryption mode and padding method.\n\n3. Supports file output of decrypted plaintext.\n\n4. Supports hiding and displaying of the key and offset.\n\nUse cases:\n\n1. Data decryption: AES Decryption Tool can be used to decrypt AES encrypted data.\n\n2. Selection of encryption mode and padding method: AES Decryption Tool can be used to select different encryption modes and padding methods for data encryption to meet different encryption needs.\n\n3. Hiding of key and offset: AES Decryption Tool can be used to hide the key and offset when inputting them to protect sensitive information."
  }
}