{
  "zh-cn": {
    "$name": "AES加密",
    "$keywords": [
      "AES加密",
      "加密",
      "对称加密",
      "256位",
      "192位",
      "128位",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充",
      "文本加密",
      "多种加密模式",
      "多种填充方法",
      "密码设置",
      "偏移量设置",
      "文件加密",
      "数据传输安全",
      "数据存储安全"
    ],
    "$description": "AES加密工具是一种用于加密和解密文本的工具。它使用AES算法来加密和解密文本，并支持多种加密模式和填充方法。\n\n功能：\n\n1. 支持文本加密和解密：用户可以输入需要加密或解密的文本，并选择适当的加密模式和填充方法。\n\n2. 支持多种加密模式：AES加密工具支持多种加密模式，如ECB、CBC、CFB、CTR和OFB。用户可以根据需要选择适当的加密模式。\n\n3. 支持多种填充方法：AES加密工具支持多种填充方法，如Pkcs7、Zero、Iso10126、None和Ansix923。用户可以根据需要选择适当的填充方法。\n\n4. 支持密码和偏移设置：用户可以设置用于加密和解密的密码和偏移量，以确保数据安全。\n\n5. 支持文件加密和解密：用户可以选择加密或解密文件，并将加密或解密后的文件保存在本地。\n\n用例：\n\n1. 数据加密：在数据传输或存储过程中，需要对数据进行加密以确保数据安全。AES加密工具可以帮助用户快速加密数据，并选择适当的加密模式和填充方法。\n\n2. 数据解密：在接收到加密数据后，需要对其进行解密。AES加密工具可以帮助用户快速解密数据，并选择适当的加密模式和填充方法。\n\n3. 文件加密：当需要加密文件时，AES加密工具可以帮助用户快速加密文件，并选择适当的加密模式和填充方法。\n\n4. 文件解密：当需要解密加密文件时，AES加密工具可以帮助用户快速解密文件，并选择适当的加密模式和填充方法。"
  },
  "zh-tw": {
    "$name": "AES加密",
    "$keywords": [
      "AES加密",
      "加密",
      "對稱加密",
      "256位",
      "192位",
      "128位",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充",
      "文本加密",
      "多種加密模式",
      "多種填充方法",
      "密碼設置",
      "偏移量設置",
      "文件加密",
      "數據傳輸安全",
      "數據存儲安全"
    ],
    "$description": "AES加密工具是一款用於加密和解密文本的工具。它使用AES算法來加密和解密文本，並支持多種加密模式和填充方法。\n\n功能：\n\n1. 支持文本加密和解密：用戶可以輸入需要加密或解密的文本，並選擇適當的加密模式和填充方法。\n\n2. 支持多種加密模式：AES加密工具支持多種加密模式，如ECB、CBC、CFB、CTR和OFB。用戶可以根據需要選擇適當的加密模式。\n\n3. 支持多種填充方法：AES加密工具支持多種填充方法，如Pkcs7、Zero、Iso10126、None和Ansix923。用戶可以根據需要選擇適當的填充方法。\n\n4. 支持密碼和偏移量設置：用戶可以設置用於加密和解密的密碼和偏移量，以確保數據安全。\n\n5. 支持文件加密和解密：用戶可以選擇加密或解密文件，並將加密或解密後的文件保存在本地。\n\n用例：\n\n1. 數據加密：在數據傳輸或存儲期間，需要加密數據以確保數據安全。AES加密工具可以幫助用戶快速加密數據並選擇適當的加密模式和填充方法。\n\n2. 數據解密：在接收到加密數據後，需要將其解密。AES加密工具可以幫助用戶快速解密數據並選擇適當的加密模式和填充方法。\n\n3. 文件加密：當需要加密文件時，AES加密工具可以幫助用戶快速加密文件並選擇適當的加密模式和填充方法。\n\n4. 文件解密：當需要解密加密文件時，AES加密工具可以幫助用戶快速解密文件並選擇適當的加密模式和填充方法。"
  },
  "es": {
    "$name": "Cifrado AES",
    "$keywords": [
      "aes",
      "encriptación",
      "encriptar",
      "simétrico",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "encriptación AES",
      "encriptación de texto",
      "múltiples modos de encriptación",
      "múltiples métodos de relleno",
      "configuración de contraseña",
      "configuración de desplazamiento",
      "encriptación de archivos",
      "seguridad en la transmisión de datos",
      "seguridad en el almacenamiento de datos"
    ],
    "$description": "La herramienta de cifrado AES es una herramienta utilizada para cifrar y descifrar texto. Utiliza el algoritmo AES para cifrar y descifrar texto, y admite múltiples modos de cifrado y métodos de relleno.\n\nCaracterísticas:\n\n1. Admite cifrado y descifrado de texto: los usuarios pueden ingresar el texto que necesita ser cifrado o descifrado, y seleccionar el modo de cifrado y el método de relleno adecuado.\n\n2. Admite múltiples modos de cifrado: la herramienta de cifrado AES admite múltiples modos de cifrado como ECB, CBC, CFB, CTR y OFB. Los usuarios pueden seleccionar el modo de cifrado adecuado según sea necesario.\n\n3. Admite múltiples métodos de relleno: la herramienta de cifrado AES admite múltiples métodos de relleno como Pkcs7, Zero, Iso10126, None y Ansix923. Los usuarios pueden seleccionar el método de relleno adecuado según sea necesario.\n\n4. Admite configuraciones de contraseña y desplazamiento: los usuarios pueden establecer la contraseña y el desplazamiento utilizados para el cifrado y descifrado para garantizar la seguridad de los datos.\n\n5. Admite cifrado y descifrado de archivos: los usuarios pueden seleccionar cifrar o descifrar un archivo y guardar el archivo cifrado o descifrado localmente.\n\nCasos de uso:\n\n1. Cifrado de datos: durante la transmisión o el almacenamiento de datos, es necesario cifrar los datos para garantizar la seguridad de los datos. La herramienta de cifrado AES puede ayudar a los usuarios a cifrar rápidamente los datos y seleccionar el modo de cifrado y el método de relleno adecuado.\n\n2. Descifrado de datos: después de recibir datos cifrados, es necesario descifrarlos. La herramienta de cifrado AES puede ayudar a los usuarios a descifrar rápidamente los datos y seleccionar el modo de cifrado y el método de relleno adecuado.\n\n3. Cifrado de archivos: cuando se necesitan cifrar archivos, la herramienta de cifrado AES puede ayudar a los usuarios a cifrar rápidamente los archivos y seleccionar el modo de cifrado y el método de relleno adecuado.\n\n4. Descifrado de archivos: cuando se necesitan descifrar archivos cifrados, la herramienta de cifrado AES puede ayudar a los usuarios a descifrar rápidamente los archivos y seleccionar el modo de cifrado y el método de relleno adecuado."
  },
  "ja": {
    "$name": "AES暗号化",
    "$keywords": [
      "aes",
      "暗号化",
      "暗号化",
      "対称",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES暗号化",
      "テキスト暗号化",
      "複数の暗号化モード",
      "複数のパディング方法",
      "パスワード設定",
      "オフセット設定",
      "ファイル暗号化",
      "データ伝送のセキュリティ",
      "データストレージのセキュリティ"
    ],
    "$description": "AES暗号化ツールは、テキストを暗号化および復号化するために使用されるツールです。AESアルゴリズムを使用してテキストを暗号化および復号化し、複数の暗号化モードおよびパディング方法をサポートしています。\n\n機能：\n\n1. テキストの暗号化および復号化をサポート：ユーザーは暗号化または復号化する必要のあるテキストを入力し、適切な暗号化モードおよびパディング方法を選択できます。\n\n2. 複数の暗号化モードをサポート：AES暗号化ツールは、ECB、CBC、CFB、CTR、およびOFBなどの複数の暗号化モードをサポートしています。ユーザーは必要に応じて適切な暗号化モードを選択できます。\n\n3. 複数のパディング方法をサポート：AES暗号化ツールは、Pkcs7、Zero、Iso10126、None、およびAnsix923などの複数のパディング方法をサポートしています。ユーザーは必要に応じて適切なパディング方法を選択できます。\n\n4. パスワードおよびオフセット設定をサポート：ユーザーは、データのセキュリティを確保するために、暗号化および復号化に使用されるパスワードおよびオフセットを設定できます。\n\n5. ファイルの暗号化および復号化をサポート：ユーザーは、ファイルを暗号化または復号化し、暗号化または復号化されたファイルをローカルに保存できます。\n\n使用例：\n\n1. データの暗号化：データの送信または保存中に、データを暗号化してデータのセキュリティを確保する必要があります。AES暗号化ツールを使用すると、ユーザーは迅速にデータを暗号化し、適切な暗号化モードおよびパディング方法を選択できます。\n\n2. データの復号化：暗号化されたデータを受信した後、データを復号化する必要があります。AES暗号化ツールを使用すると、ユーザーは迅速にデータを復号化し、適切な暗号化モードおよびパディング方法を選択できます。\n\n3. ファイルの暗号化：ファイルを暗号化する必要がある場合、AES暗号化ツールを使用すると、ユーザーは迅速にファイルを暗号化し、適切な暗号化モードおよびパディング方法を選択できます。\n\n4. ファイルの復号化：暗号化されたファイルを復号化する必要がある場合、AES暗号化ツールを使用すると、ユーザーは迅速にファイルを復号化し、適切な暗号化モードおよびパディング方法を選択できます。"
  },
  "ko": {
    "$name": "AES 암호화",
    "$keywords": [
      "aes",
      "암호화",
      "암호화",
      "대칭",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES 암호화",
      "텍스트 암호화",
      "다중 암호화 모드",
      "다중 패딩 방법",
      "비밀번호 설정",
      "오프셋 설정",
      "파일 암호화",
      "데이터 전송 보안",
      "데이터 저장 보안"
    ],
    "$description": "AES 암호화 도구는 텍스트를 암호화하고 복호화하는 데 사용되는 도구입니다. AES 알고리즘을 사용하여 텍스트를 암호화하고 복호화하며, 다중 암호화 모드와 패딩 방법을 지원합니다.\n\n기능:\n\n1. 텍스트 암호화 및 복호화 지원: 사용자는 암호화 또는 복호화해야하는 텍스트를 입력하고 적절한 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n2. 다중 암호화 모드 지원: AES 암호화 도구는 ECB, CBC, CFB, CTR 및 OFB와 같은 다중 암호화 모드를 지원합니다. 사용자는 필요에 따라 적절한 암호화 모드를 선택할 수 있습니다.\n\n3. 다중 패딩 방법 지원: AES 암호화 도구는 Pkcs7, Zero, Iso10126, None 및 Ansix923와 같은 다중 패딩 방법을 지원합니다. 사용자는 필요에 따라 적절한 패딩 방법을 선택할 수 있습니다.\n\n4. 비밀번호 및 오프셋 설정 지원: 사용자는 데이터 보안을 보장하기 위해 암호화 및 복호화에 사용되는 비밀번호와 오프셋을 설정할 수 있습니다.\n\n5. 파일 암호화 및 복호화 지원: 사용자는 파일을 암호화하거나 복호화하고, 암호화 또는 복호화된 파일을 로컬에 저장할 수 있습니다.\n\n사용 사례:\n\n1. 데이터 암호화: 데이터 전송 또는 저장 중에 데이터 보안을 보장하기 위해 데이터를 암호화해야합니다. AES 암호화 도구를 사용하면 사용자는 빠르게 데이터를 암호화하고 적절한 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n2. 데이터 복호화: 암호화된 데이터를 수신한 후에는 데이터를 복호화해야합니다. AES 암호화 도구를 사용하면 사용자는 빠르게 데이터를 복호화하고 적절한 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n3. 파일 암호화: 파일을 암호화해야하는 경우, AES 암호화 도구를 사용하면 사용자는 빠르게 파일을 암호화하고 적절한 암호화 모드와 패딩 방법을 선택할 수 있습니다.\n\n4. 파일 복호화: 암호화된 파일을 복호화해야하는 경우, AES 암호화 도구를 사용하면 사용자는 빠르게 파일을 복호화하고 적절한 암호화 모드와 패딩 방법을 선택할 수 있습니다."
  },
  "de": {
    "$name": "AES-Verschlüsselung",
    "$keywords": [
      "AES-Verschlüsselung",
      "Verschlüsselung",
      "verschlüsseln",
      "symmetrisch",
      "256",
      "192",
      "128",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "Textverschlüsselung",
      "mehrere Verschlüsselungsmodi",
      "mehrere Padding-Methoden",
      "Passwort-Einstellung",
      "Offset-Einstellung",
      "Dateiverschlüsselung",
      "Datentransmissionssicherheit",
      "Datenspeichersicherheit"
    ],
    "$description": "AES-Verschlüsselungstool ist ein Tool, das zur Verschlüsselung und Entschlüsselung von Text verwendet wird. Es verwendet den AES-Algorithmus zur Verschlüsselung und Entschlüsselung von Text und unterstützt mehrere Verschlüsselungsmodi und Padding-Methoden.\n\nFunktionen:\n\n1. Unterstützt Textverschlüsselung und -entschlüsselung: Benutzer können den Text eingeben, der verschlüsselt oder entschlüsselt werden soll, und den entsprechenden Verschlüsselungsmodus und die Padding-Methode auswählen.\n\n2. Unterstützt mehrere Verschlüsselungsmodi: AES-Verschlüsselungstool unterstützt mehrere Verschlüsselungsmodi wie ECB, CBC, CFB, CTR und OFB. Benutzer können den entsprechenden Verschlüsselungsmodus nach Bedarf auswählen.\n\n3. Unterstützt mehrere Padding-Methoden: AES-Verschlüsselungstool unterstützt mehrere Padding-Methoden wie Pkcs7, Zero, Iso10126, None und Ansix923. Benutzer können die entsprechende Padding-Methode nach Bedarf auswählen.\n\n4. Unterstützt Passwort- und Offset-Einstellungen: Benutzer können das Passwort und den Offset festlegen, die zur Verschlüsselung und Entschlüsselung verwendet werden, um die Datensicherheit zu gewährleisten.\n\n5. Unterstützt Dateiverschlüsselung und -entschlüsselung: Benutzer können auswählen, ob eine Datei verschlüsselt oder entschlüsselt werden soll, und die verschlüsselte oder entschlüsselte Datei lokal speichern.\n\nAnwendungsfälle:\n\n1. Datenverschlüsselung: Während der Datenübertragung oder -speicherung müssen Daten verschlüsselt werden, um die Datensicherheit zu gewährleisten. AES-Verschlüsselungstool kann Benutzern schnell helfen, Daten zu verschlüsseln und den entsprechenden Verschlüsselungsmodus und die Padding-Methode auszuwählen.\n\n2. Datenentschlüsselung: Nach dem Empfang verschlüsselter Daten müssen diese entschlüsselt werden. AES-Verschlüsselungstool kann Benutzern schnell helfen, Daten zu entschlüsseln und den entsprechenden Verschlüsselungsmodus und die Padding-Methode auszuwählen.\n\n3. Dateiverschlüsselung: Wenn Dateien verschlüsselt werden müssen, kann AES-Verschlüsselungstool Benutzern schnell helfen, Dateien zu verschlüsseln und den entsprechenden Verschlüsselungsmodus und die Padding-Methode auszuwählen.\n\n4. Dateientschlüsselung: Wenn verschlüsselte Dateien entschlüsselt werden müssen, kann AES-Verschlüsselungstool Benutzern schnell helfen, Dateien zu entschlüsseln und den entsprechenden Verschlüsselungsmodus und die Padding-Methode auszuwählen."
  },
  "fr": {
    "$name": "Chiffrement AES",
    "$keywords": [
      "aes",
      "chiffrement",
      "chiffrer",
      "symétrique",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "chiffrement AES",
      "chiffrement de texte",
      "modes de chiffrement multiples",
      "méthodes de remplissage multiples",
      "définition de mot de passe",
      "définition de décalage",
      "chiffrement de fichier",
      "sécurité de transmission de données",
      "sécurité de stockage de données"
    ],
    "$description": "L'outil de chiffrement AES est un outil utilisé pour chiffrer et déchiffrer du texte. Il utilise l'algorithme AES pour chiffrer et déchiffrer du texte, et prend en charge plusieurs modes de chiffrement et méthodes de remplissage.\n\nFonctionnalités :\n\n1. Prise en charge du chiffrement et du déchiffrement de texte : les utilisateurs peuvent saisir le texte à chiffrer ou à déchiffrer, et sélectionner le mode de chiffrement et la méthode de remplissage appropriés.\n\n2. Prise en charge de plusieurs modes de chiffrement : l'outil de chiffrement AES prend en charge plusieurs modes de chiffrement tels que ECB, CBC, CFB, CTR et OFB. Les utilisateurs peuvent sélectionner le mode de chiffrement approprié selon leurs besoins.\n\n3. Prise en charge de plusieurs méthodes de remplissage : l'outil de chiffrement AES prend en charge plusieurs méthodes de remplissage telles que Pkcs7, Zero, Iso10126, None et Ansix923. Les utilisateurs peuvent sélectionner la méthode de remplissage appropriée selon leurs besoins.\n\n4. Prise en charge des paramètres de mot de passe et de décalage : les utilisateurs peuvent définir le mot de passe et le décalage utilisés pour le chiffrement et le déchiffrement afin d'assurer la sécurité des données.\n\n5. Prise en charge du chiffrement et du déchiffrement de fichiers : les utilisateurs peuvent sélectionner le chiffrement ou le déchiffrement d'un fichier, et enregistrer le fichier chiffré ou déchiffré localement.\n\nCas d'utilisation :\n\n1. Chiffrement de données : lors de la transmission ou du stockage de données, les données doivent être chiffrées pour assurer la sécurité des données. L'outil de chiffrement AES peut aider les utilisateurs à chiffrer rapidement les données et à sélectionner le mode de chiffrement et la méthode de remplissage appropriés.\n\n2. Déchiffrement de données : après avoir reçu des données chiffrées, elles doivent être déchiffrées. L'outil de chiffrement AES peut aider les utilisateurs à déchiffrer rapidement les données et à sélectionner le mode de chiffrement et la méthode de remplissage appropriés.\n\n3. Chiffrement de fichiers : lorsque des fichiers doivent être chiffrés, l'outil de chiffrement AES peut aider les utilisateurs à chiffrer rapidement les fichiers et à sélectionner le mode de chiffrement et la méthode de remplissage appropriés.\n\n4. Déchiffrement de fichiers : lorsque des fichiers chiffrés doivent être déchiffrés, l'outil de chiffrement AES peut aider les utilisateurs à déchiffrer rapidement les fichiers et à sélectionner le mode de chiffrement et la méthode de remplissage appropriés."
  },
  "it": {
    "$name": "Crittografia AES",
    "$keywords": [
      "aes",
      "crittografia",
      "crittografare",
      "simmetrico",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "crittografia AES",
      "crittografia del testo",
      "modalità di crittografia multiple",
      "metodi di padding multipli",
      "impostazione della password",
      "impostazione dell'offset",
      "crittografia di file",
      "sicurezza della trasmissione dei dati",
      "sicurezza della conservazione dei dati"
    ],
    "$description": "Lo strumento di crittografia AES è uno strumento utilizzato per crittografare e decrittografare il testo. Utilizza l'algoritmo AES per crittografare e decrittografare il testo e supporta molteplici modalità di crittografia e metodi di padding.\n\nCaratteristiche:\n\n1. Supporta la crittografia e la decrittografia del testo: gli utenti possono inserire il testo che deve essere crittografato o decrittografato e selezionare la modalità di crittografia e il metodo di padding appropriati.\n\n2. Supporta molteplici modalità di crittografia: lo strumento di crittografia AES supporta molteplici modalità di crittografia come ECB, CBC, CFB, CTR e OFB. Gli utenti possono selezionare la modalità di crittografia appropriata a seconda delle necessità.\n\n3. Supporta molteplici metodi di padding: lo strumento di crittografia AES supporta molteplici metodi di padding come Pkcs7, Zero, Iso10126, None e Ansix923. Gli utenti possono selezionare il metodo di padding appropriato a seconda delle necessità.\n\n4. Supporta le impostazioni di password e offset: gli utenti possono impostare la password e l'offset utilizzati per la crittografia e la decrittografia per garantire la sicurezza dei dati.\n\n5. Supporta la crittografia e la decrittografia dei file: gli utenti possono selezionare se crittografare o decrittografare un file e salvare il file crittografato o decrittografato localmente.\n\nCasi d'uso:\n\n1. Crittografia dei dati: durante la trasmissione o la memorizzazione dei dati, i dati devono essere crittografati per garantire la sicurezza dei dati. Lo strumento di crittografia AES può aiutare gli utenti a crittografare rapidamente i dati e selezionare la modalità di crittografia e il metodo di padding appropriati.\n\n2. Decrittografia dei dati: dopo aver ricevuto dati crittografati, è necessario decrittografarli. Lo strumento di crittografia AES può aiutare gli utenti a decrittografare rapidamente i dati e selezionare la modalità di crittografia e il metodo di padding appropriati.\n\n3. Crittografia dei file: quando i file devono essere crittografati, lo strumento di crittografia AES può aiutare gli utenti a crittografare rapidamente i file e selezionare la modalità di crittografia e il metodo di padding appropriati.\n\n4. Decrittografia dei file: quando i file crittografati devono essere decrittografati, lo strumento di crittografia AES può aiutare gli utenti a decrittografare rapidamente i file e selezionare la modalità di crittografia e il metodo di padding appropriati."
  },
  "ru": {
    "$name": "Шифрование AES",
    "$keywords": [
      "aes",
      "шифрование",
      "шифровать",
      "симметричное",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "шифрование AES",
      "текстовое шифрование",
      "множество режимов шифрования",
      "множество методов дополнения",
      "установка пароля",
      "установка смещения",
      "шифрование файлов",
      "безопасность передачи данных",
      "безопасность хранения данных"
    ],
    "$description": "Инструмент шифрования AES - это инструмент, используемый для шифрования и дешифрования текста. Он использует алгоритм AES для шифрования и дешифрования текста, и поддерживает несколько режимов шифрования и методов дополнения.\n\nОсобенности:\n\n1. Поддержка шифрования и дешифрования текста: Пользователи могут вводить текст, который нужно зашифровать или расшифровать, и выбирать соответствующий режим шифрования и метод дополнения.\n\n2. Поддержка нескольких режимов шифрования: Инструмент шифрования AES поддерживает несколько режимов шифрования, таких как ECB, CBC, CFB, CTR и OFB. Пользователи могут выбирать соответствующий режим шифрования по мере необходимости.\n\n3. Поддержка нескольких методов дополнения: Инструмент шифрования AES поддерживает несколько методов дополнения, таких как Pkcs7, Zero, Iso10126, None и Ansix923. Пользователи могут выбирать соответствующий метод дополнения по мере необходимости.\n\n4. Поддержка настройки пароля и смещения: Пользователи могут установить пароль и смещение, используемые для шифрования и дешифрования, чтобы обеспечить безопасность данных.\n\n5. Поддержка шифрования и дешифрования файлов: Пользователи могут выбрать шифрование или дешифрование файла и сохранить зашифрованный или расшифрованный файл локально.\n\nПримеры использования:\n\n1. Шифрование данных: Во время передачи или хранения данных данные нужно зашифровать, чтобы обеспечить безопасность данных. Инструмент шифрования AES может помочь пользователям быстро зашифровать данные и выбрать соответствующий режим шифрования и метод дополнения.\n\n2. Расшифрование данных: После получения зашифрованных данных их нужно расшифровать. Инструмент шифрования AES может помочь пользователям быстро расшифровать данные и выбрать соответствующий режим шифрования и метод дополнения.\n\n3. Шифрование файлов: Когда файлы нужно зашифровать, инструмент шифрования AES может помочь пользователям быстро зашифровать файлы и выбрать соответствующий режим шифрования и метод дополнения.\n\n4. Расшифрование файлов: Когда зашифрованные файлы нужно расшифровать, инструмент шифрования AES может помочь пользователям быстро расшифровать файлы и выбрать соответствующий режим шифрования и метод дополнения."
  },
  "pt": {
    "$name": "Criptografia AES",
    "$keywords": [
      "aes",
      "criptografia",
      "criptografar",
      "simétrica",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "criptografia AES",
      "criptografia de texto",
      "múltiplos modos de criptografia",
      "múltiplos métodos de preenchimento",
      "configuração de senha",
      "configuração de deslocamento",
      "criptografia de arquivo",
      "segurança na transmissão de dados",
      "segurança no armazenamento de dados"
    ],
    "$description": "A Ferramenta de Criptografia AES é uma ferramenta usada para criptografar e descriptografar texto. Ela usa o algoritmo AES para criptografar e descriptografar texto, e suporta vários modos de criptografia e métodos de preenchimento.\n\nRecursos:\n\n1. Suporta criptografia e descriptografia de texto: Os usuários podem inserir o texto que precisa ser criptografado ou descriptografado e selecionar o modo de criptografia e método de preenchimento apropriados.\n\n2. Suporta vários modos de criptografia: A Ferramenta de Criptografia AES suporta vários modos de criptografia, como ECB, CBC, CFB, CTR e OFB. Os usuários podem selecionar o modo de criptografia apropriado conforme necessário.\n\n3. Suporta vários métodos de preenchimento: A Ferramenta de Criptografia AES suporta vários métodos de preenchimento, como Pkcs7, Zero, Iso10126, None e Ansix923. Os usuários podem selecionar o método de preenchimento apropriado conforme necessário.\n\n4. Suporta configurações de senha e deslocamento: Os usuários podem definir a senha e o deslocamento usados para criptografia e descriptografia para garantir a segurança dos dados.\n\n5. Suporta criptografia e descriptografia de arquivos: Os usuários podem selecionar para criptografar ou descriptografar um arquivo e salvar o arquivo criptografado ou descriptografado localmente.\n\nCasos de uso:\n\n1. Criptografia de dados: Durante a transmissão ou armazenamento de dados, os dados precisam ser criptografados para garantir a segurança dos dados. A Ferramenta de Criptografia AES pode ajudar os usuários a criptografar rapidamente os dados e selecionar o modo de criptografia e método de preenchimento apropriados.\n\n2. Descriptografia de dados: Após receber dados criptografados, é necessário descriptografá-los. A Ferramenta de Criptografia AES pode ajudar os usuários a descriptografar rapidamente os dados e selecionar o modo de criptografia e método de preenchimento apropriados.\n\n3. Criptografia de arquivos: Quando os arquivos precisam ser criptografados, a Ferramenta de Criptografia AES pode ajudar os usuários a criptografar rapidamente os arquivos e selecionar o modo de criptografia e método de preenchimento apropriados.\n\n4. Descriptografia de arquivos: Quando os arquivos criptografados precisam ser descriptografados, a Ferramenta de Criptografia AES pode ajudar os usuários a descriptografar rapidamente os arquivos e selecionar o modo de criptografia e método de preenchimento apropriados."
  },
  "en": {
    "$name": "AES Encryption",
    "$keywords": [
      "aes",
      "encryption",
      "encrypt",
      "symmetric",
      "256",
      "192",
      "128",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "AES encryption",
      "text encryption",
      "multiple encryption modes",
      "multiple padding methods",
      "password setting",
      "offset setting",
      "file encryption",
      "data transmission security",
      "data storage security"
    ],
    "$description": "AES Encryption Tool is a tool used for encrypting and decrypting text. It uses the AES algorithm to encrypt and decrypt text, and supports multiple encryption modes and padding methods.\n\nFeatures:\n\n1. Supports text encryption and decryption: Users can input the text that needs to be encrypted or decrypted, and select the appropriate encryption mode and padding method.\n\n2. Supports multiple encryption modes: AES Encryption Tool supports multiple encryption modes such as ECB, CBC, CFB, CTR, and OFB. Users can select the appropriate encryption mode as needed.\n\n3. Supports multiple padding methods: AES Encryption Tool supports multiple padding methods such as Pkcs7, Zero, Iso10126, None, and Ansix923. Users can select the appropriate padding method as needed.\n\n4. Supports password and offset settings: Users can set the password and offset used for encryption and decryption to ensure data security.\n\n5. Supports file encryption and decryption: Users can select to encrypt or decrypt a file, and save the encrypted or decrypted file locally.\n\nUse cases:\n\n1. Data encryption: During data transmission or storage, data needs to be encrypted to ensure data security. AES Encryption Tool can help users quickly encrypt data and select the appropriate encryption mode and padding method.\n\n2. Data decryption: After receiving encrypted data, it needs to be decrypted. AES Encryption Tool can help users quickly decrypt data and select the appropriate encryption mode and padding method.\n\n3. File encryption: When files need to be encrypted, AES Encryption Tool can help users quickly encrypt files and select the appropriate encryption mode and padding method.\n\n4. File decryption: When encrypted files need to be decrypted, AES Encryption Tool can help users quickly decrypt files and select the appropriate encryption mode and padding method."
  }
}