{
  "zh-cn": {
    "$name": "DES加密",
    "$keywords": [
      "DES加密",
      "加密",
      "加密",
      "对称加密",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充",
      "数据加密",
      "网络传输",
      "数据库存储",
      "安全审计",
      "对称加密",
      "DES算法",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充"
    ],
    "$description": "DES加密工具是一种用于加密文本的工具。它使用DES算法对输入文本进行加密，并提供多种加密模式和填充选项供用户选择。\n\n特点：\n\n1. 用户可以输入需要加密的文本。\n\n2. 用户可以输入加密密钥。\n\n3. 用户可以选择加密模式和填充选项。\n\n4. 工具将自动加密输入文本，并在输出区域显示加密结果。\n\n5. 用户可以选择将加密结果保存到文件中。\n\n用例：\n\n1. 数据加密：当需要加密敏感数据时，可以使用DES加密工具来保护数据的安全性。\n\n2. 网络传输：在进行网络传输时，可以使用DES加密工具对数据进行加密，以防止数据被盗取或篡改。\n\n3. 数据库存储：在将数据存储到数据库中时，可以使用DES加密工具对数据进行加密，以保护数据的机密性。\n\n4. 安全审计：在进行安全审计时，可以使用DES加密工具对敏感数据进行加密，以保护数据的机密性。"
  },
  "zh-tw": {
    "$name": "DES加密",
    "$keywords": [
      "DES加密",
      "加密",
      "對稱加密",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充",
      "資料加密",
      "網路傳輸",
      "資料庫儲存",
      "安全稽核",
      "對稱式加密",
      "DES演算法",
      "CBC模式",
      "ECB模式",
      "CFB模式",
      "CTR模式",
      "OFB模式",
      "PKCS7填充",
      "ISO10126填充",
      "ANSIX923填充"
    ],
    "$description": "DES加密工具是一個用於加密文本的工具。它使用DES算法對輸入的文本進行加密，並為用戶提供多種加密模式和填充選項供用戶選擇。\n\n特點：\n\n1. 用戶可以輸入需要加密的文本。\n\n2. 用戶可以輸入加密密鑰。\n\n3. 用戶可以選擇加密模式和填充選項。\n\n4. 工具將自動加密輸入的文本，並在輸出區域顯示加密結果。\n\n5. 用戶可以選擇將加密結果保存到文件中。\n\n用例：\n\n1. 數據加密：當需要加密敏感數據時，可以使用DES加密工具來保護數據的安全性。\n\n2. 網絡傳輸：在進行網絡傳輸時，可以使用DES加密工具對數據進行加密，以防止數據被盜取或篡改。\n\n3. 數據庫存儲：在數據庫中存儲數據時，可以使用DES加密工具對數據進行加密，以保護數據的機密性。\n\n4. 安全審計：在進行安全審計時，可以使用DES加密工具對敏感數據進行加密，以保護數據的機密性。"
  },
  "es": {
    "$name": "Cifrado DES",
    "$keywords": [
      "des",
      "encriptación",
      "encriptar",
      "simétrica",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "encriptación de datos",
      "transmisión de red",
      "almacenamiento de base de datos",
      "auditoría de seguridad",
      "encriptación simétrica",
      "algoritmo DES",
      "modo CBC",
      "modo ECB",
      "modo CFB",
      "modo CTR",
      "modo OFB",
      "relleno PKCS7",
      "relleno ISO10126",
      "relleno ANSIX923"
    ],
    "$description": "La herramienta de cifrado DES es una herramienta utilizada para cifrar texto. Utiliza el algoritmo DES para cifrar el texto de entrada y proporciona múltiples modos de cifrado y opciones de relleno para que los usuarios elijan.\n\nCaracterísticas:\n\n1. Los usuarios pueden ingresar el texto que necesita ser cifrado.\n\n2. Los usuarios pueden ingresar la clave de cifrado.\n\n3. Los usuarios pueden elegir el modo de cifrado y la opción de relleno.\n\n4. La herramienta cifrará automáticamente el texto de entrada y mostrará el resultado cifrado en el área de salida.\n\n5. Los usuarios pueden elegir guardar el resultado cifrado en un archivo.\n\nCasos de uso:\n\n1. Cifrado de datos: Cuando se necesita cifrar datos sensibles, la herramienta de cifrado DES se puede utilizar para proteger la seguridad de los datos.\n\n2. Transmisión de red: Al realizar una transmisión de red, la herramienta de cifrado DES se puede utilizar para cifrar datos y evitar el robo o la manipulación de datos.\n\n3. Almacenamiento de base de datos: Cuando se almacenan datos en una base de datos, la herramienta de cifrado DES se puede utilizar para cifrar datos y proteger la confidencialidad de los datos.\n\n4. Auditoría de seguridad: Al realizar una auditoría de seguridad, la herramienta de cifrado DES se puede utilizar para cifrar datos sensibles y proteger la confidencialidad de los datos."
  },
  "ja": {
    "$name": "DES暗号化",
    "$keywords": [
      "des",
      "暗号化",
      "暗号化",
      "対称",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "データ暗号化",
      "ネットワーク転送",
      "データベースストレージ",
      "セキュリティ監査",
      "対称暗号化",
      "DESアルゴリズム",
      "CBCモード",
      "ECBモード",
      "CFBモード",
      "CTRモード",
      "OFBモード",
      "PKCS7パディング",
      "ISO10126パディング",
      "ANSIX923パディング"
    ],
    "$description": "DES暗号化ツールは、テキストを暗号化するために使用されるツールです。入力されたテキストをDESアルゴリズムで暗号化し、ユーザーが選択できる複数の暗号化モードとパディングオプションを提供します。\n\n特徴：\n\n1. ユーザーは暗号化する必要のあるテキストを入力できます。\n\n2. ユーザーは暗号化キーを入力できます。\n\n3. ユーザーは暗号化モードとパディングオプションを選択できます。\n\n4. ツールは自動的に入力されたテキストを暗号化し、出力エリアに暗号化された結果を表示します。\n\n5. ユーザーは暗号化された結果をファイルに保存することができます。\n\n使用例：\n\n1. データの暗号化：機密データを暗号化する必要がある場合、DES暗号化ツールを使用してデータのセキュリティを保護することができます。\n\n2. ネットワーク伝送：ネットワーク伝送を行う場合、DES暗号化ツールを使用してデータを暗号化し、データの盗難や改ざんを防止することができます。\n\n3. データベースの保存：データをデータベースに保存する場合、DES暗号化ツールを使用してデータを暗号化し、データの機密性を保護することができます。\n\n4. セキュリティ監査：セキュリティ監査を行う場合、DES暗号化ツールを使用して機密データを暗号化し、データの機密性を保護することができます。"
  },
  "ko": {
    "$name": "DES 암호화",
    "$keywords": [
      "des",
      "암호화",
      "암호화",
      "대칭",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "데이터 암호화",
      "네트워크 전송",
      "데이터베이스 저장",
      "보안 감사",
      "대칭 암호화",
      "DES 알고리즘",
      "CBC 모드",
      "ECB 모드",
      "CFB 모드",
      "CTR 모드",
      "OFB 모드",
      "PKCS7 패딩",
      "ISO10126 패딩",
      "ANSIX923 패딩"
    ],
    "$description": "DES 암호화 도구는 텍스트를 암호화하는 데 사용되는 도구입니다. 입력된 텍스트를 DES 알고리즘을 사용하여 암호화하며, 사용자가 선택할 수 있는 다양한 암호화 모드와 패딩 옵션을 제공합니다.\n\n기능:\n\n1. 사용자는 암호화해야 할 텍스트를 입력할 수 있습니다.\n\n2. 사용자는 암호화 키를 입력할 수 있습니다.\n\n3. 사용자는 암호화 모드와 패딩 옵션을 선택할 수 있습니다.\n\n4. 도구는 입력된 텍스트를 자동으로 암호화하고 출력 영역에 암호화된 결과를 표시합니다.\n\n5. 사용자는 암호화된 결과를 파일에 저장할 수 있습니다.\n\n사용 사례:\n\n1. 데이터 암호화: 민감한 데이터를 암호화해야 할 때, DES 암호화 도구를 사용하여 데이터의 보안을 보호할 수 있습니다.\n\n2. 네트워크 전송: 네트워크 전송을 수행할 때, DES 암호화 도구를 사용하여 데이터를 암호화하여 데이터 도난이나 조작을 방지할 수 있습니다.\n\n3. 데이터베이스 저장: 데이터를 데이터베이스에 저장할 때, DES 암호화 도구를 사용하여 데이터의 기밀성을 보호할 수 있습니다.\n\n4. 보안 감사: 보안 감사를 수행할 때, 민감한 데이터를 암호화하여 데이터의 기밀성을 보호할 수 있습니다."
  },
  "de": {
    "$name": "DES-Verschlüsselung",
    "$keywords": [
      "DES-Verschlüsselung",
      "Verschlüsselung",
      "verschlüsseln",
      "symmetrisch",
      "CBC-Modus",
      "ECB-Modus",
      "CFB-Modus",
      "CTR-Modus",
      "OFB-Modus",
      "PKCS7-Padding",
      "ISO10126-Padding",
      "ANSIX923-Padding",
      "Datenverschlüsselung",
      "Netzwerkübertragung",
      "Datenbank-Speicherung",
      "Sicherheitsaudit",
      "symmetrische Verschlüsselung",
      "DES-Algorithmus",
      "CBC-Modus",
      "ECB-Modus",
      "CFB-Modus",
      "CTR-Modus",
      "OFB-Modus",
      "PKCS7-Padding",
      "ISO10126-Padding",
      "ANSIX923-Padding"
    ],
    "$description": "Das DES-Verschlüsselungstool ist ein Werkzeug, das zur Verschlüsselung von Text verwendet wird. Es verwendet den DES-Algorithmus zur Verschlüsselung des Eingabetextes und bietet mehrere Verschlüsselungsmodi und Padding-Optionen zur Auswahl für Benutzer.\n\nFunktionen:\n\n1. Benutzer können den Text eingeben, der verschlüsselt werden soll.\n\n2. Benutzer können den Verschlüsselungsschlüssel eingeben.\n\n3. Benutzer können den Verschlüsselungsmodus und die Padding-Option auswählen.\n\n4. Das Tool verschlüsselt automatisch den Eingabetext und zeigt das verschlüsselte Ergebnis im Ausgabe-Bereich an.\n\n5. Benutzer können wählen, das verschlüsselte Ergebnis in einer Datei zu speichern.\n\nAnwendungsfälle:\n\n1. Datenverschlüsselung: Wenn sensible Daten verschlüsselt werden müssen, kann das DES-Verschlüsselungstool verwendet werden, um die Sicherheit der Daten zu schützen.\n\n2. Netzwerkübertragung: Bei der Durchführung von Netzwerkübertragungen kann das DES-Verschlüsselungstool verwendet werden, um Daten zu verschlüsseln und Datenraub oder Manipulation zu verhindern.\n\n3. Datenbank-Speicherung: Bei der Speicherung von Daten in einer Datenbank kann das DES-Verschlüsselungstool verwendet werden, um Daten zu verschlüsseln und die Vertraulichkeit der Daten zu schützen.\n\n4. Sicherheitsaudit: Bei der Durchführung eines Sicherheitsaudits kann das DES-Verschlüsselungstool verwendet werden, um sensible Daten zu verschlüsseln und die Vertraulichkeit der Daten zu schützen."
  },
  "fr": {
    "$name": "Chiffrement DES",
    "$keywords": [
      "des",
      "encryption",
      "encrypt",
      "symétrique",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "chiffrement de données",
      "transmission de réseau",
      "stockage de base de données",
      "audit de sécurité",
      "chiffrement symétrique",
      "algorithme DES",
      "mode CBC",
      "mode ECB",
      "mode CFB",
      "mode CTR",
      "mode OFB",
      "remplissage PKCS7",
      "remplissage ISO10126",
      "remplissage ANSIX923"
    ],
    "$description": "L'outil de chiffrement DES est un outil utilisé pour chiffrer du texte. Il utilise l'algorithme DES pour chiffrer le texte d'entrée et propose plusieurs modes de chiffrement et options de remplissage pour que les utilisateurs puissent choisir.\n\nFonctionnalités :\n\n1. Les utilisateurs peuvent entrer le texte à chiffrer.\n\n2. Les utilisateurs peuvent entrer la clé de chiffrement.\n\n3. Les utilisateurs peuvent choisir le mode de chiffrement et l'option de remplissage.\n\n4. L'outil chiffrera automatiquement le texte d'entrée et affichera le résultat chiffré dans la zone de sortie.\n\n5. Les utilisateurs peuvent choisir de sauvegarder le résultat chiffré dans un fichier.\n\nCas d'utilisation :\n\n1. Chiffrement de données : Lorsque des données sensibles doivent être chiffrées, l'outil de chiffrement DES peut être utilisé pour protéger la sécurité des données.\n\n2. Transmission de réseau : Lors de la transmission de données sur un réseau, l'outil de chiffrement DES peut être utilisé pour chiffrer les données afin d'éviter le vol ou la manipulation de données.\n\n3. Stockage de base de données : Lors du stockage de données dans une base de données, l'outil de chiffrement DES peut être utilisé pour chiffrer les données afin de protéger la confidentialité des données.\n\n4. Audit de sécurité : Lors de la réalisation d'un audit de sécurité, l'outil de chiffrement DES peut être utilisé pour chiffrer des données sensibles afin de protéger la confidentialité des données."
  },
  "it": {
    "$name": "Crittografia DES",
    "$keywords": [
      "des",
      "crittografia",
      "crittografare",
      "simmetrico",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "crittografia dei dati",
      "trasmissione di rete",
      "archiviazione di database",
      "audit di sicurezza",
      "crittografia simmetrica",
      "algoritmo DES",
      "modalità CBC",
      "modalità ECB",
      "modalità CFB",
      "modalità CTR",
      "modalità OFB",
      "padding PKCS7",
      "padding ISO10126",
      "padding ANSIX923"
    ],
    "$description": "Lo strumento di crittografia DES è uno strumento utilizzato per crittografare il testo. Utilizza l'algoritmo DES per crittografare il testo di input e fornisce molteplici modalità di crittografia e opzioni di padding tra cui scegliere.\n\nCaratteristiche:\n\n1. Gli utenti possono inserire il testo che deve essere crittografato.\n\n2. Gli utenti possono inserire la chiave di crittografia.\n\n3. Gli utenti possono scegliere la modalità di crittografia e l'opzione di padding.\n\n4. Lo strumento crittografa automaticamente il testo di input e visualizza il risultato crittografato nell'area di output.\n\n5. Gli utenti possono scegliere di salvare il risultato crittografato in un file.\n\nCasi d'uso:\n\n1. Crittografia dei dati: quando i dati sensibili devono essere crittografati, lo strumento di crittografia DES può essere utilizzato per proteggere la sicurezza dei dati.\n\n2. Trasmissione di rete: durante la trasmissione di rete, lo strumento di crittografia DES può essere utilizzato per crittografare i dati al fine di prevenire il furto o la manipolazione dei dati.\n\n3. Archiviazione del database: durante l'archiviazione dei dati in un database, lo strumento di crittografia DES può essere utilizzato per crittografare i dati al fine di proteggere la riservatezza dei dati.\n\n4. Audit di sicurezza: durante un audit di sicurezza, lo strumento di crittografia DES può essere utilizzato per crittografare i dati sensibili al fine di proteggere la riservatezza dei dati."
  },
  "ru": {
    "$name": "Шифрование DES",
    "$keywords": [
      "des",
      "encryption",
      "encrypt",
      "symmetric",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Data Encryption",
      "Network Transmission",
      "Database Storage",
      "Security Audit",
      "Symmetric Encryption",
      "DES Algorithm",
      "CBC Mode",
      "ECB Mode",
      "CFB Mode",
      "CTR Mode",
      "OFB Mode",
      "PKCS7 Padding",
      "ISO10126 Padding",
      "ANSIX923 Padding"
    ],
    "$description": "Инструмент DES Encryption - это инструмент, используемый для шифрования текста. Он использует алгоритм DES для шифрования входного текста и предоставляет несколько режимов шифрования и вариантов дополнения для выбора пользователем.\n\nОсобенности:\n\n1. Пользователи могут ввести текст, который нужно зашифровать.\n\n2. Пользователи могут ввести ключ шифрования.\n\n3. Пользователи могут выбрать режим шифрования и вариант дополнения.\n\n4. Инструмент автоматически зашифрует входной текст и отобразит зашифрованный результат в области вывода.\n\n5. Пользователи могут выбрать сохранить зашифрованный результат в файл.\n\nПрименение:\n\n1. Шифрование данных: Когда необходимо зашифровать конфиденциальные данные, инструмент DES Encryption может быть использован для защиты безопасности данных.\n\n2. Сетевая передача: При передаче данных по сети, инструмент DES Encryption может быть использован для шифрования данных, чтобы предотвратить кражу или подмену данных.\n\n3. Хранение в базе данных: При хранении данных в базе данных, инструмент DES Encryption может быть использован для шифрования данных, чтобы защитить конфиденциальность данных.\n\n4. Аудит безопасности: При проведении аудита безопасности, инструмент DES Encryption может быть использован для шифрования конфиденциальных данных, чтобы защитить их конфиденциальность."
  },
  "pt": {
    "$name": "Criptografia DES",
    "$keywords": [
      "des",
      "criptografia",
      "criptografar",
      "simétrica",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Criptografia de Dados",
      "Transmissão de Rede",
      "Armazenamento de Banco de Dados",
      "Auditoria de Segurança",
      "Criptografia Simétrica",
      "Algoritmo DES",
      "Modo CBC",
      "Modo ECB",
      "Modo CFB",
      "Modo CTR",
      "Modo OFB",
      "Preenchimento PKCS7",
      "Preenchimento ISO10126",
      "Preenchimento ANSIX923"
    ],
    "$description": "A ferramenta de criptografia DES é uma ferramenta usada para criptografar texto. Ela usa o algoritmo DES para criptografar o texto de entrada e fornece várias opções de modo de criptografia e preenchimento para os usuários escolherem.\n\nRecursos:\n\n1. Os usuários podem inserir o texto que precisa ser criptografado.\n\n2. Os usuários podem inserir a chave de criptografia.\n\n3. Os usuários podem escolher o modo de criptografia e a opção de preenchimento.\n\n4. A ferramenta criptografará automaticamente o texto de entrada e exibirá o resultado criptografado na área de saída.\n\n5. Os usuários podem optar por salvar o resultado criptografado em um arquivo.\n\nCasos de uso:\n\n1. Criptografia de dados: Quando dados sensíveis precisam ser criptografados, a ferramenta de criptografia DES pode ser usada para proteger a segurança dos dados.\n\n2. Transmissão de rede: Ao realizar a transmissão de rede, a ferramenta de criptografia DES pode ser usada para criptografar dados e evitar roubo ou adulteração de dados.\n\n3. Armazenamento de banco de dados: Ao armazenar dados em um banco de dados, a ferramenta de criptografia DES pode ser usada para criptografar dados e proteger a confidencialidade dos dados.\n\n4. Auditoria de segurança: Ao realizar uma auditoria de segurança, a ferramenta de criptografia DES pode ser usada para criptografar dados sensíveis e proteger a confidencialidade dos dados."
  },
  "en": {
    "$name": "DES Encryption",
    "$keywords": [
      "des",
      "encryption",
      "encrypt",
      "symmetric",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Data Encryption",
      "Network Transmission",
      "Database Storage",
      "Security Audit",
      "Symmetric Encryption",
      "DES Algorithm",
      "CBC Mode",
      "ECB Mode",
      "CFB Mode",
      "CTR Mode",
      "OFB Mode",
      "PKCS7 Padding",
      "ISO10126 Padding",
      "ANSIX923 Padding"
    ],
    "$description": "The DES Encryption tool is a tool used to encrypt text. It uses the DES algorithm to encrypt the input text and provides multiple encryption modes and padding options for users to choose from.\n\nFeatures:\n\n1. Users can input the text that needs to be encrypted.\n\n2. Users can input the encryption key.\n\n3. Users can choose the encryption mode and padding option.\n\n4. The tool will automatically encrypt the input text and display the encrypted result in the output area.\n\n5. Users can choose to save the encrypted result to a file.\n\nUse cases:\n\n1. Data encryption: When sensitive data needs to be encrypted, the DES Encryption tool can be used to protect the security of the data.\n\n2. Network transmission: When conducting network transmission, the DES Encryption tool can be used to encrypt data to prevent data theft or tampering.\n\n3. Database storage: When storing data in a database, the DES Encryption tool can be used to encrypt data to protect the confidentiality of the data.\n\n4. Security audit: When conducting a security audit, the DES Encryption tool can be used to encrypt sensitive data to protect the confidentiality of the data."
  }
}