{
  "zh-cn": {
    "$name": "DES解密",
    "$keywords": [
      "DES解密",
      "对称加密",
      "加密模式",
      "填充方法",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "文件输入输出",
      "数据安全",
      "数据格式转换"
    ],
    "$description": "工具名称：DES解密工具\n\n工具描述：\nDES解密工具是一种用于解密DES加密数据的工具。它可以解密加密数据，并支持多种加密模式和填充选项。\n\n特点：\n1. 支持解密DES加密数据。\n2. 支持多种加密模式和填充选项。\n3. 支持文件输入和输出。\n4. 支持自动保存设置。\n\n使用场景：\n1. 数据解密：当需要解密DES加密数据时，可以使用此工具。\n2. 数据安全：在传输或存储数据时，可以使用DES加密算法加密数据。此工具可用于解密加密数据以确保数据安全。\n3. 数据格式转换：在执行数据格式转换时，可以使用此工具解密加密数据，以便更好地处理和分析数据。"
  },
  "zh-tw": {
    "$name": "DES 解密",
    "$keywords": [
      "DES 解密",
      "對稱加密",
      "加密模式",
      "填充方法",
      "CBC",
      "ECB",
      "CFB",
      "CTR",
      "OFB",
      "PKCS7",
      "ISO10126",
      "ANSIX923",
      "檔案輸入和輸出",
      "資料安全",
      "資料格式轉換"
    ],
    "$description": "工具名稱：DES 解密工具\n\n工具描述：\nDES 解密工具是一個用於解密 DES 加密數據的工具。它可以解密加密數據，並支持多種加密模式和填充選項。\n\n特點：\n1. 支持解密 DES 加密數據。\n2. 支持多種加密模式和填充選項。\n3. 支持文件輸入和輸出。\n4. 支持自動保存設置。\n\n使用案例：\n1. 數據解密：當需要解密 DES 加密數據時，可以使用此工具進行解密。\n2. 數據安全：在傳輸或存儲數據時，可以使用 DES 加密算法對數據進行加密。此工具可用於解密加密數據以確保數據安全。\n3. 數據格式轉換：在進行數據格式轉換時，可以使用此工具解密加密數據，以便更好地處理和分析數據。"
  },
  "es": {
    "$name": "Descifrado DES",
    "$keywords": [
      "des",
      "descifrado",
      "descifrar",
      "simétrico",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Descifrado DES",
      "Cifrado Simétrico",
      "Modo de Cifrado",
      "Método de Relleno",
      "Entrada y Salida de Archivos",
      "Seguridad de Datos",
      "Conversión de Formato de Datos"
    ],
    "$description": "Nombre de la herramienta: Herramienta de descifrado DES\n\nDescripción de la herramienta:\nLa Herramienta de descifrado DES es una herramienta utilizada para descifrar datos cifrados con DES. Puede descifrar datos cifrados y admite múltiples modos de cifrado y opciones de relleno.\n\nCaracterísticas:\n1. Admite el descifrado de datos cifrados con DES.\n2. Admite múltiples modos de cifrado y opciones de relleno.\n3. Admite entrada y salida de archivos.\n4. Admite la configuración de guardado automático.\n\nCasos de uso:\n1. Descifrado de datos: Esta herramienta se puede utilizar para descifrar datos cifrados con DES cuando sea necesario.\n2. Seguridad de datos: Al transmitir o almacenar datos, se puede utilizar el algoritmo de cifrado DES para cifrar datos. Esta herramienta se puede utilizar para descifrar datos cifrados y garantizar la seguridad de los datos.\n3. Conversión de formato de datos: Esta herramienta se puede utilizar para descifrar datos cifrados al realizar la conversión de formato de datos, de modo que los datos se puedan procesar y analizar mejor."
  },
  "ja": {
    "$name": "DES復号化",
    "$keywords": [
      "des",
      "復号化",
      "復号",
      "対称鍵暗号",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES復号化",
      "対称鍵暗号化",
      "暗号化モード",
      "パディング方法",
      "ファイル入出力",
      "データセキュリティ",
      "データ形式変換"
    ],
    "$description": "ツール名：DES復号ツール\n\nツールの説明：\nDES復号ツールは、DESで暗号化されたデータを復号化するためのツールです。暗号化されたデータを復号化することができ、複数の暗号化モードとパディングオプションをサポートしています。\n\n特徴：\n1. DESで暗号化されたデータの復号化をサポートしています。\n2. 複数の暗号化モードとパディングオプションをサポートしています。\n3. ファイルの入出力をサポートしています。\n4. 自動保存設定をサポートしています。\n\n使用例：\n1. データの復号化：必要な場合に、このツールを使用してDESで暗号化されたデータを復号化することができます。\n2. データのセキュリティ：データの送信や保存時に、DES暗号化アルゴリズムを使用してデータを暗号化することができます。このツールを使用して暗号化されたデータを復号化し、データのセキュリティを確保することができます。\n3. データ形式の変換：データ形式の変換を行う際に、このツールを使用して暗号化されたデータを復号化し、データをより良く処理および分析することができます。"
  },
  "ko": {
    "$name": "DES 복호화",
    "$keywords": [
      "des",
      "복호화",
      "복호화",
      "대칭",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES 복호화",
      "대칭 암호화",
      "암호화 모드",
      "패딩 방법",
      "파일 입력 및 출력",
      "데이터 보안",
      "데이터 형식 변환"
    ],
    "$description": "도구 이름: DES 복호화 도구\n\n도구 설명:\nDES 복호화 도구는 DES로 암호화된 데이터를 복호화하는 데 사용되는 도구입니다. 암호화된 데이터를 복호화할 수 있으며 다중 암호화 모드와 패딩 옵션을 지원합니다.\n\n특징:\n1. DES로 암호화된 데이터의 복호화를 지원합니다.\n2. 다중 암호화 모드와 패딩 옵션을 지원합니다.\n3. 파일 입력 및 출력을 지원합니다.\n4. 자동 저장 설정을 지원합니다.\n\n사용 사례:\n1. 데이터 복호화: 필요할 때 DES로 암호화된 데이터를 복호화하는 데 이 도구를 사용할 수 있습니다.\n2. 데이터 보안: 데이터를 전송하거나 저장할 때 DES 암호화 알고리즘을 사용하여 데이터를 암호화할 수 있습니다. 이 도구를 사용하여 암호화된 데이터를 복호화하여 데이터 보안을 보장할 수 있습니다.\n3. 데이터 형식 변환: 데이터 형식 변환을 수행할 때 암호화된 데이터를 복호화하여 데이터를 더 잘 처리하고 분석할 수 있습니다."
  },
  "de": {
    "$name": "DES Entschlüsselung",
    "$keywords": [
      "des",
      "entschlüsselung",
      "entschlüsseln",
      "symmetrisch",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES Entschlüsselung",
      "Symmetrische Verschlüsselung",
      "Verschlüsselungsmodus",
      "Padding-Methode",
      "Dateiein- und -ausgabe",
      "Datensicherheit",
      "Datenformatkonvertierung"
    ],
    "$description": "Werkzeugname: DES-Entschlüsselungswerkzeug\n\nWerkzeugbeschreibung:\nDas DES-Entschlüsselungswerkzeug ist ein Werkzeug, das zur Entschlüsselung von DES-verschlüsselten Daten verwendet wird. Es kann verschlüsselte Daten entschlüsseln und unterstützt mehrere Verschlüsselungsmodi und Padding-Optionen.\n\nFunktionen:\n1. Unterstützt die Entschlüsselung von DES-verschlüsselten Daten.\n2. Unterstützt mehrere Verschlüsselungsmodi und Padding-Optionen.\n3. Unterstützt die Eingabe und Ausgabe von Dateien.\n4. Unterstützt automatische Speichereinstellungen.\n\nAnwendungsfälle:\n1. Datenentschlüsselung: Dieses Werkzeug kann verwendet werden, um DES-verschlüsselte Daten bei Bedarf zu entschlüsseln.\n2. Datensicherheit: Beim Übertragen oder Speichern von Daten kann der DES-Verschlüsselungsalgorithmus verwendet werden, um Daten zu verschlüsseln. Dieses Werkzeug kann verwendet werden, um verschlüsselte Daten zu entschlüsseln, um die Datensicherheit zu gewährleisten.\n3. Datenformatkonvertierung: Dieses Werkzeug kann verwendet werden, um verschlüsselte Daten bei der Durchführung von Datenformatkonvertierungen zu entschlüsseln, damit Daten besser verarbeitet und analysiert werden können."
  },
  "fr": {
    "$name": "Déchiffrement DES",
    "$keywords": [
      "des",
      "décryptage",
      "décrypter",
      "symétrique",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Décryptage DES",
      "Chiffrement symétrique",
      "Mode de chiffrement",
      "Méthode de remplissage",
      "Entrée et sortie de fichier",
      "Sécurité des données",
      "Conversion de format de données"
    ],
    "$description": "Nom de l'outil : Outil de décryptage DES\n\nDescription de l'outil :\nL'outil de décryptage DES est un outil utilisé pour décrypter des données chiffrées en DES. Il peut décrypter des données chiffrées et prend en charge plusieurs modes de chiffrement et options de remplissage.\n\nFonctionnalités :\n1. Prend en charge le décryptage de données chiffrées en DES.\n2. Prend en charge plusieurs modes de chiffrement et options de remplissage.\n3. Prend en charge l'entrée et la sortie de fichiers.\n4. Prend en charge l'enregistrement automatique des paramètres.\n\nCas d'utilisation :\n1. Décryptage de données : Cet outil peut être utilisé pour décrypter des données chiffrées en DES lorsque cela est nécessaire.\n2. Sécurité des données : Lors de la transmission ou du stockage de données, l'algorithme de chiffrement DES peut être utilisé pour chiffrer les données. Cet outil peut être utilisé pour décrypter des données chiffrées afin d'assurer la sécurité des données.\n3. Conversion de format de données : Cet outil peut être utilisé pour décrypter des données chiffrées lors de la conversion de format de données, de sorte que les données puissent être mieux traitées et analysées."
  },
  "it": {
    "$name": "Decrittografia DES",
    "$keywords": [
      "des",
      "decrittografia",
      "decrittografare",
      "simmetrico",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "Decrittografia DES",
      "Crittografia Simmetrica",
      "Modalità di Crittografia",
      "Metodo di Riempimento",
      "Input e Output di File",
      "Sicurezza dei Dati",
      "Conversione del Formato dei Dati"
    ],
    "$description": "Nome dello strumento: Strumento di decrittografia DES\n\nDescrizione dello strumento:\nLo strumento di decrittografia DES è uno strumento utilizzato per decrittografare dati crittografati con DES. Può decrittografare dati crittografati e supporta molteplici modalità di crittografia e opzioni di padding.\n\nCaratteristiche:\n1. Supporta la decrittografia di dati crittografati con DES.\n2. Supporta molteplici modalità di crittografia e opzioni di padding.\n3. Supporta l'input e l'output di file.\n4. Supporta le impostazioni di salvataggio automatico.\n\nCasi d'uso:\n1. Decrittografia dei dati: Questo strumento può essere utilizzato per decrittografare dati crittografati con DES quando necessario.\n2. Sicurezza dei dati: Quando si trasmettono o si archiviano dati, l'algoritmo di crittografia DES può essere utilizzato per crittografare i dati. Questo strumento può essere utilizzato per decrittografare i dati crittografati per garantire la sicurezza dei dati.\n3. Conversione del formato dei dati: Questo strumento può essere utilizzato per decrittografare dati crittografati durante la conversione del formato dei dati, in modo che i dati possano essere elaborati e analizzati meglio."
  },
  "ru": {
    "$name": "Расшифровка DES",
    "$keywords": [
      "des",
      "decryption",
      "decrypt",
      "symmetric",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES Decryption",
      "Symmetric Encryption",
      "Encryption Mode",
      "Padding Method",
      "File Input and Output",
      "Data Security",
      "Data Format Conversion"
    ],
    "$description": "Название инструмента: Инструмент дешифрования DES\n\nОписание инструмента:\nИнструмент дешифрования DES используется для дешифрования зашифрованных данных DES. Он может дешифровать зашифрованные данные и поддерживает несколько режимов шифрования и вариантов дополнения.\n\nОсобенности:\n1. Поддерживает дешифрование зашифрованных данных DES.\n2. Поддерживает несколько режимов шифрования и вариантов дополнения.\n3. Поддерживает ввод и вывод файлов.\n4. Поддерживает автоматическое сохранение настроек.\n\nПрименение:\n1. Дешифрование данных: Этот инструмент может использоваться для дешифрования зашифрованных данных DES при необходимости.\n2. Безопасность данных: При передаче или хранении данных алгоритм шифрования DES может использоваться для шифрования данных. Этот инструмент может использоваться для дешифрования зашифрованных данных для обеспечения безопасности данных.\n3. Преобразование формата данных: Этот инструмент может использоваться для дешифрования зашифрованных данных при выполнении преобразования формата данных, чтобы данные могли быть лучше обработаны и проанализированы."
  },
  "pt": {
    "$name": "Descriptografia DES",
    "$keywords": [
      "des",
      "decifração",
      "decifrar",
      "simétrico",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES Decryption",
      "Criptografia Simétrica",
      "Modo de Criptografia",
      "Método de Preenchimento",
      "Entrada e Saída de Arquivo",
      "Segurança de Dados",
      "Conversão de Formato de Dados"
    ],
    "$description": "Nome da Ferramenta: Ferramenta de Descriptografia DES\n\nDescrição da Ferramenta:\nA Ferramenta de Descriptografia DES é uma ferramenta usada para descriptografar dados criptografados com DES. Ela pode descriptografar dados criptografados e suporta vários modos de criptografia e opções de preenchimento.\n\nRecursos:\n1. Suporta descriptografia de dados criptografados com DES.\n2. Suporta vários modos de criptografia e opções de preenchimento.\n3. Suporta entrada e saída de arquivos.\n4. Suporta configurações de salvamento automático.\n\nCasos de Uso:\n1. Descriptografia de dados: Esta ferramenta pode ser usada para descriptografar dados criptografados com DES quando necessário.\n2. Segurança de dados: Ao transmitir ou armazenar dados, o algoritmo de criptografia DES pode ser usado para criptografar dados. Esta ferramenta pode ser usada para descriptografar dados criptografados para garantir a segurança dos dados.\n3. Conversão de formato de dados: Esta ferramenta pode ser usada para descriptografar dados criptografados ao realizar a conversão de formato de dados, para que os dados possam ser melhor processados e analisados."
  },
  "en": {
    "$name": "DES Decryption",
    "$keywords": [
      "des",
      "decryption",
      "decrypt",
      "symmetric",
      "cbc",
      "ecb",
      "cfb",
      "ctr",
      "ofb",
      "pkcs7",
      "iso10126",
      "ansix923",
      "DES Decryption",
      "Symmetric Encryption",
      "Encryption Mode",
      "Padding Method",
      "File Input and Output",
      "Data Security",
      "Data Format Conversion"
    ],
    "$description": "Tool Name: DES Decryption Tool\n\nTool Description:\nThe DES Decryption Tool is a tool used to decrypt DES encrypted data. It can decrypt encrypted data and supports multiple encryption modes and padding options.\n\nFeatures:\n1. Supports decryption of DES encrypted data.\n2. Supports multiple encryption modes and padding options.\n3. Supports file input and output.\n4. Supports automatic save settings.\n\nUse Cases:\n1. Data decryption: This tool can be used to decrypt DES encrypted data when needed.\n2. Data security: When transmitting or storing data, DES encryption algorithm can be used to encrypt data. This tool can be used to decrypt encrypted data to ensure data security.\n3. Data format conversion: This tool can be used to decrypt encrypted data when performing data format conversion, so that data can be better processed and analyzed."
  }
}