{
  "zh-cn": {
    "$name": "贷款计算器",
    "$keywords": [
      "贷款利率",
      "还款计划",
      "贷款本金",
      "利率加点值",
      "年利率",
      "贷款期限",
      "每月还款额",
      "总利息",
      "总还款额",
      "每月还款明细",
      "期数",
      "每月还款利息",
      "每月还款本金",
      "剩余贷款本金",
      "贷款计算",
      "投资决策",
      "金融教育",
      "实际贷款利率",
      "贷款利率",
      "还款方式",
      "LPR加点",
      "还款方式",
      "还款计算",
      "贷款比较",
      "贷款管理",
      "CSV导出"
    ],
    "$description": "贷款计算器工具文档\n\n贷款计算器工具是一种用于计算贷款利率和还款计划的工具。用户可以输入贷款本金、最新基准利率、LPR加点、贷款期限和还款方式等信息。该工具将自动计算每月还款金额、总利息和总还款金额，并生成还款计划表。用户还可以将还款计划表导出为CSV文件。\n\n使用场景：\n\n1. 贷款计算：在申请贷款时，用户可以使用贷款计算器工具计算每月还款金额、总利息和总还款金额，以更好地了解贷款成本和还款计划。\n\n2. 贷款比较：用户可以使用贷款计算器工具比较不同贷款方案的还款计划和成本，以选择最优贷款方案。\n\n3. 贷款管理：用户可以使用贷款计算器工具跟踪贷款还款计划和还款状态，以更好地管理他们的贷款。\n\n使用说明：\n\n1. 打开贷款计算器工具页面。\n\n2. 输入贷款本金、最新基准利率、LPR加点、贷款期限和还款方式等信息。\n\n3. 点击“计算”按钮，工具将自动计算每月还款金额、总利息和总还款金额，并生成还款计划表。\n\n4. 用户可以查看还款计划表并将其导出为CSV文件。\n\n注意事项：\n\n1. 输入的贷款本金、最新基准利率、LPR加点、贷款期限和还款方式等信息必须合法有效。\n\n2. 工具计算出的每月还款金额、总利息和总还款金额仅供参考，实际情况可能有所不同。\n\n3. 用户导出的还款计划表仅供参考，实际情况可能有所不同。\n\n4. 用户应妥善保管贷款计算器工具生成的还款计划表和导出的CSV文件，以避免泄露个人信息。\n\n5. 用户在使用贷款计算器工具时应遵守相关法律、法规和政策，不得将其用于非法目的。"
  },
  "zh-tw": {
    "$name": "貸款計算器",
    "$keywords": [
      "貸款利率",
      "還款計劃",
      "貸款本金",
      "利率加價值",
      "年利率",
      "貸款期限",
      "每月還款金額",
      "總利息",
      "總還款金額",
      "每月還款詳情",
      "期間",
      "每月還款利息",
      "每月還款本金",
      "剩餘貸款本金",
      "貸款計算",
      "投資決策",
      "財務教育",
      "實際貸款利率",
      "貸款利率",
      "還款方式",
      "LPR加價",
      "還款方法",
      "還款計算",
      "貸款比較",
      "貸款管理",
      "CSV匯出"
    ],
    "$description": "貸款計算器工具文檔\n\n貸款計算器工具是一種用於計算貸款利率和還款計劃的工具。用戶可以輸入貸款本金、最新基準利率、LPR加價、貸款期限和還款方式等信息。該工具將自動計算每月還款金額、總利息和總還款金額，並生成還款計劃表。用戶還可以將還款計劃表導出為CSV文件。\n\n使用情境：\n\n1. 貸款計算：當申請貸款時，用戶可以使用貸款計算器工具計算每月還款金額、總利息和總還款金額，以更好地了解貸款成本和還款計劃。\n\n2. 貸款比較：用戶可以使用貸款計算器工具比較不同貸款方案的還款計劃和成本，以選擇最優貸款方案。\n\n3. 貸款管理：用戶可以使用貸款計算器工具跟踪貸款還款計劃和還款狀態，以更好地管理他們的貸款。\n\n使用說明：\n\n1. 打開貸款計算器工具頁面。\n\n2. 輸入貸款本金、最新基準利率、LPR加價、貸款期限和還款方式等信息。\n\n3. 點擊“計算”按鈕，該工具將自動計算每月還款金額、總利息和總還款金額，並生成還款計劃表。\n\n4. 用戶可以查看還款計劃表並將其導出為CSV文件。\n\n注意事項：\n\n1. 貸款本金、最新基準利率、LPR加價、貸款期限和還款方式等輸入信息必須合法有效。\n\n2. 該工具計算的每月還款金額、總利息和總還款金額僅供參考，實際情況可能有所不同。\n\n3. 用戶導出的還款計劃表僅供參考，實際情況可能有所不同。\n\n4. 用戶應妥善保管貸款計算器工具生成的還款計劃表和導出的CSV文件，以避免泄露個人信息。\n\n5. 用戶在使用貸款計算器工具時應遵守相關法律、法規和政策，不得用於非法目的。"
  },
  "es": {
    "$name": "Calculadora de préstamos",
    "$keywords": [
      "tasas de interés del préstamo",
      "planes de pago",
      "principal del préstamo",
      "valor de aumento de la tasa de interés",
      "tasa de interés anual",
      "plazo del préstamo",
      "cantidad de pago mensual",
      "intereses totales",
      "cantidad total a pagar",
      "detalles de pago mensual",
      "período",
      "intereses mensuales",
      "principal de pago mensual",
      "principal restante del préstamo",
      "cálculo del préstamo",
      "toma de decisiones de inversión",
      "educación financiera",
      "tasas de interés reales del préstamo",
      "tasa de interés del préstamo",
      "plan de pago",
      "marcado LPR",
      "método de pago",
      "cálculo de pago",
      "comparación de préstamos",
      "gestión de préstamos",
      "exportación CSV"
    ],
    "$description": "Documentación de la herramienta Calculadora de Préstamos\n\nLa herramienta Calculadora de Préstamos se utiliza para calcular las tasas de interés y los planes de pago de los préstamos. Los usuarios pueden ingresar información como el capital del préstamo, la última tasa de interés de referencia, el margen LPR, el plazo del préstamo y el método de pago. La herramienta calculará automáticamente el monto de pago mensual, el interés total y el monto total de pago, y generará una tabla de plan de pago. Los usuarios también pueden exportar la tabla de plan de pago como un archivo CSV.\n\nCasos de uso:\n\n1. Cálculo de préstamos: al solicitar un préstamo, los usuarios pueden utilizar la herramienta Calculadora de Préstamos para calcular el monto de pago mensual, el interés total y el monto total de pago, para comprender mejor el costo del préstamo y el plan de pago.\n\n2. Comparación de préstamos: los usuarios pueden utilizar la herramienta Calculadora de Préstamos para comparar los planes de pago y los costos de diferentes esquemas de préstamos, para elegir el esquema de préstamo óptimo.\n\n3. Gestión de préstamos: los usuarios pueden utilizar la herramienta Calculadora de Préstamos para realizar un seguimiento de los planes de pago de los préstamos y el estado de pago, para gestionar mejor sus préstamos.\n\nInstrucciones:\n\n1. Abra la página de la herramienta Calculadora de Préstamos.\n\n2. Ingrese información como el capital del préstamo, la última tasa de interés de referencia, el margen LPR, el plazo del préstamo y el método de pago.\n\n3. Haga clic en el botón \"Calcular\", y la herramienta calculará automáticamente el monto de pago mensual, el interés total y el monto total de pago, y generará una tabla de plan de pago.\n\n4. Los usuarios pueden ver la tabla de plan de pago y exportarla como un archivo CSV.\n\nNotas:\n\n1. La información de entrada, como el capital del préstamo, la última tasa de interés de referencia, el margen LPR, el plazo del préstamo y el método de pago, debe ser legal y válida.\n\n2. El monto de pago mensual, el interés total y el monto total de pago calculados por la herramienta son solo de referencia, y la situación real puede ser diferente.\n\n3. La tabla de plan de pago exportada por el usuario es solo de referencia, y la situación real puede ser diferente.\n\n4. Los usuarios deben mantener adecuadamente la tabla de plan de pago y el archivo CSV exportado generado por la herramienta Calculadora de Préstamos para evitar la divulgación de información personal.\n\n5. Los usuarios deben cumplir con las leyes, regulaciones y políticas relevantes al utilizar la herramienta Calculadora de Préstamos, y no deben utilizarla para fines ilegales."
  },
  "ja": {
    "$name": "ローン計算機",
    "$keywords": [
      "ローン金利",
      "返済プラン",
      "ローン元本",
      "金利マークアップ値",
      "年間金利",
      "ローン期間",
      "月々の返済額",
      "総利息",
      "総返済額",
      "月々の返済詳細",
      "期間",
      "月々の返済利息",
      "月々の返済元本",
      "残りのローン元本",
      "ローン計算",
      "投資判断",
      "金融教育",
      "実際のローン金利",
      "ローン金利",
      "返済プラン",
      "LPRマークアップ",
      "返済方法",
      "返済計算",
      "ローン比較",
      "ローン管理",
      "CSVエクスポート"
    ],
    "$description": "ローン計算ツールのドキュメンテーション\n\nローン計算ツールは、ローンの利子率や返済計画を計算するためのツールです。ユーザーは、ローンの元本、最新の基準金利、LPRマークアップ、ローン期間、返済方法などの情報を入力することができます。ツールは自動的に、月々の返済額、総利息、総返済額を計算し、返済計画表を生成します。ユーザーは、返済計画表をCSVファイルとしてエクスポートすることもできます。\n\n使用例：\n\n1. ローン計算：ローンを申し込む際に、ユーザーはローン計算ツールを使用して、月々の返済額、総利息、総返済額を計算し、ローンのコストと返済計画をよりよく理解することができます。\n\n2. ローン比較：ユーザーは、ローン計算ツールを使用して、異なるローンプランの返済計画とコストを比較し、最適なローンプランを選択することができます。\n\n3. ローン管理：ユーザーは、ローン計算ツールを使用して、ローンの返済計画と返済状況を追跡し、ローンをより良く管理することができます。\n\n手順：\n\n1. ローン計算ツールのページを開きます。\n\n2. ローンの元本、最新の基準金利、LPRマークアップ、ローン期間、返済方法などの情報を入力します。\n\n3. 「計算」ボタンをクリックすると、ツールは自動的に、月々の返済額、総利息、総返済額を計算し、返済計画表を生成します。\n\n4. ユーザーは、返済計画表を表示し、CSVファイルとしてエクスポートすることができます。\n\n注意事項：\n\n1. ローンの元本、最新の基準金利、LPRマークアップ、ローン期間、返済方法などの入力情報は、合法かつ有効である必要があります。\n\n2. ツールによって計算された月々の返済額、総利息、総返済額は参考値であり、実際の状況と異なる場合があります。\n\n3. ユーザーがエクスポートした返済計画表は参考値であり、実際の状況と異なる場合があります。\n\n4. ユーザーは、個人情報が漏洩しないように、ローン計算ツールによって生成された返済計画表とエクスポートされたCSVファイルを適切に保管する必要があります。\n\n5. ユーザーは、ローン計算ツールを使用する際に関連する法律、規制、政策に従い、違法な目的で使用しないようにする必要があります。"
  },
  "ko": {
    "$name": "대출 계산기",
    "$keywords": [
      "대출 이자율",
      "상환 계획",
      "대출 원금",
      "이자율 마크업 값",
      "연간 이자율",
      "대출 기간",
      "월 상환액",
      "총 이자",
      "총 상환액",
      "월별 상환 내역",
      "기간",
      "월별 상환 이자",
      "월별 상환 원금",
      "잔여 대출 원금",
      "대출 계산",
      "투자 결정",
      "금융 교육",
      "실제 대출 이자율",
      "대출 이자율",
      "상환 계획",
      "LPR 마크업",
      "상환 방법",
      "상환 계산",
      "대출 비교",
      "대출 관리",
      "CSV 내보내기"
    ],
    "$description": "대출 계산기 도구 문서\n\n대출 계산기 도구는 대출 이자율과 상환 계획을 계산하는 데 사용되는 도구입니다. 사용자는 대출 원금, 최신 기준 이자율, LPR 마크업, 대출 기간 및 상환 방법과 같은 정보를 입력할 수 있습니다. 도구는 월 상환 금액, 총 이자, 총 상환 금액을 자동으로 계산하고 상환 계획 표를 생성합니다. 사용자는 또한 상환 계획 표를 CSV 파일로 내보낼 수 있습니다.\n\n사용 사례:\n\n1. 대출 계산: 대출 신청 시 대출 계산기 도구를 사용하여 월 상환 금액, 총 이자 및 총 상환 금액을 계산하여 대출 비용과 상환 계획을 더 잘 이해할 수 있습니다.\n\n2. 대출 비교: 사용자는 대출 계획과 비용을 비교하기 위해 대출 계산기 도구를 사용하여 다른 대출 제도의 상환 계획과 비용을 비교할 수 있습니다.\n\n3. 대출 관리: 사용자는 대출 상환 계획과 상환 상태를 추적하기 위해 대출 계산기 도구를 사용하여 대출을 더 잘 관리할 수 있습니다.\n\n사용 방법:\n\n1. 대출 계산기 도구 페이지를 엽니다.\n\n2. 대출 원금, 최신 기준 이자율, LPR 마크업, 대출 기간 및 상환 방법과 같은 정보를 입력합니다.\n\n3. \"계산\" 버튼을 클릭하면 도구가 월 상환 금액, 총 이자 및 총 상환 금액을 자동으로 계산하고 상환 계획 표를 생성합니다.\n\n4. 사용자는 상환 계획 표를 볼 수 있으며 CSV 파일로 내보낼 수 있습니다.\n\n참고 사항:\n\n1. 대출 원금, 최신 기준 이자율, LPR 마크업, 대출 기간 및 상환 방법과 같은 입력 정보는 합법적이고 유효해야 합니다.\n\n2. 도구가 계산한 월 상환 금액, 총 이자 및 총 상환 금액은 참고용이며 실제 상황과 다를 수 있습니다.\n\n3. 사용자가 내보낸 상환 계획 표는 참고용이며 실제 상황과 다를 수 있습니다.\n\n4. 사용자는 대출 계산기 도구에서 생성된 상환 계획 표 및 내보낸 CSV 파일을 적절히 보관하여 개인 정보 유출을 방지해야 합니다.\n\n5. 사용자는 대출 계산기 도구를 사용할 때 관련 법률, 규정 및 정책을 준수하고 불법적인 목적으로 사용해서는 안 됩니다."
  },
  "de": {
    "$name": "Kreditrechner",
    "$keywords": [
      "Darlehenszinsen",
      "Rückzahlungspläne",
      "Darlehenshauptstadt",
      "Zinsaufschlagswert",
      "jährlicher Zinssatz",
      "Darlehenslaufzeit",
      "monatlicher Rückzahlungsbetrag",
      "Gesamtzinsen",
      "Gesamtrückzahlungsbetrag",
      "monatliche Rückzahlungsdetails",
      "Zeitraum",
      "monatliche Rückzahlungszinsen",
      "monatlicher Rückzahlungshauptstadt",
      "verbleibende Darlehenshauptstadt",
      "Darlehensberechnung",
      "Investitionsentscheidungen",
      "Finanzbildung",
      "tatsächliche Darlehenszinsen",
      "Darlehenszinssatz",
      "Rückzahlungsplan",
      "LPR-Aufschlag",
      "Rückzahlungsmethode",
      "Rückzahlungsberechnung",
      "Darlehensvergleich",
      "Darlehensverwaltung",
      "CSV-Export"
    ],
    "$description": "Werkzeugdokumentation für den Kreditrechner\n\nDer Kreditrechner ist ein Werkzeug, das zur Berechnung von Kreditzinsen und Rückzahlungsplänen verwendet wird. Benutzer können Informationen wie Kreditbetrag, den neuesten Benchmark-Zinssatz, LPR-Aufschlag, Kreditlaufzeit und Rückzahlungsmethode eingeben. Das Werkzeug berechnet automatisch den monatlichen Rückzahlungsbetrag, die Gesamtzinsen und den Gesamtrückzahlungsbetrag und generiert eine Rückzahlungsplan-Tabelle. Benutzer können die Rückzahlungsplan-Tabelle auch als CSV-Datei exportieren.\n\nAnwendungsfälle:\n\n1. Kreditberechnung: Bei der Beantragung eines Kredits können Benutzer den Kreditrechner verwenden, um den monatlichen Rückzahlungsbetrag, die Gesamtzinsen und den Gesamtrückzahlungsbetrag zu berechnen, um die Kreditkosten und den Rückzahlungsplan besser zu verstehen.\n\n2. Kreditvergleich: Benutzer können den Kreditrechner verwenden, um die Rückzahlungspläne und Kosten verschiedener Kreditprogramme zu vergleichen, um das optimale Kreditprogramm auszuwählen.\n\n3. Kreditmanagement: Benutzer können den Kreditrechner verwenden, um Rückzahlungspläne und Rückzahlungsstatus zu verfolgen, um ihre Kredite besser zu verwalten.\n\nAnweisungen:\n\n1. Öffnen Sie die Seite des Kreditrechners.\n\n2. Geben Sie Informationen wie Kreditbetrag, den neuesten Benchmark-Zinssatz, LPR-Aufschlag, Kreditlaufzeit und Rückzahlungsmethode ein.\n\n3. Klicken Sie auf die Schaltfläche \"Berechnen\", und das Werkzeug berechnet automatisch den monatlichen Rückzahlungsbetrag, die Gesamtzinsen und den Gesamtrückzahlungsbetrag und generiert eine Rückzahlungsplan-Tabelle.\n\n4. Benutzer können die Rückzahlungsplan-Tabelle anzeigen und als CSV-Datei exportieren.\n\nHinweise:\n\n1. Die eingegebenen Informationen wie Kreditbetrag, der neueste Benchmark-Zinssatz, LPR-Aufschlag, Kreditlaufzeit und Rückzahlungsmethode müssen legal und gültig sein.\n\n2. Der monatliche Rückzahlungsbetrag, die Gesamtzinsen und der Gesamtrückzahlungsbetrag, die vom Werkzeug berechnet werden, dienen nur als Referenz, und die tatsächliche Situation kann unterschiedlich sein.\n\n3. Die vom Benutzer exportierte Rückzahlungsplan-Tabelle dient nur als Referenz, und die tatsächliche Situation kann unterschiedlich sein.\n\n4. Benutzer sollten die Rückzahlungsplan-Tabelle und die exportierte CSV-Datei, die vom Kreditrechner generiert wurden, ordnungsgemäß aufbewahren, um ein Auslaufen persönlicher Informationen zu vermeiden.\n\n5. Benutzer sollten bei der Verwendung des Kreditrechners relevante Gesetze, Vorschriften und Richtlinien einhalten und ihn nicht für illegale Zwecke verwenden."
  },
  "fr": {
    "$name": "Calculateur de prêt",
    "$keywords": [
      "taux d'intérêt des prêts",
      "plans de remboursement",
      "principal du prêt",
      "valeur de majoration du taux d'intérêt",
      "taux d'intérêt annuel",
      "durée du prêt",
      "montant de remboursement mensuel",
      "intérêts totaux",
      "montant total du remboursement",
      "détails de remboursement mensuel",
      "période",
      "intérêt mensuel de remboursement",
      "principal mensuel de remboursement",
      "principal restant du prêt",
      "calcul de prêt",
      "prise de décision d'investissement",
      "éducation financière",
      "taux d'intérêt réels des prêts",
      "Taux d'intérêt des prêts",
      "Plan de remboursement",
      "Majoration LPR",
      "Méthode de remboursement",
      "Calcul de remboursement",
      "Comparaison de prêt",
      "Gestion de prêt",
      "Exportation CSV"
    ],
    "$description": "Documentation de l'outil de calcul de prêt\n\nL'outil de calcul de prêt est un outil utilisé pour calculer les taux d'intérêt et les plans de remboursement des prêts. Les utilisateurs peuvent saisir des informations telles que le capital emprunté, le dernier taux d'intérêt de référence, la majoration LPR, la durée du prêt et la méthode de remboursement. L'outil calculera automatiquement le montant mensuel de remboursement, les intérêts totaux et le montant total de remboursement, et générera un tableau de plan de remboursement. Les utilisateurs peuvent également exporter le tableau de plan de remboursement sous forme de fichier CSV.\n\nCas d'utilisation :\n\n1. Calcul de prêt : Lors de la demande d'un prêt, les utilisateurs peuvent utiliser l'outil de calcul de prêt pour calculer le montant mensuel de remboursement, les intérêts totaux et le montant total de remboursement, afin de mieux comprendre le coût du prêt et le plan de remboursement.\n\n2. Comparaison de prêt : Les utilisateurs peuvent utiliser l'outil de calcul de prêt pour comparer les plans de remboursement et les coûts de différents schémas de prêt, afin de choisir le schéma de prêt optimal.\n\n3. Gestion de prêt : Les utilisateurs peuvent utiliser l'outil de calcul de prêt pour suivre les plans de remboursement de prêt et l'état de remboursement, afin de mieux gérer leurs prêts.\n\nInstructions :\n\n1. Ouvrez la page de l'outil de calcul de prêt.\n\n2. Saisissez des informations telles que le capital emprunté, le dernier taux d'intérêt de référence, la majoration LPR, la durée du prêt et la méthode de remboursement.\n\n3. Cliquez sur le bouton \"Calculer\", et l'outil calculera automatiquement le montant mensuel de remboursement, les intérêts totaux et le montant total de remboursement, et générera un tableau de plan de remboursement.\n\n4. Les utilisateurs peuvent consulter le tableau de plan de remboursement et l'exporter sous forme de fichier CSV.\n\nNotes :\n\n1. Les informations saisies telles que le capital emprunté, le dernier taux d'intérêt de référence, la majoration LPR, la durée du prêt et la méthode de remboursement doivent être légales et valides.\n\n2. Le montant mensuel de remboursement, les intérêts totaux et le montant total de remboursement calculés par l'outil sont donnés à titre indicatif, et la situation réelle peut être différente.\n\n3. Le tableau de plan de remboursement exporté par l'utilisateur est donné à titre indicatif, et la situation réelle peut être différente.\n\n4. Les utilisateurs doivent conserver correctement le tableau de plan de remboursement et le fichier CSV exporté généré par l'outil de calcul de prêt pour éviter de divulguer des informations personnelles.\n\n5. Les utilisateurs doivent se conformer aux lois, règlements et politiques pertinents lors de l'utilisation de l'outil de calcul de prêt, et ne doivent pas l'utiliser à des fins illégales."
  },
  "it": {
    "$name": "Calcolatore di prestiti",
    "$keywords": [
      "tassi di interesse del prestito",
      "piani di rimborso",
      "capitale del prestito",
      "valore di markup del tasso di interesse",
      "tasso di interesse annuale",
      "termine del prestito",
      "importo del rimborso mensile",
      "interesse totale",
      "importo totale del rimborso",
      "dettagli del rimborso mensile",
      "periodo",
      "interesse mensile del rimborso",
      "capitale mensile del rimborso",
      "capitale residuo del prestito",
      "calcolo del prestito",
      "decisioni di investimento",
      "educazione finanziaria",
      "tassi di interesse effettivi del prestito",
      "tasso di interesse del prestito",
      "piano di rimborso",
      "markup LPR",
      "metodo di rimborso",
      "calcolo del rimborso",
      "confronto dei prestiti",
      "gestione del prestito",
      "esportazione CSV"
    ],
    "$description": "Documentazione dello Strumento Calcolatore di Prestiti\n\nLo Strumento Calcolatore di Prestiti è uno strumento utilizzato per calcolare i tassi di interesse e i piani di rimborso dei prestiti. Gli utenti possono inserire informazioni come il capitale del prestito, l'ultimo tasso di interesse di riferimento, il markup LPR, la durata del prestito e il metodo di rimborso. Lo strumento calcolerà automaticamente l'importo del rimborso mensile, gli interessi totali e l'importo totale del rimborso e genererà una tabella del piano di rimborso. Gli utenti possono anche esportare la tabella del piano di rimborso come file CSV.\n\nCasi d'uso:\n\n1. Calcolo del prestito: quando si richiede un prestito, gli utenti possono utilizzare lo Strumento Calcolatore di Prestiti per calcolare l'importo del rimborso mensile, gli interessi totali e l'importo totale del rimborso, al fine di comprendere meglio il costo del prestito e il piano di rimborso.\n\n2. Confronto dei prestiti: gli utenti possono utilizzare lo Strumento Calcolatore di Prestiti per confrontare i piani di rimborso e i costi di diversi schemi di prestito, al fine di scegliere lo schema di prestito ottimale.\n\n3. Gestione del prestito: gli utenti possono utilizzare lo Strumento Calcolatore di Prestiti per tenere traccia dei piani di rimborso del prestito e dello stato di rimborso, al fine di gestire meglio i loro prestiti.\n\nIstruzioni:\n\n1. Aprire la pagina dello Strumento Calcolatore di Prestiti.\n\n2. Inserire informazioni come il capitale del prestito, l'ultimo tasso di interesse di riferimento, il markup LPR, la durata del prestito e il metodo di rimborso.\n\n3. Fare clic sul pulsante \"Calcola\" e lo strumento calcolerà automaticamente l'importo del rimborso mensile, gli interessi totali e l'importo totale del rimborso e genererà una tabella del piano di rimborso.\n\n4. Gli utenti possono visualizzare la tabella del piano di rimborso ed esportarla come file CSV.\n\nNote:\n\n1. Le informazioni inserite come il capitale del prestito, l'ultimo tasso di interesse di riferimento, il markup LPR, la durata del prestito e il metodo di rimborso devono essere legali e valide.\n\n2. L'importo del rimborso mensile, gli interessi totali e l'importo totale del rimborso calcolati dallo strumento sono solo a scopo di riferimento e la situazione effettiva potrebbe essere diversa.\n\n3. La tabella del piano di rimborso esportata dall'utente è solo a scopo di riferimento e la situazione effettiva potrebbe essere diversa.\n\n4. Gli utenti dovrebbero conservare correttamente la tabella del piano di rimborso e il file CSV esportato generato dallo Strumento Calcolatore di Prestiti per evitare la divulgazione di informazioni personali.\n\n5. Gli utenti dovrebbero rispettare le leggi, i regolamenti e le politiche pertinenti quando utilizzano lo Strumento Calcolatore di Prestiti e non dovrebbero utilizzarlo per scopi illegali."
  },
  "ru": {
    "$name": "Калькулятор кредита",
    "$keywords": [
      "ставки по кредиту",
      "планы погашения",
      "основной кредит",
      "значение наценки процентной ставки",
      "годовая процентная ставка",
      "срок кредита",
      "ежемесячный платеж",
      "общий процент",
      "общая сумма погашения",
      "детали ежемесячного платежа",
      "период",
      "ежемесячный процент по платежу",
      "ежемесячный основной платеж",
      "оставшаяся сумма кредита",
      "расчет кредита",
      "принятие инвестиционных решений",
      "финансовое образование",
      "фактические процентные ставки по кредиту",
      "Процентная ставка по кредиту",
      "План погашения",
      "LPR наценка",
      "Метод погашения",
      "Расчет погашения",
      "Сравнение кредитов",
      "Управление кредитами",
      "Экспорт CSV"
    ],
    "$description": "Документация для инструмента \"Калькулятор кредитов\"\n\nКалькулятор кредитов - это инструмент, используемый для расчета процентных ставок по кредиту и планов погашения. Пользователи могут вводить информацию, такую как сумма кредита, последнюю базовую процентную ставку, наценку LPR, срок кредита и метод погашения. Инструмент автоматически рассчитывает ежемесячный платеж, общую сумму процентов и общую сумму погашения и генерирует таблицу плана погашения. Пользователи также могут экспортировать таблицу плана погашения в виде файла CSV.\n\nВозможности использования:\n\n1. Расчет кредита: при подаче заявки на кредит пользователи могут использовать калькулятор кредитов для расчета ежемесячного платежа, общей суммы процентов и общей суммы погашения, чтобы лучше понимать стоимость кредита и план погашения.\n\n2. Сравнение кредитов: пользователи могут использовать калькулятор кредитов для сравнения планов погашения и стоимости различных кредитных программ, чтобы выбрать оптимальную кредитную программу.\n\n3. Управление кредитами: пользователи могут использовать калькулятор кредитов для отслеживания планов погашения и статуса погашения кредита, чтобы лучше управлять своими кредитами.\n\nИнструкции:\n\n1. Откройте страницу калькулятора кредитов.\n\n2. Введите информацию, такую как сумма кредита, последнюю базовую процентную ставку, наценку LPR, срок кредита и метод погашения.\n\n3. Нажмите кнопку \"Рассчитать\", и инструмент автоматически рассчитает ежемесячный платеж, общую сумму процентов и общую сумму погашения и сгенерирует таблицу плана погашения.\n\n4. Пользователи могут просмотреть таблицу плана погашения и экспортировать ее в виде файла CSV.\n\nПримечания:\n\n1. Вводимая информация, такая как сумма кредита, последняя базовая процентная ставка, наценка LPR, срок кредита и метод погашения, должна быть законной и действительной.\n\n2. Ежемесячный платеж, общая сумма процентов и общая сумма погашения, рассчитанные инструментом, предназначены только для ознакомления, и фактическая ситуация может отличаться.\n\n3. Таблица плана погашения, экспортированная пользователем, предназначена только для ознакомления, и фактическая ситуация может отличаться.\n\n4. Пользователи должны правильно хранить таблицу плана погашения и экспортированный файл CSV, созданный калькулятором кредитов, чтобы избежать утечки личной информации.\n\n5. Пользователи должны соблюдать соответствующие законы, правила и политики при использовании калькулятора кредитов и не использовать его для незаконных целей."
  },
  "pt": {
    "$name": "Calculadora de Empréstimo",
    "$keywords": [
      "taxas de juros do empréstimo",
      "planos de pagamento",
      "principal do empréstimo",
      "valor de marcação da taxa de juros",
      "taxa de juros anual",
      "prazo do empréstimo",
      "valor mensal do pagamento",
      "juros totais",
      "valor total do pagamento",
      "detalhes mensais do pagamento",
      "período",
      "juros mensais do pagamento",
      "principal mensal do pagamento",
      "principal restante do empréstimo",
      "cálculo do empréstimo",
      "tomada de decisão de investimento",
      "educação financeira",
      "taxas de juros reais do empréstimo",
      "taxa de juros do empréstimo",
      "plano de pagamento",
      "marcação LPR",
      "método de pagamento",
      "cálculo de pagamento",
      "comparação de empréstimo",
      "gerenciamento de empréstimo",
      "exportação CSV"
    ],
    "$description": "Documentação da Ferramenta de Calculadora de Empréstimo\n\nA ferramenta de calculadora de empréstimo é uma ferramenta usada para calcular as taxas de juros e planos de pagamento de empréstimos. Os usuários podem inserir informações como o principal do empréstimo, a última taxa de juros de referência, a marcação LPR, o prazo do empréstimo e o método de pagamento. A ferramenta calculará automaticamente o valor mensal de pagamento, o total de juros e o valor total de pagamento, e gerará uma tabela de plano de pagamento. Os usuários também podem exportar a tabela de plano de pagamento como um arquivo CSV.\n\nCasos de uso:\n\n1. Cálculo de empréstimo: ao solicitar um empréstimo, os usuários podem usar a ferramenta de calculadora de empréstimo para calcular o valor mensal de pagamento, o total de juros e o valor total de pagamento, a fim de entender melhor o custo do empréstimo e o plano de pagamento.\n\n2. Comparação de empréstimo: os usuários podem usar a ferramenta de calculadora de empréstimo para comparar os planos de pagamento e custos de diferentes esquemas de empréstimo, a fim de escolher o esquema de empréstimo ideal.\n\n3. Gerenciamento de empréstimo: os usuários podem usar a ferramenta de calculadora de empréstimo para acompanhar os planos de pagamento de empréstimos e o status de pagamento, a fim de gerenciar melhor seus empréstimos.\n\nInstruções:\n\n1. Abra a página da ferramenta de calculadora de empréstimo.\n\n2. Insira informações como o principal do empréstimo, a última taxa de juros de referência, a marcação LPR, o prazo do empréstimo e o método de pagamento.\n\n3. Clique no botão \"Calcular\", e a ferramenta calculará automaticamente o valor mensal de pagamento, o total de juros e o valor total de pagamento, e gerará uma tabela de plano de pagamento.\n\n4. Os usuários podem visualizar a tabela de plano de pagamento e exportá-la como um arquivo CSV.\n\nObservações:\n\n1. As informações inseridas, como o principal do empréstimo, a última taxa de juros de referência, a marcação LPR, o prazo do empréstimo e o método de pagamento, devem ser legais e válidas.\n\n2. O valor mensal de pagamento, o total de juros e o valor total de pagamento calculados pela ferramenta são apenas para referência, e a situação real pode ser diferente.\n\n3. A tabela de plano de pagamento exportada pelo usuário é apenas para referência, e a situação real pode ser diferente.\n\n4. Os usuários devem manter adequadamente a tabela de plano de pagamento e o arquivo CSV exportado gerado pela ferramenta de calculadora de empréstimo para evitar vazamento de informações pessoais.\n\n5. Os usuários devem cumprir as leis, regulamentos e políticas relevantes ao usar a ferramenta de calculadora de empréstimo e não devem usá-la para fins ilegais."
  },
  "en": {
    "$name": "Loan Calculator",
    "$keywords": [
      "loan interest rates",
      "repayment plans",
      "loan principal",
      "interest rate markup value",
      "annual interest rate",
      "loan term",
      "monthly repayment amount",
      "total interest",
      "total repayment amount",
      "monthly repayment details",
      "period",
      "monthly repayment interest",
      "monthly repayment principal",
      "remaining loan principal",
      "loan calculation",
      "investment decision-making",
      "financial education",
      "actual loan interest rates",
      "Loan interest rate",
      "Repayment plan",
      "LPR markup",
      "Repayment method",
      "Repayment calculation",
      "Loan comparison",
      "Loan management",
      "CSV export"
    ],
    "$description": "Loan Calculator Tool Documentation\n\nThe Loan Calculator tool is a tool used to calculate loan interest rates and repayment plans. Users can input information such as loan principal, the latest benchmark interest rate, LPR markup, loan term, and repayment method. The tool will automatically calculate the monthly repayment amount, total interest, and total repayment amount, and generate a repayment plan table. Users can also export the repayment plan table as a CSV file.\n\nUse cases:\n\n1. Loan calculation: When applying for a loan, users can use the Loan Calculator tool to calculate the monthly repayment amount, total interest, and total repayment amount, in order to better understand the loan cost and repayment plan.\n\n2. Loan comparison: Users can use the Loan Calculator tool to compare the repayment plans and costs of different loan schemes, in order to choose the optimal loan scheme.\n\n3. Loan management: Users can use the Loan Calculator tool to track loan repayment plans and repayment status, in order to better manage their loans.\n\nInstructions:\n\n1. Open the Loan Calculator tool page.\n\n2. Input information such as loan principal, the latest benchmark interest rate, LPR markup, loan term, and repayment method.\n\n3. Click the \"Calculate\" button, and the tool will automatically calculate the monthly repayment amount, total interest, and total repayment amount, and generate a repayment plan table.\n\n4. Users can view the repayment plan table and export it as a CSV file.\n\nNotes:\n\n1. The input information such as loan principal, the latest benchmark interest rate, LPR markup, loan term, and repayment method must be legal and valid.\n\n2. The monthly repayment amount, total interest, and total repayment amount calculated by the tool are for reference only, and the actual situation may be different.\n\n3. The repayment plan table exported by the user is for reference only, and the actual situation may be different.\n\n4. Users should properly keep the repayment plan table and exported CSV file generated by the Loan Calculator tool to avoid leaking personal information.\n\n5. Users should comply with relevant laws, regulations, and policies when using the Loan Calculator tool, and should not use it for illegal purposes."
  }
}