{
  "zh-cn": {
    "$name": "倒计时",
    "$keywords": [
      "倒计时",
      "计时器",
      "时间",
      "时间管理",
      "任务管理",
      "多语言支持",
      "控制倒计时"
    ],
    "$description": "倒计时工具用户指南\n\n倒计时工具是基于Vue.js和Ant Design Vue的倒计时工具。它可以用于设置多个倒计时并对其进行控制和管理。\n\n特点：\n\n1. 添加倒计时：您可以单击“添加倒计时”按钮，在弹出的对话框中设置倒计时的名称和持续时间。\n\n2. 编辑倒计时：您可以单击倒计时项目后面的“编辑”按钮来修改倒计时的名称、持续时间和通知开关。\n\n3. 删除倒计时：您可以单击倒计时项目后面的“删除”按钮来删除相应的倒计时。\n\n4. 控制倒计时：您可以启动、暂停、恢复和重置单个倒计时，或统一控制所有倒计时。\n\n5. 多语言支持：支持多种语言，并可以根据用户的语言环境自动切换语言。\n\n使用场景：\n\n1. 倒计时管理：可用于管理多个倒计时，如会议倒计时、考试倒计时等。\n\n2. 时间管理：可用于管理个人时间，如设置倒计时提醒自己每天锻炼的时间。\n\n3. 任务管理：可用于管理任务的时间，如设置倒计时提醒自己完成任务的时间。\n\n说明：\n\n1. 打开倒计时工具页面。\n\n2. 单击“添加倒计时”按钮，在弹出的对话框中设置倒计时的名称和持续时间。\n\n3. 单击倒计时项目后面的“编辑”按钮来修改倒计时的名称、持续时间和通知开关。\n\n4. 单击倒计时项目后面的“删除”按钮来删除相应的倒计时。\n\n5. 单击倒计时项目后面的“启动”按钮来启动相应的倒计时。\n\n6. 单击倒计时项目后面的“暂停”按钮来暂停相应的倒计时。\n\n7. 单击倒计时项目后面的“恢复”按钮来恢复相应的倒计时。\n\n8. 单击倒计时项目后面的“重置”按钮来重置相应的倒计时。\n\n9. 单击“全部启动”按钮来启动所有倒计时。\n\n10. 单击“全部暂停”按钮来暂停所有倒计时。\n\n11. 单击“全部恢复”按钮来恢复所有倒计时。\n\n12. 单击“全部重置”按钮来重置所有倒计时。\n\n注意事项：\n\n1. 持续时间单位为小时、分钟和秒，最大持续时间为23小时59分钟59秒。\n\n2. 通知开关默认关闭，需要手动打开。\n\n3. 启动、暂停、恢复和重置操作仅影响单个倒计时，不会影响其他倒计时。\n\n4. 启动、暂停、恢复和重置所有倒计时的操作将影响所有倒计时，应谨慎使用。\n\n5. 删除的倒计时无法恢复，请谨慎使用。\n\n6. 此工具仅供个人使用，不得用于商业用途。"
  },
  "zh-tw": {
    "$name": "倒數計時器",
    "$keywords": [
      "倒數計時",
      "計時器",
      "時間",
      "時間管理",
      "任務管理",
      "多語言支援",
      "控制倒數計時"
    ],
    "$description": "倒數計時工具使用指南\n\n倒數計時工具是一個基於Vue.js和Ant Design Vue的倒數計時工具。它可以用於設置多個倒數計時並對其進行控制和管理。\n\n功能：\n\n1. 添加倒數計時：您可以點擊“添加倒數計時”按鈕，在彈出的對話框中設置倒數計時的名稱和持續時間。\n\n2. 編輯倒數計時：您可以點擊倒數計時項目後面的“編輯”按鈕，修改倒數計時的名稱、持續時間和通知開關。\n\n3. 刪除倒數計時：您可以點擊倒數計時項目後面的“刪除”按鈕，刪除相應的倒數計時。\n\n4. 控制倒數計時：您可以啟動、暫停、恢復和重置單個倒數計時，或統一控制所有倒數計時。\n\n5. 多語言支持：支持多種語言，可以根據用戶的語言環境自動切換語言。\n\n使用場景：\n\n1. 倒數計時管理：可用於管理多個倒數計時，如會議倒數計時、考試倒數計時等。\n\n2. 時間管理：可用於管理個人時間，如設置倒數計時提醒自己每天運動的時間。\n\n3. 任務管理：可用於管理任務時間，如設置倒數計時提醒自己完成任務的時間。\n\n使用說明：\n\n1. 打開倒數計時工具頁面。\n\n2. 點擊“添加倒數計時”按鈕，在彈出的對話框中設置倒數計時的名稱和持續時間。\n\n3. 點擊倒數計時項目後面的“編輯”按鈕，修改倒數計時的名稱、持續時間和通知開關。\n\n4. 點擊倒數計時項目後面的“刪除”按鈕，刪除相應的倒數計時。\n\n5. 點擊倒數計時項目後面的“啟動”按鈕，啟動相應的倒數計時。\n\n6. 點擊倒數計時項目後面的“暫停”按鈕，暫停相應的倒數計時。\n\n7. 點擊倒數計時項目後面的“恢復”按鈕，恢復相應的倒數計時。\n\n8. 點擊倒數計時項目後面的“重置”按鈕，重置相應的倒數計時。\n\n9. 點擊“全部啟動”按鈕，啟動所有倒數計時。\n\n10. 點擊“全部暫停”按鈕，暫停所有倒數計時。\n\n11. 點擊“全部恢復”按鈕，恢復所有倒數計時。\n\n12. 點擊“全部重置”按鈕，重置所有倒數計時。\n\n注意事項：\n\n1. 持續時間的單位是小時、分鐘和秒，最大持續時間為23小時59分59秒。\n\n2. 通知開關默認為關閉狀態，需要手動打開。\n\n3. 啟動、暫停、恢復和重置操作僅影響單個倒數計時，不會影響其他倒數計時。\n\n4. 啟動、暫停、恢復和重置所有倒數計時的操作將影響所有倒數計時，應謹慎使用。\n\n5. 刪除的倒數計時無法恢復，請謹慎使用。\n\n6. 本工具僅供個人使用，不得用於商業用途。"
  },
  "es": {
    "$name": "Cuenta regresiva",
    "$keywords": [
      "cuenta regresiva",
      "temporizadores",
      "tiempo",
      "gestión del tiempo",
      "gestión de tareas",
      "soporte multilingüe",
      "control de cuenta regresiva"
    ],
    "$description": "Guía del usuario de la herramienta de cuenta regresiva\n\nLa herramienta de cuenta regresiva es una herramienta de cuenta regresiva basada en Vue.js y Ant Design Vue. Se puede utilizar para establecer múltiples cuentas regresivas y controlarlas y administrarlas.\n\nCaracterísticas:\n\n1. Agregar cuenta regresiva: Puede hacer clic en el botón \"Agregar cuenta regresiva\" y establecer el nombre y la duración de la cuenta regresiva en el cuadro de diálogo emergente.\n\n2. Editar cuenta regresiva: Puede hacer clic en el botón \"Editar\" detrás del elemento de cuenta regresiva para modificar el nombre, la duración y el interruptor de notificación de la cuenta regresiva.\n\n3. Eliminar cuenta regresiva: Puede hacer clic en el botón \"Eliminar\" detrás del elemento de cuenta regresiva para eliminar la cuenta regresiva correspondiente.\n\n4. Controlar cuenta regresiva: Puede iniciar, pausar, reanudar y reiniciar una sola cuenta regresiva, o controlar todas las cuentas regresivas de manera uniforme.\n\n5. Soporte multilingüe: Admite varios idiomas y puede cambiar automáticamente de idioma según el entorno de idioma del usuario.\n\nEscenarios de uso:\n\n1. Gestión de cuenta regresiva: Se puede utilizar para gestionar múltiples cuentas regresivas, como cuentas regresivas de reuniones, cuentas regresivas de exámenes, etc.\n\n2. Gestión del tiempo: Se puede utilizar para gestionar el tiempo personal, como establecer una cuenta regresiva para recordarle el momento de hacer ejercicio todos los días.\n\n3. Gestión de tareas: Se puede utilizar para gestionar el tiempo de las tareas, como establecer una cuenta regresiva para recordarle el momento de completar una tarea.\n\nInstrucciones:\n\n1. Abra la página de la herramienta de cuenta regresiva.\n\n2. Haga clic en el botón \"Agregar cuenta regresiva\" y establezca el nombre y la duración de la cuenta regresiva en el cuadro de diálogo emergente.\n\n3. Haga clic en el botón \"Editar\" detrás del elemento de cuenta regresiva para modificar el nombre, la duración y el interruptor de notificación de la cuenta regresiva.\n\n4. Haga clic en el botón \"Eliminar\" detrás del elemento de cuenta regresiva para eliminar la cuenta regresiva correspondiente.\n\n5. Haga clic en el botón \"Iniciar\" detrás del elemento de cuenta regresiva para iniciar la cuenta regresiva correspondiente.\n\n6. Haga clic en el botón \"Pausar\" detrás del elemento de cuenta regresiva para pausar la cuenta regresiva correspondiente.\n\n7. Haga clic en el botón \"Reanudar\" detrás del elemento de cuenta regresiva para reanudar la cuenta regresiva correspondiente.\n\n8. Haga clic en el botón \"Reiniciar\" detrás del elemento de cuenta regresiva para reiniciar la cuenta regresiva correspondiente.\n\n9. Haga clic en el botón \"Iniciar todo\" para iniciar todas las cuentas regresivas.\n\n10. Haga clic en el botón \"Pausar todo\" para pausar todas las cuentas regresivas.\n\n11. Haga clic en el botón \"Reanudar todo\" para reanudar todas las cuentas regresivas.\n\n12. Haga clic en el botón \"Reiniciar todo\" para reiniciar todas las cuentas regresivas.\n\nNotas:\n\n1. La unidad de duración es horas, minutos y segundos, y la duración máxima es de 23 horas 59 minutos 59 segundos.\n\n2. El interruptor de notificación está apagado de forma predeterminada y debe activarse manualmente.\n\n3. Las operaciones de inicio, pausa, reanudación y reinicio solo afectan a una sola cuenta regresiva y no afectarán a otras cuentas regresivas.\n\n4. Las operaciones de inicio, pausa, reanudación y reinicio para todas las cuentas regresivas afectarán a todas las cuentas regresivas y deben usarse con precaución.\n\n5. Las cuentas regresivas eliminadas no se pueden recuperar, así que utilícelas con precaución.\n\n6. Esta herramienta es solo para uso personal y no se puede utilizar con fines comerciales."
  },
  "ja": {
    "$name": "カウントダウン",
    "$keywords": [
      "カウントダウン",
      "タイマー",
      "時間",
      "時間管理",
      "タスク管理",
      "多言語対応",
      "カウントダウンの制御"
    ],
    "$description": "カウントダウンツールのユーザーガイド\n\nカウントダウンツールは、Vue.jsとAnt Design Vueをベースにしたカウントダウンツールです。複数のカウントダウンを設定し、制御および管理することができます。\n\n特徴：\n\n1. カウントダウンの追加：「カウントダウンの追加」ボタンをクリックし、ポップアップダイアログボックスでカウントダウンの名前と期間を設定できます。\n\n2. カウントダウンの編集：カウントダウン項目の「編集」ボタンをクリックして、カウントダウンの名前、期間、および通知スイッチを変更できます。\n\n3. カウントダウンの削除：カウントダウン項目の「削除」ボタンをクリックして、対応するカウントダウンを削除できます。\n\n4. カウントダウンの制御：単一のカウントダウンを開始、一時停止、再開、リセットすることができます。また、すべてのカウントダウンを一元的に制御することもできます。\n\n5. 多言語対応：複数の言語をサポートし、ユーザーの言語環境に基づいて自動的に言語を切り替えることができます。\n\n使用シナリオ：\n\n1. カウントダウンの管理：会議のカウントダウン、試験のカウントダウンなど、複数のカウントダウンを管理するために使用できます。\n\n2. 時間管理：毎日の運動の時間を思い出すためにカウントダウンを設定するなど、個人の時間を管理するために使用できます。\n\n3. タスク管理：タスクの時間を管理するために、タスク完了の時間を思い出すためにカウントダウンを設定するなど、使用できます。\n\n手順：\n\n1. カウントダウンツールページを開きます。\n\n2. 「カウントダウンの追加」ボタンをクリックし、ポップアップダイアログボックスでカウントダウンの名前と期間を設定します。\n\n3. カウントダウン項目の「編集」ボタンをクリックして、カウントダウンの名前、期間、および通知スイッチを変更します。\n\n4. カウントダウン項目の「削除」ボタンをクリックして、対応するカウントダウンを削除します。\n\n5. カウントダウン項目の「開始」ボタンをクリックして、対応するカウントダウンを開始します。\n\n6. カウントダウン項目の「一時停止」ボタンをクリックして、対応するカウントダウンを一時停止します。\n\n7. カウントダウン項目の「再開」ボタンをクリックして、対応するカウントダウンを再開します。\n\n8. カウントダウン項目の「リセット」ボタンをクリックして、対応するカウントダウンをリセットします。\n\n9. 「すべて開始」ボタンをクリックして、すべてのカウントダウンを開始します。\n\n10. 「すべて一時停止」ボタンをクリックして、すべてのカウントダウンを一時停止します。\n\n11. 「すべて再開」ボタンをクリックして、すべてのカウントダウンを再開します。\n\n12. 「すべてリセット」ボタンをクリックして、すべてのカウントダウンをリセットします。\n\n注意事項：\n\n1. 期間の単位は時間、分、秒であり、最大期間は23時間59分59秒です。\n\n2. 通知スイッチはデフォルトでオフになっており、手動でオンにする必要があります。\n\n3. 開始、一時停止、再開、リセットの操作は単一のカウントダウンにのみ影響し、他のカウントダウンには影響しません。\n\n4. すべてのカウントダウンの開始、一時停止、再開、リセットの操作はすべてのカウントダウンに影響し、注意して使用する必要があります。\n\n5. 削除されたカウントダウンは復元できないため、注意してください。\n\n6. このツールは個人使用のみであり、商業目的には使用できません。"
  },
  "ko": {
    "$name": "카운트다운",
    "$keywords": [
      "카운트다운",
      "타이머",
      "시간",
      "시간 관리",
      "작업 관리",
      "다국어 지원",
      "카운트다운 제어"
    ],
    "$description": "카운트다운 도구 사용자 가이드\n\n카운트다운 도구는 Vue.js와 Ant Design Vue를 기반으로 한 카운트다운 도구입니다. 여러 개의 카운트다운을 설정하고 제어하고 관리할 수 있습니다.\n\n기능:\n\n1. 카운트다운 추가: \"카운트다운 추가\" 버튼을 클릭하고 팝업 대화 상자에서 카운트다운의 이름과 지속 시간을 설정할 수 있습니다.\n\n2. 카운트다운 수정: 카운트다운 항목 뒤에 있는 \"편집\" 버튼을 클릭하여 카운트다운의 이름, 지속 시간 및 알림 스위치를 수정할 수 있습니다.\n\n3. 카운트다운 삭제: 카운트다운 항목 뒤에 있는 \"삭제\" 버튼을 클릭하여 해당 카운트다운을 삭제할 수 있습니다.\n\n4. 카운트다운 제어: 단일 카운트다운을 시작, 일시 중지, 재개 및 재설정하거나 모든 카운트다운을 균일하게 제어할 수 있습니다.\n\n5. 다국어 지원: 다국어를 지원하며 사용자의 언어 환경에 따라 자동으로 언어를 전환할 수 있습니다.\n\n사용 시나리오:\n\n1. 카운트다운 관리: 회의 카운트다운, 시험 카운트다운 등과 같이 여러 개의 카운트다운을 관리하는 데 사용할 수 있습니다.\n\n2. 시간 관리: 매일 운동할 시간을 상기시키기 위해 카운트다운을 설정하는 등 개인 시간을 관리하는 데 사용할 수 있습니다.\n\n3. 작업 관리: 작업 시간을 관리하기 위해 작업 완료 시간을 상기시키는 카운트다운을 설정하는 등 작업 시간을 관리하는 데 사용할 수 있습니다.\n\n사용 방법:\n\n1. 카운트다운 도구 페이지를 엽니다.\n\n2. \"카운트다운 추가\" 버튼을 클릭하고 팝업 대화 상자에서 카운트다운의 이름과 지속 시간을 설정합니다.\n\n3. 카운트다운 항목 뒤에 있는 \"편집\" 버튼을 클릭하여 카운트다운의 이름, 지속 시간 및 알림 스위치를 수정합니다.\n\n4. 카운트다운 항목 뒤에 있는 \"삭제\" 버튼을 클릭하여 해당 카운트다운을 삭제합니다.\n\n5. 카운트다운 항목 뒤에 있는 \"시작\" 버튼을 클릭하여 해당 카운트다운을 시작합니다.\n\n6. 카운트다운 항목 뒤에 있는 \"일시 중지\" 버튼을 클릭하여 해당 카운트다운을 일시 중지합니다.\n\n7. 카운트다운 항목 뒤에 있는 \"재개\" 버튼을 클릭하여 해당 카운트다운을 재개합니다.\n\n8. 카운트다운 항목 뒤에 있는 \"재설정\" 버튼을 클릭하여 해당 카운트다운을 재설정합니다.\n\n9. \"모두 시작\" 버튼을 클릭하여 모든 카운트다운을 시작합니다.\n\n10. \"모두 일시 중지\" 버튼을 클릭하여 모든 카운트다운을 일시 중지합니다.\n\n11. \"모두 재개\" 버튼을 클릭하여 모든 카운트다운을 재개합니다.\n\n12. \"모두 재설정\" 버튼을 클릭하여 모든 카운트다운을 재설정합니다.\n\n참고 사항:\n\n1. 지속 시간 단위는 시간, 분 및 초이며 최대 지속 시간은 23시간 59분 59초입니다.\n\n2. 알림 스위치는 기본적으로 꺼져 있으며 수동으로 켜야 합니다.\n\n3. 시작, 일시 중지, 재개 및 재설정 작업은 단일 카운트다운에만 영향을 미치며 다른 카운트다운에는 영향을 미치지 않습니다.\n\n4. 모든 카운트다운에 대한 시작, 일시 중지, 재개 및 재설정 작업은 모든 카운트다운에 영향을 미치며 신중하게 사용해야 합니다.\n\n5. 삭제된 카운트다운은 복구할 수 없으므로 주의해서 사용하십시오.\n\n6. 이 도구는 개인용으로만 사용할 수 있으며 상업적 용도로 사용할 수 없습니다."
  },
  "de": {
    "$name": "Countdown",
    "$keywords": [
      "Countdown",
      "Timer",
      "Zeit",
      "Zeitmanagement",
      "Aufgabenmanagement",
      "Mehrsprachige Unterstützung",
      "Countdown steuern"
    ],
    "$description": "Countdown-Tool Benutzerhandbuch\n\nDas Countdown-Tool ist ein Countdown-Tool, das auf Vue.js und Ant Design Vue basiert. Es kann verwendet werden, um mehrere Countdowns einzustellen und zu steuern und zu verwalten.\n\nFunktionen:\n\n1. Countdown hinzufügen: Sie können auf die Schaltfläche \"Countdown hinzufügen\" klicken und in dem Popup-Dialogfeld den Namen und die Dauer des Countdowns festlegen.\n\n2. Countdown bearbeiten: Sie können auf die Schaltfläche \"Bearbeiten\" hinter dem Countdown-Element klicken, um den Namen, die Dauer und den Benachrichtigungsschalter des Countdowns zu ändern.\n\n3. Countdown löschen: Sie können auf die Schaltfläche \"Löschen\" hinter dem Countdown-Element klicken, um den entsprechenden Countdown zu löschen.\n\n4. Countdown steuern: Sie können einen einzelnen Countdown starten, pausieren, fortsetzen und zurücksetzen oder alle Countdowns einheitlich steuern.\n\n5. Mehrsprachige Unterstützung: Unterstützt mehrere Sprachen und kann automatisch Sprachen basierend auf der Sprachumgebung des Benutzers wechseln.\n\nAnwendungsszenarien:\n\n1. Countdown-Management: Kann verwendet werden, um mehrere Countdowns zu verwalten, wie z.B. Meeting-Countdowns, Prüfungs-Countdowns usw.\n\n2. Zeitmanagement: Kann verwendet werden, um die persönliche Zeit zu verwalten, z.B. indem man einen Countdown einstellt, um sich täglich an die Zeit zum Trainieren zu erinnern.\n\n3. Aufgabenmanagement: Kann verwendet werden, um die Zeit von Aufgaben zu verwalten, z.B. indem man einen Countdown einstellt, um sich an die Zeit zum Abschließen einer Aufgabe zu erinnern.\n\nAnweisungen:\n\n1. Öffnen Sie die Countdown-Tool-Seite.\n\n2. Klicken Sie auf die Schaltfläche \"Countdown hinzufügen\" und legen Sie in dem Popup-Dialogfeld den Namen und die Dauer des Countdowns fest.\n\n3. Klicken Sie auf die Schaltfläche \"Bearbeiten\" hinter dem Countdown-Element, um den Namen, die Dauer und den Benachrichtigungsschalter des Countdowns zu ändern.\n\n4. Klicken Sie auf die Schaltfläche \"Löschen\" hinter dem Countdown-Element, um den entsprechenden Countdown zu löschen.\n\n5. Klicken Sie auf die Schaltfläche \"Start\" hinter dem Countdown-Element, um den entsprechenden Countdown zu starten.\n\n6. Klicken Sie auf die Schaltfläche \"Pause\" hinter dem Countdown-Element, um den entsprechenden Countdown zu pausieren.\n\n7. Klicken Sie auf die Schaltfläche \"Fortsetzen\" hinter dem Countdown-Element, um den entsprechenden Countdown fortzusetzen.\n\n8. Klicken Sie auf die Schaltfläche \"Zurücksetzen\" hinter dem Countdown-Element, um den entsprechenden Countdown zurückzusetzen.\n\n9. Klicken Sie auf die Schaltfläche \"Alle starten\", um alle Countdowns zu starten.\n\n10. Klicken Sie auf die Schaltfläche \"Alle pausieren\", um alle Countdowns zu pausieren.\n\n11. Klicken Sie auf die Schaltfläche \"Alle fortsetzen\", um alle Countdowns fortzusetzen.\n\n12. Klicken Sie auf die Schaltfläche \"Alle zurücksetzen\", um alle Countdowns zurückzusetzen.\n\nHinweise:\n\n1. Die Dauereinheit ist Stunden, Minuten und Sekunden, und die maximale Dauer beträgt 23 Stunden 59 Minuten 59 Sekunden.\n\n2. Der Benachrichtigungsschalter ist standardmäßig ausgeschaltet und muss manuell eingeschaltet werden.\n\n3. Die Start-, Pause-, Fortsetzen- und Zurücksetzen-Operationen betreffen nur einen einzelnen Countdown und beeinflussen keine anderen Countdowns.\n\n4. Die Start-, Pause-, Fortsetzen- und Zurücksetzen-Operationen für alle Countdowns betreffen alle Countdowns und sollten mit Vorsicht verwendet werden.\n\n5. Gelöschte Countdowns können nicht wiederhergestellt werden, daher bitte vorsichtig verwenden.\n\n6. Dieses Tool ist nur für den persönlichen Gebrauch bestimmt und darf nicht für kommerzielle Zwecke verwendet werden."
  },
  "fr": {
    "$name": "Compte à rebours",
    "$keywords": [
      "compte à rebours",
      "minuteries",
      "temps",
      "gestion du temps",
      "gestion des tâches",
      "prise en charge de plusieurs langues",
      "contrôle du compte à rebours"
    ],
    "$description": "Guide de l'utilisateur de l'outil de compte à rebours\n\nL'outil de compte à rebours est un outil de compte à rebours basé sur Vue.js et Ant Design Vue. Il peut être utilisé pour définir plusieurs comptes à rebours et les contrôler et les gérer.\n\nFonctionnalités :\n\n1. Ajouter un compte à rebours : Vous pouvez cliquer sur le bouton \"Ajouter un compte à rebours\" et définir le nom et la durée du compte à rebours dans la boîte de dialogue qui s'affiche.\n\n2. Modifier un compte à rebours : Vous pouvez cliquer sur le bouton \"Modifier\" derrière l'élément du compte à rebours pour modifier le nom, la durée et l'interrupteur de notification du compte à rebours.\n\n3. Supprimer un compte à rebours : Vous pouvez cliquer sur le bouton \"Supprimer\" derrière l'élément du compte à rebours pour supprimer le compte à rebours correspondant.\n\n4. Contrôler un compte à rebours : Vous pouvez démarrer, mettre en pause, reprendre et réinitialiser un seul compte à rebours, ou contrôler tous les comptes à rebours uniformément.\n\n5. Support multilingue : prend en charge plusieurs langues et peut automatiquement basculer les langues en fonction de l'environnement linguistique de l'utilisateur.\n\nScénarios d'utilisation :\n\n1. Gestion des comptes à rebours : peut être utilisé pour gérer plusieurs comptes à rebours, tels que les comptes à rebours de réunion, les comptes à rebours d'examen, etc.\n\n2. Gestion du temps : peut être utilisé pour gérer le temps personnel, comme définir un compte à rebours pour vous rappeler l'heure de faire de l'exercice tous les jours.\n\n3. Gestion des tâches : peut être utilisé pour gérer le temps des tâches, comme définir un compte à rebours pour vous rappeler l'heure de terminer une tâche.\n\nInstructions :\n\n1. Ouvrez la page de l'outil de compte à rebours.\n\n2. Cliquez sur le bouton \"Ajouter un compte à rebours\" et définissez le nom et la durée du compte à rebours dans la boîte de dialogue qui s'affiche.\n\n3. Cliquez sur le bouton \"Modifier\" derrière l'élément du compte à rebours pour modifier le nom, la durée et l'interrupteur de notification du compte à rebours.\n\n4. Cliquez sur le bouton \"Supprimer\" derrière l'élément du compte à rebours pour supprimer le compte à rebours correspondant.\n\n5. Cliquez sur le bouton \"Démarrer\" derrière l'élément du compte à rebours pour démarrer le compte à rebours correspondant.\n\n6. Cliquez sur le bouton \"Mettre en pause\" derrière l'élément du compte à rebours pour mettre en pause le compte à rebours correspondant.\n\n7. Cliquez sur le bouton \"Reprendre\" derrière l'élément du compte à rebours pour reprendre le compte à rebours correspondant.\n\n8. Cliquez sur le bouton \"Réinitialiser\" derrière l'élément du compte à rebours pour réinitialiser le compte à rebours correspondant.\n\n9. Cliquez sur le bouton \"Démarrer tous\" pour démarrer tous les comptes à rebours.\n\n10. Cliquez sur le bouton \"Mettre en pause tous\" pour mettre en pause tous les comptes à rebours.\n\n11. Cliquez sur le bouton \"Reprendre tous\" pour reprendre tous les comptes à rebours.\n\n12. Cliquez sur le bouton \"Réinitialiser tous\" pour réinitialiser tous les comptes à rebours.\n\nNotes :\n\n1. L'unité de durée est les heures, les minutes et les secondes, et la durée maximale est de 23 heures 59 minutes 59 secondes.\n\n2. L'interrupteur de notification est désactivé par défaut et doit être activé manuellement.\n\n3. Les opérations de démarrage, de mise en pause, de reprise et de réinitialisation n'affectent qu'un seul compte à rebours et n'affecteront pas les autres comptes à rebours.\n\n4. Les opérations de démarrage, de mise en pause, de reprise et de réinitialisation pour tous les comptes à rebours affecteront tous les comptes à rebours et doivent être utilisées avec prudence.\n\n5. Les comptes à rebours supprimés ne peuvent pas être récupérés, veuillez donc faire preuve de prudence.\n\n6. Cet outil est destiné à un usage personnel uniquement et ne peut pas être utilisé à des fins commerciales."
  },
  "it": {
    "$name": "Conto alla rovescia",
    "$keywords": [
      "countdown",
      "timer",
      "tempo",
      "gestione del tempo",
      "gestione dei compiti",
      "supporto multi-lingua",
      "controllo del conto alla rovescia"
    ],
    "$description": "Guida per l'utente dello Strumento di Conto alla Rovescia\n\nLo Strumento di Conto alla Rovescia è uno strumento di conto alla rovescia basato su Vue.js e Ant Design Vue. Può essere utilizzato per impostare e gestire più conti alla rovescia.\n\nCaratteristiche:\n\n1. Aggiungi Conto alla Rovescia: puoi cliccare sul pulsante \"Aggiungi Conto alla Rovescia\" e impostare il nome e la durata del conto alla rovescia nella finestra di dialogo che appare.\n\n2. Modifica Conto alla Rovescia: puoi cliccare sul pulsante \"Modifica\" dietro l'elemento del conto alla rovescia per modificare il nome, la durata e l'interruttore di notifica del conto alla rovescia.\n\n3. Elimina Conto alla Rovescia: puoi cliccare sul pulsante \"Elimina\" dietro l'elemento del conto alla rovescia per eliminare il conto alla rovescia corrispondente.\n\n4. Controllo Conto alla Rovescia: puoi avviare, mettere in pausa, riprendere e ripristinare un singolo conto alla rovescia o controllare uniformemente tutti i conti alla rovescia.\n\n5. Supporto multilingue: supporta più lingue e può passare automaticamente alla lingua dell'utente in base all'ambiente linguistico.\n\nScenari d'uso:\n\n1. Gestione dei Conti alla Rovescia: può essere utilizzato per gestire più conti alla rovescia, come conti alla rovescia per riunioni, esami, ecc.\n\n2. Gestione del Tempo: può essere utilizzato per gestire il tempo personale, come impostare un conto alla rovescia per ricordarsi di fare esercizio ogni giorno.\n\n3. Gestione delle Attività: può essere utilizzato per gestire il tempo delle attività, come impostare un conto alla rovescia per ricordarsi di completare un'attività.\n\nIstruzioni:\n\n1. Apri la pagina dello Strumento di Conto alla Rovescia.\n\n2. Clicca sul pulsante \"Aggiungi Conto alla Rovescia\" e imposta il nome e la durata del conto alla rovescia nella finestra di dialogo che appare.\n\n3. Clicca sul pulsante \"Modifica\" dietro l'elemento del conto alla rovescia per modificare il nome, la durata e l'interruttore di notifica del conto alla rovescia.\n\n4. Clicca sul pulsante \"Elimina\" dietro l'elemento del conto alla rovescia per eliminare il conto alla rovescia corrispondente.\n\n5. Clicca sul pulsante \"Avvia\" dietro l'elemento del conto alla rovescia per avviare il conto alla rovescia corrispondente.\n\n6. Clicca sul pulsante \"Metti in pausa\" dietro l'elemento del conto alla rovescia per mettere in pausa il conto alla rovescia corrispondente.\n\n7. Clicca sul pulsante \"Riprendi\" dietro l'elemento del conto alla rovescia per riprendere il conto alla rovescia corrispondente.\n\n8. Clicca sul pulsante \"Ripristina\" dietro l'elemento del conto alla rovescia per ripristinare il conto alla rovescia corrispondente.\n\n9. Clicca sul pulsante \"Avvia tutti\" per avviare tutti i conti alla rovescia.\n\n10. Clicca sul pulsante \"Metti in pausa tutti\" per mettere in pausa tutti i conti alla rovescia.\n\n11. Clicca sul pulsante \"Riprendi tutti\" per riprendere tutti i conti alla rovescia.\n\n12. Clicca sul pulsante \"Ripristina tutti\" per ripristinare tutti i conti alla rovescia.\n\nNote:\n\n1. L'unità di durata è ore, minuti e secondi e la durata massima è di 23 ore 59 minuti 59 secondi.\n\n2. L'interruttore di notifica è disattivato per impostazione predefinita e deve essere attivato manualmente.\n\n3. Le operazioni di avvio, pausa, ripresa e ripristino riguardano solo un singolo conto alla rovescia e non influiscono sugli altri conti alla rovescia.\n\n4. Le operazioni di avvio, pausa, ripresa e ripristino per tutti i conti alla rovescia influiscono su tutti i conti alla rovescia e devono essere utilizzate con cautela.\n\n5. I conti alla rovescia eliminati non possono essere recuperati, quindi si prega di fare attenzione.\n\n6. Questo strumento è solo per uso personale e non può essere utilizzato per scopi commerciali."
  },
  "ru": {
    "$name": "Обратный отсчет",
    "$keywords": [
      "обратный отсчет",
      "таймеры",
      "время",
      "управление временем",
      "управление задачами",
      "поддержка нескольких языков",
      "управление обратным отсчетом"
    ],
    "$description": "Руководство пользователя для инструмента обратного отсчета\n\nИнструмент обратного отсчета - это инструмент обратного отсчета на основе Vue.js и Ant Design Vue. Он может использоваться для установки нескольких обратных отсчетов и их управления.\n\nОсобенности:\n\n1. Добавление обратного отсчета: Вы можете нажать кнопку \"Добавить обратный отсчет\" и установить имя и продолжительность обратного отсчета во всплывающем диалоговом окне.\n\n2. Редактирование обратного отсчета: Вы можете нажать кнопку \"Редактировать\" за элементом обратного отсчета, чтобы изменить имя, продолжительность и переключатель уведомлений обратного отсчета.\n\n3. Удаление обратного отсчета: Вы можете нажать кнопку \"Удалить\" за элементом обратного отсчета, чтобы удалить соответствующий обратный отсчет.\n\n4. Управление обратным отсчетом: Вы можете запустить, приостановить, возобновить и сбросить один отдельный обратный отсчет или управлять всеми обратными отсчетами единообразно.\n\n5. Поддержка многих языков: Поддерживает несколько языков и может автоматически переключаться на язык пользователя в зависимости от языковой среды.\n\nСценарии использования:\n\n1. Управление обратным отсчетом: Может использоваться для управления несколькими обратными отсчетами, такими как обратные отсчеты встреч, экзаменов и т.д.\n\n2. Управление временем: Может использоваться для управления личным временем, например, установки обратного отсчета, чтобы напомнить себе время для занятий спортом каждый день.\n\n3. Управление задачами: Может использоваться для управления временем задач, например, установки обратного отсчета, чтобы напомнить себе время для выполнения задачи.\n\nИнструкции:\n\n1. Откройте страницу инструмента обратного отсчета.\n\n2. Нажмите кнопку \"Добавить обратный отсчет\" и установите имя и продолжительность обратного отсчета во всплывающем диалоговом окне.\n\n3. Нажмите кнопку \"Редактировать\" за элементом обратного отсчета, чтобы изменить имя, продолжительность и переключатель уведомлений обратного отсчета.\n\n4. Нажмите кнопку \"Удалить\" за элементом обратного отсчета, чтобы удалить соответствующий обратный отсчет.\n\n5. Нажмите кнопку \"Запустить\" за элементом обратного отсчета, чтобы запустить соответствующий обратный отсчет.\n\n6. Нажмите кнопку \"Приостановить\" за элементом обратного отсчета, чтобы приостановить соответствующий обратный отсчет.\n\n7. Нажмите кнопку \"Возобновить\" за элементом обратного отсчета, чтобы возобновить соответствующий обратный отсчет.\n\n8. Нажмите кнопку \"Сбросить\" за элементом обратного отсчета, чтобы сбросить соответствующий обратный отсчет.\n\n9. Нажмите кнопку \"Запустить все\", чтобы запустить все обратные отсчеты.\n\n10. Нажмите кнопку \"Приостановить все\", чтобы приостановить все обратные отсчеты.\n\n11. Нажмите кнопку \"Возобновить все\", чтобы возобновить все обратные отсчеты.\n\n12. Нажмите кнопку \"Сбросить все\", чтобы сбросить все обратные отсчеты.\n\nПримечания:\n\n1. Единицей продолжительности являются часы, минуты и секунды, а максимальная продолжительность составляет 23 часа 59 минут 59 секунд.\n\n2. Переключатель уведомлений по умолчанию выключен и должен быть включен вручную.\n\n3. Операции запуска, приостановки, возобновления и сброса влияют только на один отдельный обратный отсчет и не будут влиять на другие обратные отсчеты.\n\n4. Операции запуска, приостановки, возобновления и сброса для всех обратных отсчетов будут влиять на все обратные отсчеты и должны использоваться с осторожностью.\n\n5. Удаленные обратные отсчеты не могут быть восстановлены, поэтому используйте осторожно.\n\n6. Этот инструмент предназначен только для личного использования и не может использоваться в коммерческих целях."
  },
  "pt": {
    "$name": "Contagem regressiva",
    "$keywords": [
      "contagem regressiva",
      "cronômetros",
      "tempo",
      "gerenciamento de tempo",
      "gerenciamento de tarefas",
      "suporte a vários idiomas",
      "controle de contagem regressiva"
    ],
    "$description": "Guia do Usuário da Ferramenta de Contagem Regressiva\n\nA Ferramenta de Contagem Regressiva é uma ferramenta de contagem regressiva baseada em Vue.js e Ant Design Vue. Ela pode ser usada para definir várias contagens regressivas e controlá-las e gerenciá-las.\n\nRecursos:\n\n1. Adicionar Contagem Regressiva: Você pode clicar no botão \"Adicionar Contagem Regressiva\" e definir o nome e a duração da contagem regressiva na caixa de diálogo pop-up.\n\n2. Editar Contagem Regressiva: Você pode clicar no botão \"Editar\" atrás do item da contagem regressiva para modificar o nome, duração e interruptor de notificação da contagem regressiva.\n\n3. Excluir Contagem Regressiva: Você pode clicar no botão \"Excluir\" atrás do item da contagem regressiva para excluir a contagem regressiva correspondente.\n\n4. Controlar Contagem Regressiva: Você pode iniciar, pausar, retomar e reiniciar uma única contagem regressiva ou controlar todas as contagens regressivas uniformemente.\n\n5. Suporte Multilíngue: Suporta vários idiomas e pode alternar automaticamente os idiomas com base no ambiente de idioma do usuário.\n\nCenários de Uso:\n\n1. Gerenciamento de Contagem Regressiva: Pode ser usado para gerenciar várias contagens regressivas, como contagens regressivas de reuniões, contagens regressivas de exames, etc.\n\n2. Gerenciamento de Tempo: Pode ser usado para gerenciar o tempo pessoal, como definir uma contagem regressiva para lembrar-se do horário de se exercitar todos os dias.\n\n3. Gerenciamento de Tarefas: Pode ser usado para gerenciar o tempo das tarefas, como definir uma contagem regressiva para lembrar-se do horário de concluir uma tarefa.\n\nInstruções:\n\n1. Abra a página da Ferramenta de Contagem Regressiva.\n\n2. Clique no botão \"Adicionar Contagem Regressiva\" e defina o nome e a duração da contagem regressiva na caixa de diálogo pop-up.\n\n3. Clique no botão \"Editar\" atrás do item da contagem regressiva para modificar o nome, duração e interruptor de notificação da contagem regressiva.\n\n4. Clique no botão \"Excluir\" atrás do item da contagem regressiva para excluir a contagem regressiva correspondente.\n\n5. Clique no botão \"Iniciar\" atrás do item da contagem regressiva para iniciar a contagem regressiva correspondente.\n\n6. Clique no botão \"Pausar\" atrás do item da contagem regressiva para pausar a contagem regressiva correspondente.\n\n7. Clique no botão \"Retomar\" atrás do item da contagem regressiva para retomar a contagem regressiva correspondente.\n\n8. Clique no botão \"Reiniciar\" atrás do item da contagem regressiva para reiniciar a contagem regressiva correspondente.\n\n9. Clique no botão \"Iniciar Todos\" para iniciar todas as contagens regressivas.\n\n10. Clique no botão \"Pausar Todos\" para pausar todas as contagens regressivas.\n\n11. Clique no botão \"Retomar Todos\" para retomar todas as contagens regressivas.\n\n12. Clique no botão \"Reiniciar Todos\" para reiniciar todas as contagens regressivas.\n\nObservações:\n\n1. A unidade de duração é horas, minutos e segundos, e a duração máxima é de 23 horas, 59 minutos e 59 segundos.\n\n2. O interruptor de notificação está desligado por padrão e precisa ser ativado manualmente.\n\n3. As operações de iniciar, pausar, retomar e reiniciar afetam apenas uma única contagem regressiva e não afetarão outras contagens regressivas.\n\n4. As operações de iniciar, pausar, retomar e reiniciar para todas as contagens regressivas afetarão todas as contagens regressivas e devem ser usadas com cautela.\n\n5. As contagens regressivas excluídas não podem ser recuperadas, portanto, use com cuidado.\n\n6. Esta ferramenta é apenas para uso pessoal e não pode ser usada para fins comerciais."
  },
  "en": {
    "$name": "countdown",
    "$keywords": [
      "countdown",
      "timers",
      "time",
      "time management",
      "task management",
      "multi-language support",
      "control countdown"
    ],
    "$description": "Countdown Tool User Guide\n\nThe Countdown Tool is a countdown tool based on Vue.js and Ant Design Vue. It can be used to set multiple countdowns and control and manage them.\n\nFeatures:\n\n1. Add Countdown: You can click the \"Add Countdown\" button and set the name and duration of the countdown in the pop-up dialog box.\n\n2. Edit Countdown: You can click the \"Edit\" button behind the countdown item to modify the name, duration, and notification switch of the countdown.\n\n3. Delete Countdown: You can click the \"Delete\" button behind the countdown item to delete the corresponding countdown.\n\n4. Control Countdown: You can start, pause, resume, and reset a single countdown, or control all countdowns uniformly.\n\n5. Multilingual Support: Supports multiple languages and can automatically switch languages based on the user's language environment.\n\nUsage Scenarios:\n\n1. Countdown Management: Can be used to manage multiple countdowns, such as meeting countdowns, exam countdowns, etc.\n\n2. Time Management: Can be used to manage personal time, such as setting a countdown to remind yourself of the time to exercise every day.\n\n3. Task Management: Can be used to manage the time of tasks, such as setting a countdown to remind yourself of the time to complete a task.\n\nInstructions:\n\n1. Open the Countdown Tool page.\n\n2. Click the \"Add Countdown\" button and set the name and duration of the countdown in the pop-up dialog box.\n\n3. Click the \"Edit\" button behind the countdown item to modify the name, duration, and notification switch of the countdown.\n\n4. Click the \"Delete\" button behind the countdown item to delete the corresponding countdown.\n\n5. Click the \"Start\" button behind the countdown item to start the corresponding countdown.\n\n6. Click the \"Pause\" button behind the countdown item to pause the corresponding countdown.\n\n7. Click the \"Resume\" button behind the countdown item to resume the corresponding countdown.\n\n8. Click the \"Reset\" button behind the countdown item to reset the corresponding countdown.\n\n9. Click the \"Start All\" button to start all countdowns.\n\n10. Click the \"Pause All\" button to pause all countdowns.\n\n11. Click the \"Resume All\" button to resume all countdowns.\n\n12. Click the \"Reset All\" button to reset all countdowns.\n\nNotes:\n\n1. The duration unit is hours, minutes, and seconds, and the maximum duration is 23 hours 59 minutes 59 seconds.\n\n2. The notification switch is off by default and needs to be manually turned on.\n\n3. The start, pause, resume, and reset operations only affect a single countdown and will not affect other countdowns.\n\n4. The start, pause, resume, and reset operations for all countdowns will affect all countdowns and should be used with caution.\n\n5. Deleted countdowns cannot be recovered, so please use caution.\n\n6. This tool is for personal use only and cannot be used for commercial purposes."
  }
}