{
  "en": {
    "$name": "Image Crop/Flip/Rotate",
    "$description": "Image Cropping is a tool that allows users to trim or cut out unwanted parts of an image, leaving only the desired portion. It supports various image formats such as PNG, JPG, JPEG, and WEBP, making it a versatile tool for editing pictures.",
    "$keywords": [
      "crop",
      "flip",
      "rotate",
      "image",
      "pic",
      "picture",
      "photo",
      "png",
      "jpg",
      "jpeg",
      "webp"
    ]
  },
  "es": {
    "$name": "Recortar/Voltear/Rotar Imagen",
    "$description": "Image Cropping es una herramienta que permite a los usuarios recortar o recortar partes no deseadas de una imagen, dejando solo la parte deseada. Admite varios formatos de imagen como PNG, JPG, JPEG y WEBP, lo que la convierte en una herramienta versátil para editar imágenes.",
    "$keywords": [
      "cultivo",
      "voltear",
      "girar",
      "imagen",
      "Foto",
      "imagen",
      "foto",
      "png",
      "jpg",
      "jpeg",
      "webp"
    ]
  },
  "pt": {
    "$name": "Cortar/Inverter/Girar Imagem",
    "$description": "Image Cropping é uma ferramenta que permite aos usuários aparar ou recortar partes indesejadas de uma imagem, deixando apenas a parte desejada. Suporta vários formatos de imagem como PNG, JPG, JPEG e WEBP, tornando-o uma ferramenta versátil para edição de imagens.",
    "$keywords": [
      "cortar",
      "virar",
      "girar",
      "imagem",
      "foto",
      "foto",
      "foto",
      "png",
      "jpg",
      "JPEG",
      "webp"
    ]
  },
  "de": {
    "$name": "Bild zuschneiden/spiegeln/drehen",
    "$description": "Beim Bildzuschneiden handelt es sich um ein Werkzeug, mit dem Benutzer unerwünschte Teile eines Bildes zuschneiden oder ausschneiden können, sodass nur der gewünschte Teil übrig bleibt. Es unterstützt verschiedene Bildformate wie PNG, JPG, JPEG und WEBP und ist damit ein vielseitiges Werkzeug zum Bearbeiten von Bildern.",
    "$keywords": [
      "Ernte",
      "umdrehen",
      "drehen",
      "Bild",
      "Bild",
      "Bild",
      "Foto",
      "png",
      "jpg",
      "jpeg",
      "webp"
    ]
  },
  "fr": {
    "$name": "Recadrage/retournement/rotation de l'image",
    "$description": "Le recadrage d'image est un outil qui permet aux utilisateurs de rogner ou de découper les parties indésirables d'une image, ne laissant que la partie souhaitée. Il prend en charge divers formats d'image tels que PNG, JPG, JPEG et WEBP, ce qui en fait un outil polyvalent pour éditer des images.",
    "$keywords": [
      "recadrer",
      "retourner",
      "tourner",
      "image",
      "photo",
      "image",
      "photo",
      "png",
      "jpg",
      "jpeg",
      "webp"
    ]
  },
  "ko": {
    "$name": "이미지 자르기/뒤집기/회전",
    "$description": "이미지 자르기는 사용자가 이미지에서 원하지 않는 부분을 자르고 원하는 부분만 남길 수 있는 도구입니다. PNG, JPG, JPEG, WEBP 등 다양한 이미지 형식을 지원하므로 사진 편집을 위한 다용도 도구입니다.",
    "$keywords": [
      "수확고",
      "튀기다",
      "회전하다",
      "영상",
      "사진",
      "그림",
      "사진",
      "png",
      "jpg",
      "JPEG",
      "웹"
    ]
  },
  "it": {
    "$name": "Ritaglia/Capovolgi/Ruota l'immagine",
    "$description": "Ritaglio immagine è uno strumento che consente agli utenti di tagliare o ritagliare parti indesiderate di un'immagine, lasciando solo la parte desiderata. Supporta vari formati di immagine come PNG, JPG, JPEG e WEBP, rendendolo uno strumento versatile per la modifica delle immagini.",
    "$keywords": [
      "raccolto",
      "Flip",
      "ruotare",
      "Immagine",
      "foto",
      "immagine",
      "foto",
      "png",
      "jpg",
      "jpeg",
      "webp"
    ]
  },
  "zh-cn": {
    "$name": "图像裁剪/翻转/旋转",
    "$description": "图像裁剪是一种工具，允许用户修剪或剪切图像中不需要的部分，只留下所需的部分。 它支持PNG、JPG、JPEG、WEBP等多种图片格式，是一款多功能的图片编辑工具。",
    "$keywords": [
      "庄稼",
      "翻动",
      "旋转",
      "图像",
      "图片",
      "图片",
      "照片",
      "PNG",
      ".jpg",
      "JPEG",
      "网页"
    ]
  },
  "ru": {
    "$name": "Обрезка изображения/переворот/поворот изображения",
    "$description": "Обрезка изображения — это инструмент, который позволяет пользователям обрезать или вырезать ненужные части изображения, оставляя только нужную часть. Он поддерживает различные форматы изображений, такие как PNG, JPG, JPEG и WEBP, что делает его универсальным инструментом для редактирования изображений.",
    "$keywords": [
      "обрезать",
      "подбросить",
      "вращать",
      "изображение",
      "картинка",
      "картина",
      "Фото",
      "png",
      "jpg",
      "JPEG",
      "веб-сайт"
    ]
  },
  "zh-tw": {
    "$name": "影像裁切/翻轉/旋轉",
    "$description": "影像裁切是一種工具，允許使用者修剪或剪切影像中不需要的部分，只留下所需的部分。 它支援PNG、JPG、JPEG、WEBP等多種圖片格式，是一款多功能的圖片編輯工具。",
    "$keywords": [
      "莊稼",
      "翻動",
      "旋轉",
      "影像",
      "圖片",
      "圖片",
      "照片",
      "PNG",
      ".jpg",
      "JPEG",
      "網頁"
    ]
  },
  "ja": {
    "$name": "画像のトリミング/反転/回転",
    "$description": "画像トリミングは、画像の不要な部分をトリミングまたは切り取り、必要な部分だけを残すことができるツールです。 PNG、JPG、JPEG、WEBP などのさまざまな画像形式をサポートしており、写真編集のための多用途ツールになります。",
    "$keywords": [
      "作物",
      "フリップ",
      "回転させる",
      "画像",
      "写真",
      "写真",
      "写真",
      "png",
      "jpg",
      "jpeg",
      "ウェブ"
    ]
  }
}