{
  "en": {
    "$name": "Mermaid Editor",
    "$description": "Mermaid Editor is a powerful tool that allows users to easily create, edit, and preview charts. With its intuitive interface and powerful features, users can quickly and efficiently create visually stunning charts and flowcharts for various purposes.",
    "$keywords": [
      "Mermaid",
      "charts",
      "edit",
      "preview",
      "editor"
    ]
  },
  "zh-tw": {
    "$name": "Mermaid編輯器",
    "$description": "Mermaid編輯器是一款強大的工具，允許用戶輕鬆創建、編輯和預覽圖表。憑藉其直觀的界面和強大的功能，用戶可以快速高效地創建視覺上令人驚嘆的圖表和流程圖，適用於各種用途。",
    "$keywords": [
      "Mermaid",
      "圖表",
      "編輯",
      "預覽",
      "編輯器"
    ]
  },
  "es": {
    "$name": "Editor de Mermaid",
    "$description": "El editor de Mermaid es una herramienta poderosa que permite a los usuarios crear, editar y previsualizar fácilmente gráficos. Con su interfaz intuitiva y sus funciones avanzadas, los usuarios pueden crear gráficos y diagramas impresionantes de manera rápida y eficiente, adecuados para una variedad de propósitos.",
    "$keywords": [
      "Mermaid",
      "gráficos",
      "edición",
      "previsualización",
      "editor"
    ]
  },
  "ja": {
    "$name": "Mermaidエディター",
    "$description": "Mermaidエディターは、ユーザーが簡単にグラフを作成、編集、プレビューできる強力なツールです。直感的なインターフェースと強力な機能により、ユーザーは視覚的に驚くべきグラフやフローチャートを素早く効率的に作成できます。あらゆる目的に適しています。",
    "$keywords": [
      "Mermaid",
      "グラフ",
      "編集",
      "プレビュー",
      "エディター"
    ]
  },
  "ko": {
    "$name": "Mermaid 편집기",
    "$description": "Mermaid 편집기는 사용자가 쉽게 차트를 생성, 편집 및 미리보기할 수 있는 강력한 도구입니다. 직관적인 인터페이스와 강력한 기능으로 사용자는 시각적으로 놀라운 차트 및 프로세스 다이어그램을 빠르고 효율적으로 생성할 수 있으며, 다양한 용도에 적합합니다.",
    "$keywords": [
      "Mermaid",
      "차트",
      "편집",
      "미리보기",
      "편집기"
    ]
  },
  "de": {
    "$name": "Mermaid Editor",
    "$description": "Mermaid Editor ist ein leistungsstarkes Tool, das es Benutzern ermöglicht, Diagramme einfach zu erstellen, zu bearbeiten und zu previewen. Mit seiner intuitiven Benutzeroberfläche und seinen leistungsstarken Funktionen können Benutzer schnell und effizient beeindruckende visuelle Diagramme und Flussdiagramme für verschiedene Zwecke erstellen.",
    "$keywords": [
      "Mermaid",
      "Diagramme",
      "Bearbeiten",
      "Preview",
      "Editor"
    ]
  },
  "fr": {
    "$name": "Éditeur Mermaid",
    "$description": "L'éditeur Mermaid est un outil puissant qui permet aux utilisateurs de créer, éditer et prévisualiser facilement des graphiques. Avec son interface intuitive et ses fonctionnalités avancées, les utilisateurs peuvent créer rapidement et efficacement des graphiques et des diagrammes visuellement époustouflants pour une variété d'utilisations.",
    "$keywords": [
      "Mermaid",
      "graphiques",
      "éditer",
      "prévisualiser",
      "éditeur"
    ]
  },
  "it": {
    "$name": "Editor Mermaid",
    "$description": "Editor Mermaid è un potente strumento che consente agli utenti di creare, modificare e visualizzare facilmente grafici. Grazie alla sua interfaccia intuitiva e alle sue potenti funzionalità, gli utenti possono creare grafici e diagrammi sorprendenti dal punto di vista visivo in modo rapido ed efficiente, adatti a vari scopi.",
    "$keywords": [
      "Mermaid",
      "grafici",
      "modifica",
      "visualizzazione",
      "editor"
    ]
  },
  "ru": {
    "$name": "Редактор Mermaid",
    "$description": "Редактор Mermaid - это мощный инструмент, который позволяет пользователям легко создавать, редактировать и предварительно просматривать диаграммы. Благодаря интуитивно понятному интерфейсу и мощным функциям пользователи могут быстро и эффективно создавать визуально впечатляющие диаграммы и блок-схемы для различных целей.",
    "$keywords": [
      "Mermaid",
      "диаграммы",
      "редактирование",
      "предварительный просмотр",
      "редактор"
    ]
  },
  "pt": {
    "$name": "Editor Mermaid",
    "$description": "O Editor Mermaid é uma ferramenta poderosa que permite aos usuários criar, editar e visualizar facilmente gráficos. Com sua interface intuitiva e recursos avançados, os usuários podem criar gráficos e fluxogramas visualmente impressionantes de forma rápida e eficiente, adequados para uma variedade de fins.",
    "$keywords": [
      "Mermaid",
      "gráficos",
      "editar",
      "visualizar",
      "editor"
    ]
  },
  "zh-cn": {
    "$name": "Mermaid 编辑器",
    "$description": "Mermaid编辑器是一款强大的工具，允许用户轻松创建、编辑和预览图表。凭借其直观的界面和强大的功能，用户可以快速高效地创建视觉上令人惊叹的图表和流程图，适用于各种用途。",
    "$keywords": [
      "Mermaid",
      "图表",
      "编辑",
      "预览",
      "编辑器"
    ]
  }
}