[
  {
    "id": "dify-answer-to-girlfriend",
    "en": {
      "$name": "Cleverly Resolve Your Girlfriend's Life-or-Death Questions",
      "$keywords": [
        "conversation",
        "AI",
        "Satirical humor",
        "Emotional expression",
        "Social entertainment",
        "Reply generation",
        "Tone recognition"
      ],
      "$description": "He3 answer to girlfriend is a tool used to generate funny responses to girlfriends. It can generate interesting responses based on the user's input of keywords and tone, which can be used to entertain or tease girlfriends.\n\nFeatures:\n\n1. Users can input keywords and tone, such as \"I want to eat\" or \"angry\", into the tool.\n\n2. The tool will generate some interesting responses based on the input keywords and tone, such as \"You want to eat? Then I'll cook instant noodles\" or \"Are you angry? Then I'll sing you a song\".\n\n3. Users can choose their favorite response and copy it to the clipboard to send to their girlfriend.\n\nUse cases:\n\n1. Teasing: Users can use the He3 answer to girlfriend tool to generate some funny responses to tease their girlfriend.\n\n2. Emotional expression: Users can use the tool to generate some warm or romantic responses to express their emotions.\n\n3. Social entertainment: Users can share the generated responses with friends or social networks for entertainment and communication."
    },
    "pt": {
      "$name": "Resolva de maneira inteligente as perguntas de vida ou morte da sua namorada",
      "$keywords": [
        "conversação",
        "IA",
        "Humor satírico",
        "Expressão emocional",
        "Entretenimento social",
        "Geração de respostas",
        "Reconhecimento de tom"
      ],
      "$description": "A resposta do He3 para a namorada é uma ferramenta usada para gerar respostas engraçadas para namoradas. Ela pode gerar respostas interessantes com base nas palavras-chave e no tom de entrada do usuário, que podem ser usadas para entreter ou provocar as namoradas.\n\nRecursos:\n\n1. Os usuários podem inserir palavras-chave e tom, como \"Eu quero comer\" ou \"bravo\", na ferramenta.\n\n2. A ferramenta gerará algumas respostas interessantes com base nas palavras-chave e no tom de entrada, como \"Você quer comer? Então eu vou cozinhar macarrão instantâneo\" ou \"Você está bravo? Então eu vou cantar uma música para você\".\n\n3. Os usuários podem escolher sua resposta favorita e copiá-la para a área de transferência para enviar para sua namorada.\n\nCasos de uso:\n\n1. Provocação: Os usuários podem usar a ferramenta He3 para responder à namorada e gerar algumas respostas engraçadas para provocá-la.\n\n2. Expressão emocional: Os usuários podem usar a ferramenta para gerar algumas respostas calorosas ou românticas para expressar suas emoções.\n\n3. Entretenimento social: Os usuários podem compartilhar as respostas geradas com amigos ou redes sociais para entretenimento e comunicação."
    },
    "ru": {
      "$name": "Умно решайте вопросы жизни или смерти вашей подруги",
      "$keywords": [
        "разговор",
        "ИИ",
        "сатирический юмор",
        "эмоциональное выражение",
        "социальное развлечение",
        "генерация ответов",
        "распознавание тона"
      ],
      "$description": "Перевод: He3 ответ для девушки - это инструмент, используемый для генерации забавных ответов на девушек. Он может генерировать интересные ответы на основе ключевых слов и тона, введенных пользователем, которые могут использоваться для развлечения или дразнения девушек.\n\nОсобенности:\n\n1. Пользователи могут вводить ключевые слова и тональность, такие как \"Я хочу есть\" или \"злой\", в инструмент.\n\n2. Инструмент будет генерировать интересные ответы на основе введенных ключевых слов и тональности, такие как \"Ты хочешь есть? Тогда я приготовлю быстрое блюдо\" или \"Ты злой? Тогда я спою тебе песню\".\n\n3. Пользователи могут выбрать свой любимый ответ и скопировать его в буфер обмена, чтобы отправить его своей девушке.\n\nПрименение:\n\n1. Дразнение: Пользователи могут использовать инструмент He3 ответ для девушки, чтобы сгенерировать забавные ответы, чтобы дразнить свою девушку.\n\n2. Эмоциональное выражение: Пользователи могут использовать инструмент, чтобы сгенерировать теплые или романтические ответы, чтобы выразить свои эмоции.\n\n3. Социальное развлечение: Пользователи могут делиться сгенерированными ответами с друзьями или социальными сетями для развлечения и общения."
    },
    "it": {
      "$name": "Risolvete in modo astuto le domande di vita o di morte della vostra ragazza",
      "$keywords": [
        "conversazione",
        "IA",
        "umorismo satirico",
        "espressione emotiva",
        "intrattenimento sociale",
        "generazione di risposte",
        "riconoscimento del tono"
      ],
      "$description": "La risposta di He3 alla fidanzata è uno strumento utilizzato per generare risposte divertenti alle fidanzate. Può generare risposte interessanti basate sull'input dell'utente di parole chiave e tono, che possono essere utilizzate per intrattenere o prendere in giro le fidanzate.\n\nCaratteristiche:\n\n1. Gli utenti possono inserire parole chiave e tono, come \"Voglio mangiare\" o \"arrabbiato\", nello strumento.\n\n2. Lo strumento genererà alcune risposte interessanti basate sulle parole chiave e il tono inseriti, come \"Vuoi mangiare? Allora ti cucino gli spaghetti istantanei\" o \"Sei arrabbiato? Allora ti canto una canzone\".\n\n3. Gli utenti possono scegliere la loro risposta preferita e copiarla negli appunti per inviarla alla loro fidanzata.\n\nCasi d'uso:\n\n1. Prendere in giro: gli utenti possono utilizzare lo strumento He3 per generare alcune risposte divertenti per prendere in giro la loro fidanzata.\n\n2. Espressione emotiva: gli utenti possono utilizzare lo strumento per generare alcune risposte affettuose o romantiche per esprimere le loro emozioni.\n\n3. Intrattenimento sociale: gli utenti possono condividere le risposte generate con amici o social network per intrattenimento e comunicazione."
    },
    "fr": {
      "$name": "Résoudre astucieusement les questions de vie ou de mort de votre petite amie",
      "$keywords": [
        "conversation",
        "IA",
        "Humour satirique",
        "Expression émotionnelle",
        "Divertissement social",
        "Génération de réponses",
        "Reconnaissance de tonalité"
      ],
      "$description": "La réponse de He3 à sa petite amie est un outil utilisé pour générer des réponses amusantes à sa petite amie. Il peut générer des réponses intéressantes en fonction des mots-clés et du ton saisis par l'utilisateur, qui peuvent être utilisées pour divertir ou taquiner sa petite amie.\n\nFonctionnalités :\n\n1. Les utilisateurs peuvent saisir des mots-clés et un ton, tels que \"Je veux manger\" ou \"en colère\", dans l'outil.\n\n2. L'outil générera des réponses intéressantes en fonction des mots-clés et du ton saisis, telles que \"Tu veux manger ? Alors je vais faire des nouilles instantanées\" ou \"Tu es en colère ? Alors je vais te chanter une chanson\".\n\n3. Les utilisateurs peuvent choisir leur réponse préférée et la copier dans le presse-papiers pour l'envoyer à leur petite amie.\n\nCas d'utilisation :\n\n1. Taquinerie : Les utilisateurs peuvent utiliser l'outil He3 pour générer des réponses amusantes pour taquiner leur petite amie.\n\n2. Expression émotionnelle : Les utilisateurs peuvent utiliser l'outil pour générer des réponses chaleureuses ou romantiques pour exprimer leurs émotions.\n\n3. Divertissement social : Les utilisateurs peuvent partager les réponses générées avec des amis ou des réseaux sociaux pour le divertissement et la communication."
    },
    "de": {
      "$name": "Clever lösen Sie die Lebens- oder Todesfragen Ihrer Freundin",
      "$keywords": [
        "Konversation",
        "KI",
        "Satirischer Humor",
        "Emotionale Ausdrucksweise",
        "Soziale Unterhaltung",
        "Antwortgenerierung",
        "Tonerkennung"
      ],
      "$description": "Er3 Antwort an Freundin ist ein Werkzeug, das verwendet wird, um lustige Antworten auf Freundinnen zu generieren. Es kann interessante Antworten generieren, die auf den vom Benutzer eingegebenen Schlüsselwörtern und Ton basieren, die verwendet werden können, um Freundinnen zu unterhalten oder zu necken.\n\nFunktionen:\n\n1. Benutzer können Schlüsselwörter und Ton wie \"Ich möchte essen\" oder \"wütend\" in das Werkzeug eingeben.\n\n2. Das Werkzeug generiert einige interessante Antworten basierend auf den eingegebenen Schlüsselwörtern und dem Ton, wie z.B. \"Du willst essen? Dann koche ich Instant-Nudeln\" oder \"Bist du wütend? Dann singe ich dir ein Lied\".\n\n3. Benutzer können ihre Lieblingsantwort auswählen und sie in die Zwischenablage kopieren, um sie an ihre Freundin zu senden.\n\nAnwendungsfälle:\n\n1. Neckerei: Benutzer können das He3 Antwort an Freundin-Tool verwenden, um einige lustige Antworten zu generieren, um ihre Freundin zu necken.\n\n2. Emotionale Ausdrucksweise: Benutzer können das Werkzeug verwenden, um einige warme oder romantische Antworten zu generieren, um ihre Emotionen auszudrücken.\n\n3. Soziale Unterhaltung: Benutzer können die generierten Antworten mit Freunden oder sozialen Netzwerken teilen, um sich zu unterhalten und zu kommunizieren."
    },
    "ko": {
      "$name": "여자친구의 목숨 걸고 묻는 질문을 똑똑하게 해결하는 방법",
      "$keywords": [
        "대화",
        "인공지능",
        "풍자적 유머",
        "감정 표현",
        "소셜 엔터테인먼트",
        "답변 생성",
        "어조 인식"
      ],
      "$description": "그의 여자친구에게 대답하는 He3은 여자친구에게 재미있는 대답을 만들기 위해 사용되는 도구입니다. 사용자가 입력한 키워드와 톤에 기반하여 흥미로운 대답을 생성할 수 있으며, 이를 사용하여 여자친구를 즐겁게 하거나 놀리는 데 사용할 수 있습니다.\n\n기능:\n\n1. 사용자는 \"나는 먹고 싶다\" 또는 \"화가 나\"와 같은 키워드와 톤을 도구에 입력할 수 있습니다.\n\n2. 도구는 입력한 키워드와 톤에 기반하여 몇 가지 흥미로운 대답을 생성합니다. 예를 들어 \"너 먹고 싶어? 그럼 나는 인스턴트 라면을 요리할게\" 또는 \"화가 나? 그럼 내가 노래를 불러줄게\"와 같은 대답이 있습니다.\n\n3. 사용자는 가장 좋아하는 대답을 선택하고 클립 보드에 복사하여 여자친구에게 보낼 수 있습니다.\n\n사용 사례:\n\n1. 놀림: 사용자는 He3 여자친구 대답 도구를 사용하여 여자친구를 놀리기 위해 몇 가지 재미있는 대답을 생성할 수 있습니다.\n\n2. 감정 표현: 사용자는 도구를 사용하여 따뜻하거나 로맨틱한 대답을 생성하여 감정을 표현할 수 있습니다.\n\n3. 소셜 엔터테인먼트: 사용자는 생성된 대답을 친구나 소셜 네트워크와 공유하여 엔터테인먼트와 의사 소통을 할 수 있습니다."
    },
    "ja": {
      "$name": "彼女の命がけの質問を巧妙に解決する方法",
      "$keywords": [
        "会話",
        "人工知能",
        "皮肉なユーモア",
        "感情表現",
        "ソーシャルエンターテイメント",
        "返信生成",
        "トーン認識"
      ],
      "$description": "彼3のガールフレンドへの返答は、ガールフレンドに対して面白い返答を生成するためのツールです。ユーザーがキーワードやトーンを入力することで、興味深い返答を生成し、ガールフレンドを楽しませたりからかったりすることができます。\n\n特徴：\n\n1. ユーザーは、\"食べたい\"や\"怒っている\"などのキーワードやトーンをツールに入力することができます。\n\n2. ツールは、入力されたキーワードやトーンに基づいて、\"あなたは食べたいですか？それなら、インスタントラーメンを作ります\"や\"怒っていますか？それなら、あなたに歌を歌います\"などの興味深い返答を生成します。\n\n3. ユーザーは、お気に入りの返答を選択してクリップボードにコピーし、ガールフレンドに送信することができます。\n\n使用例：\n\n1. からかうこと：ユーザーは、He3 answer to girlfriendツールを使用して、ガールフレンドをからかうためにいくつかの面白い返答を生成することができます。\n\n2. 感情表現：ユーザーは、ツールを使用して、感情を表現するために暖かいまたはロマンチックな返答を生成することができます。\n\n3. ソーシャルエンターテイメント：ユーザーは、生成された返答を友達やソーシャルネットワークで共有して、エンターテイメントやコミュニケーションを楽しむことができます。"
    },
    "es": {
      "$name": "Resuelve de manera inteligente las preguntas de vida o muerte de tu novia",
      "$keywords": [
        "conversación",
        "IA",
        "humor satírico",
        "expresión emocional",
        "entretenimiento social",
        "generación de respuestas",
        "reconocimiento de tono"
      ],
      "$description": "La respuesta de He3 a su novia es una herramienta utilizada para generar respuestas divertidas a las novias. Puede generar respuestas interesantes basadas en las palabras clave y el tono que el usuario ingrese, las cuales pueden ser utilizadas para entretener o molestar a las novias.\n\nCaracterísticas:\n\n1. Los usuarios pueden ingresar palabras clave y tono, como \"quiero comer\" o \"enojado\", en la herramienta.\n\n2. La herramienta generará algunas respuestas interesantes basadas en las palabras clave y el tono ingresados, como \"¿Quieres comer? Entonces cocinaré fideos instantáneos\" o \"¿Estás enojado? Entonces te cantaré una canción\".\n\n3. Los usuarios pueden elegir su respuesta favorita y copiarla al portapapeles para enviarla a su novia.\n\nCasos de uso:\n\n1. Molestar: Los usuarios pueden utilizar la herramienta de respuesta de He3 a su novia para generar respuestas divertidas para molestar a su novia.\n\n2. Expresión emocional: Los usuarios pueden utilizar la herramienta para generar respuestas cálidas o románticas para expresar sus emociones.\n\n3. Entretenimiento social: Los usuarios pueden compartir las respuestas generadas con amigos o redes sociales para entretenimiento y comunicación."
    },
    "zh-tw": {
      "$name": "巧妙化解女朋友的送命題",
      "$keywords": [
        "對話",
        "人工智慧",
        "諷刺幽默",
        "情感表達",
        "社交娛樂",
        "回覆生成",
        "語氣辨識"
      ],
      "$description": "他3回答女友是一個用於產生有趣回應的工具，可以根據用戶輸入的關鍵詞和語氣生成有趣的回應，用於娛樂或戲弄女友。\n\n特點：\n\n1. 用戶可以將關鍵詞和語氣（例如“我想吃”或“生氣”）輸入到工具中。\n\n2. 工具將根據輸入的關鍵詞和語氣生成一些有趣的回應，例如“你想吃什麼？那我來煮泡麵”或“你生氣了？那我來唱首歌給你聽”。\n\n3. 用戶可以選擇自己喜歡的回應，並將其複製到剪貼板中發送給女友。\n\n使用情境：\n\n1. 戲弄：用戶可以使用He3回答女友工具生成一些有趣的回應來戲弄女友。\n\n2. 情感表達：用戶可以使用該工具生成一些溫馨或浪漫的回應來表達自己的情感。\n\n3. 社交娛樂：用戶可以將生成的回應與朋友或社交網絡分享，以進行娛樂和交流。"
    },
    "zh-cn": {
      "$name": "巧妙化解女朋友的送命题",
      "$keywords": [
        "对话",
        "人工智能",
        "讽刺幽默",
        "情感表达",
        "社交娱乐",
        "回复生成",
        "语气识别"
      ],
      "$description": "他3回答女友是一个用于生成有趣回应的工具，可以根据用户输入的关键词和语气生成有趣的回应，用于娱乐或逗弄女友。\n\n特点：\n\n1. 用户可以将关键词和语气（如“我想吃”或“生气”）输入到工具中。\n\n2. 工具将根据输入的关键词和语气生成一些有趣的回应，如“你想吃什么？那我煮方便面给你吃”或“你生气了？那我给你唱首歌”。\n\n3. 用户可以选择自己喜欢的回应并将其复制到剪贴板中发送给女友。\n\n用例：\n\n1. 逗弄：用户可以使用He3回答女友工具生成一些有趣的回应来逗弄女友。\n\n2. 情感表达：用户可以使用该工具生成一些温馨或浪漫的回应来表达自己的情感。\n\n3. 社交娱乐：用户可以将生成的回应与朋友或社交网络分享，以供娱乐和交流。"
    }
  },
  {
    "id": "dify-anti-pua",
    "en": {
      "$name": "Reverse Leadership PUA Tool",
      "$keywords": [
        "conversation",
        "AI",
        "PUA protection",
        "social media security",
        "mental health",
        "social skills improvement"
      ],
      "$description": "The He3 anti-PUA tool is a tool designed to prevent PUAs (Pick-Up Artists). It can detect and block common techniques and strategies used by PUAs in social media and chat applications, thus protecting users from harassment and manipulation.\n\nFeatures:\n\n1. Automatically detect and block common techniques and strategies used by PUAs in social media and chat applications.\n\n2. Provide real-time warnings and suggestions to help users identify and respond to potential PUA behavior.\n\n3. Customizable settings to meet the needs and preferences of different users.\n\nUse cases:\n\n1. Prevent harassment and manipulation by PUAs in social media and chat applications.\n\n2. Protect users' privacy and safety, preventing them from unnecessary psychological pressure and harm.\n\n3. Improve users' social skills and awareness, helping them better understand and respond to unhealthy social behavior."
    },
    "pt": {
      "$name": "Ferramenta de PUA de liderança reversa",
      "$keywords": [
        "conversa",
        "IA",
        "proteção contra PUA",
        "segurança nas redes sociais",
        "saúde mental",
        "melhoria das habilidades sociais"
      ],
      "$description": "A ferramenta anti-PUA He3 é uma ferramenta projetada para prevenir PUAs (Pick-Up Artists). Ela pode detectar e bloquear técnicas e estratégias comuns usadas por PUAs em mídias sociais e aplicativos de chat, protegendo assim os usuários de assédio e manipulação.\n\nRecursos:\n\n1. Detectar e bloquear automaticamente técnicas e estratégias comuns usadas por PUAs em mídias sociais e aplicativos de chat.\n\n2. Fornecer avisos e sugestões em tempo real para ajudar os usuários a identificar e responder a comportamentos potencialmente PUA.\n\n3. Configurações personalizáveis para atender às necessidades e preferências de diferentes usuários.\n\nCasos de uso:\n\n1. Prevenir assédio e manipulação por PUAs em mídias sociais e aplicativos de chat.\n\n2. Proteger a privacidade e a segurança dos usuários, impedindo-os de sofrer pressão psicológica e danos desnecessários.\n\n3. Melhorar as habilidades sociais e a consciência dos usuários, ajudando-os a entender e responder melhor a comportamentos sociais prejudiciais."
    },
    "ru": {
      "$name": "Инструмент обратного лидерства PUA",
      "$keywords": [
        "беседа",
        "ИИ",
        "защита от PUA",
        "безопасность в социальных сетях",
        "психическое здоровье",
        "улучшение социальных навыков"
      ],
      "$description": "Инструмент He3 anti-PUA - это инструмент, разработанный для предотвращения действий PUAs (Pick-Up Artists). Он может обнаруживать и блокировать распространенные техники и стратегии, используемые PUAs в социальных сетях и чат-приложениях, защищая пользователей от домогательств и манипуляций.\n\nОсобенности:\n\n1. Автоматическое обнаружение и блокирование распространенных техник и стратегий, используемых PUAs в социальных сетях и чат-приложениях.\n\n2. Предоставление предупреждений и рекомендаций в режиме реального времени, чтобы помочь пользователям определить и ответить на потенциальное поведение PUA.\n\n3. Настраиваемые настройки, чтобы удовлетворить потребности и предпочтения разных пользователей.\n\nПримеры использования:\n\n1. Предотвращение домогательств и манипуляций PUAs в социальных сетях и чат-приложениях.\n\n2. Защита конфиденциальности и безопасности пользователей, предотвращение ненужного психологического давления и вреда.\n\n3. Улучшение социальных навыков и осведомленности пользователей, помогая им лучше понимать и реагировать на нездоровое социальное поведение."
    },
    "it": {
      "$name": "Strumento PUA inverso di leadership",
      "$keywords": [
        "conversazione",
        "intelligenza artificiale",
        "protezione PUA",
        "sicurezza sui social media",
        "salute mentale",
        "miglioramento delle abilità sociali"
      ],
      "$description": "Lo strumento anti-PUA He3 è stato progettato per prevenire i PUAs (Pick-Up Artists). Può rilevare e bloccare le tecniche e le strategie comuni utilizzate dai PUAs nei social media e nelle applicazioni di chat, proteggendo così gli utenti dallo stalking e dalla manipolazione.\n\nCaratteristiche:\n\n1. Rilevamento automatico e blocco delle tecniche e delle strategie comuni utilizzate dai PUAs nei social media e nelle applicazioni di chat.\n\n2. Fornisce avvisi e suggerimenti in tempo reale per aiutare gli utenti a identificare e rispondere al comportamento potenzialmente PUA.\n\n3. Impostazioni personalizzabili per soddisfare le esigenze e le preferenze degli utenti.\n\nCasi d'uso:\n\n1. Prevenire lo stalking e la manipolazione da parte dei PUAs nei social media e nelle applicazioni di chat.\n\n2. Proteggere la privacy e la sicurezza degli utenti, impedendo loro pressioni psicologiche e danni inutili.\n\n3. Migliorare le abilità sociali e la consapevolezza degli utenti, aiutandoli a comprendere e rispondere meglio a comportamenti sociali malsani."
    },
    "fr": {
      "$name": "Outil de PUA de leadership inversé",
      "$keywords": [
        "conversation",
        "IA",
        "protection contre les PUA",
        "sécurité des médias sociaux",
        "santé mentale",
        "amélioration des compétences sociales"
      ],
      "$description": "L'outil anti-PUA He3 est conçu pour prévenir les PUAs (Pick-Up Artists). Il peut détecter et bloquer les techniques et stratégies courantes utilisées par les PUAs dans les médias sociaux et les applications de chat, protégeant ainsi les utilisateurs contre le harcèlement et la manipulation.\n\nFonctionnalités :\n\n1. Détecter automatiquement et bloquer les techniques et stratégies courantes utilisées par les PUAs dans les médias sociaux et les applications de chat.\n\n2. Fournir des avertissements et des suggestions en temps réel pour aider les utilisateurs à identifier et à répondre aux comportements potentiellement PUA.\n\n3. Paramètres personnalisables pour répondre aux besoins et préférences des différents utilisateurs.\n\nCas d'utilisation :\n\n1. Prévenir le harcèlement et la manipulation par les PUAs dans les médias sociaux et les applications de chat.\n\n2. Protéger la vie privée et la sécurité des utilisateurs, les empêchant de subir une pression psychologique et des dommages inutiles.\n\n3. Améliorer les compétences sociales et la conscience des utilisateurs, les aidant à mieux comprendre et à répondre aux comportements sociaux malsains."
    },
    "de": {
      "$name": "Umkehrwerkzeug für Führungskräfte PUA",
      "$keywords": [
        "Konversation",
        "KI",
        "PUA-Schutz",
        "Sicherheit in sozialen Medien",
        "psychische Gesundheit",
        "Verbesserung sozialer Fähigkeiten"
      ],
      "$description": "Die He3 Anti-PUA-Tool ist ein Werkzeug, das entwickelt wurde, um PUAs (Pick-Up Artists) zu verhindern. Es kann häufig verwendete Techniken und Strategien von PUAs in sozialen Medien und Chat-Anwendungen erkennen und blockieren, um Benutzer vor Belästigung und Manipulation zu schützen.\n\nFunktionen:\n\n1. Automatische Erkennung und Blockierung von häufig verwendeten Techniken und Strategien von PUAs in sozialen Medien und Chat-Anwendungen.\n\n2. Echtzeit-Warnungen und Vorschläge, um Benutzern zu helfen, potenzielles PUA-Verhalten zu erkennen und darauf zu reagieren.\n\n3. Anpassbare Einstellungen, um den Bedürfnissen und Vorlieben verschiedener Benutzer gerecht zu werden.\n\nAnwendungsfälle:\n\n1. Verhindern von Belästigung und Manipulation durch PUAs in sozialen Medien und Chat-Anwendungen.\n\n2. Schutz der Privatsphäre und Sicherheit der Benutzer, um sie vor unnötigem psychologischem Druck und Schaden zu bewahren.\n\n3. Verbesserung der sozialen Fähigkeiten und des Bewusstseins der Benutzer, um ihnen zu helfen, ungesundes soziales Verhalten besser zu verstehen und darauf zu reagieren."
    },
    "ko": {
      "$name": "리더십 PUA 도구 역전",
      "$keywords": [
        "대화",
        "인공지능",
        "PUA 보호",
        "소셜 미디어 보안",
        "정신 건강",
        "사회적 기술 개선"
      ],
      "$description": "He3 안티-PUA 도구는 PUAs(픽업 아티스트)를 방지하기 위해 설계된 도구입니다. 이 도구는 소셜 미디어 및 채팅 애플리케이션에서 PUAs가 사용하는 일반적인 기술과 전략을 감지하고 차단하여 사용자가 괴롭힘과 조작으로부터 보호합니다.\n\n기능:\n\n1. 소셜 미디어 및 채팅 애플리케이션에서 PUAs가 사용하는 일반적인 기술과 전략을 자동으로 감지하고 차단합니다.\n\n2. 사용자가 잠재적인 PUA 행동을 식별하고 대응할 수 있도록 실시간 경고와 제안을 제공합니다.\n\n3. 다양한 사용자의 요구와 선호에 맞게 설정을 사용자 정의할 수 있습니다.\n\n사용 사례:\n\n1. 소셜 미디어 및 채팅 애플리케이션에서 PUAs에 의한 괴롭힘과 조작을 방지합니다.\n\n2. 사용자의 개인 정보와 안전을 보호하여 불필요한 심리적 압박과 피해를 방지합니다.\n\n3. 사용자의 사회적 기술과 인식을 향상시켜 건강하지 않은 사회적 행동을 더 잘 이해하고 대응할 수 있도록 도와줍니다."
    },
    "ja": {
      "$name": "リーダーシップPUAツールを逆にする",
      "$keywords": [
        "会話",
        "AI",
        "PUA保護",
        "ソーシャルメディアセキュリティ",
        "メンタルヘルス",
        "社交スキルの向上"
      ],
      "$description": "He3の反-PUAツールは、PUA（ピックアップアーティスト）を防止するために設計されたツールです。これにより、ソーシャルメディアやチャットアプリケーションでPUAが使用する一般的な技術や戦略を検出してブロックすることができ、ユーザーを嫌がらせや操作から保護します。\n\n特徴：\n\n1. ソーシャルメディアやチャットアプリケーションでPUAが使用する一般的な技術や戦略を自動的に検出してブロックします。\n\n2. リアルタイムの警告や提案を提供し、ユーザーが潜在的なPUAの行動を識別して対処するのを支援します。\n\n3. 異なるユーザーのニーズや好みに合わせてカスタマイズ可能な設定があります。\n\n使用例：\n\n1. ソーシャルメディアやチャットアプリケーションでのPUAによる嫌がらせや操作を防止します。\n\n2. ユーザーのプライバシーや安全を保護し、不必要な心理的な圧力や害から守ります。\n\n3. ユーザーの社交スキルや意識を向上させ、健康的でない社交行動に対してより良い理解と対処を支援します。"
    },
    "es": {
      "$name": "Herramienta de PUA de liderazgo inverso",
      "$keywords": [
        "conversación",
        "IA",
        "protección contra PUA",
        "seguridad en redes sociales",
        "salud mental",
        "mejora de habilidades sociales"
      ],
      "$description": "La herramienta anti-PUA He3 es una herramienta diseñada para prevenir a los PUAs (Pick-Up Artists). Puede detectar y bloquear técnicas y estrategias comunes utilizadas por los PUAs en las redes sociales y aplicaciones de chat, protegiendo así a los usuarios del acoso y la manipulación.\n\nCaracterísticas:\n\n1. Detecta y bloquea automáticamente técnicas y estrategias comunes utilizadas por los PUAs en las redes sociales y aplicaciones de chat.\n\n2. Proporciona advertencias y sugerencias en tiempo real para ayudar a los usuarios a identificar y responder al comportamiento potencial de los PUAs.\n\n3. Configuraciones personalizables para satisfacer las necesidades y preferencias de diferentes usuarios.\n\nCasos de uso:\n\n1. Prevenir el acoso y la manipulación por parte de los PUAs en las redes sociales y aplicaciones de chat.\n\n2. Proteger la privacidad y seguridad de los usuarios, evitando la presión psicológica y el daño innecesario.\n\n3. Mejorar las habilidades sociales y la conciencia de los usuarios, ayudándoles a comprender y responder mejor al comportamiento social poco saludable."
    },
    "zh-tw": {
      "$name": "反領導PUA工具",
      "$keywords": [
        "對話",
        "人工智慧",
        "PUA 保護",
        "社交媒體安全",
        "心理健康",
        "社交技能提升"
      ],
      "$description": "He3反PUA工具是一款旨在防止PUA（搭訕藝術家）的工具。它可以檢測和阻止PUA在社交媒體和聊天應用程序中常用的技巧和策略，從而保護用戶免受騷擾和操縱。\n\n功能：\n\n1. 自動檢測和阻止PUA在社交媒體和聊天應用程序中常用的技巧和策略。\n\n2. 提供實時警告和建議，幫助用戶識別和應對潛在的PUA行為。\n\n3. 可自定義設置，以滿足不同用戶的需求和偏好。\n\n使用場景：\n\n1. 防止PUA在社交媒體和聊天應用程序中騷擾和操縱。\n\n2. 保護用戶的隱私和安全，防止他們遭受不必要的心理壓力和傷害。\n\n3. 提高用戶的社交技能和意識，幫助他們更好地理解和應對不健康的社交行為。"
    },
    "zh-cn": {
      "$name": "反领导 PUA 工具",
      "$keywords": [
        "对话",
        "人工智能",
        "PUA保护",
        "社交媒体安全",
        "心理健康",
        "社交技能提升"
      ],
      "$description": "He3反PUA工具是一款旨在防止PUA（搭讪艺术家）的工具。它可以检测和阻止PUA在社交媒体和聊天应用中常用的技巧和策略，从而保护用户免受骚扰和操纵。\n\n特点：\n\n1. 自动检测和阻止PUA在社交媒体和聊天应用中常用的技巧和策略。\n\n2. 提供实时警告和建议，帮助用户识别和应对潜在的PUA行为。\n\n3. 可定制的设置，以满足不同用户的需求和偏好。\n\n使用场景：\n\n1. 防止PUA在社交媒体和聊天应用中骚扰和操纵用户。\n\n2. 保护用户的隐私和安全，防止他们遭受不必要的心理压力和伤害。\n\n3. 提高用户的社交技能和意识，帮助他们更好地理解和应对不健康的社交行为。"
    }
  },
  {
    "id": "dify-astrologer",
    "en": {
      "$name": "Astrologer✨",
      "$keywords": [
        "AI",
        "Astrology",
        "Natal Chart",
        "Zodiac Interpretation",
        "Planet Interpretation",
        "House Interpretation",
        "Sky Map",
        "Planetary Cycle Chart",
        "Zodiac Chart",
        "Personal Astrological Analysis",
        "Love and Marriage Analysis",
        "Career Development Analysis",
        "Academic Research"
      ],
      "$description": "He3 Astrologer is a tool for astrology. It can generate a personal natal chart based on the user's input of birth date, time, and location, and provide detailed interpretation and analysis.\n\nFeatures:\n\n1. Users can input their birth date, time, and location, and the tool will automatically calculate and generate a personal natal chart.\n\n2. The tool provides various astrology analysis tools, including zodiac sign interpretation, planet interpretation, and house interpretation.\n\n3. The tool also provides various astrology charts, including celestial chart, planetary cycle chart, and zodiac chart.\n\n4. Users can choose different astrology analysis tools and charts according to their needs for personalized astrology analysis.\n\nUse cases:\n\n1. Personal astrology analysis: Users can use He3 Astrologer to analyze their own astrology, understand their personality traits, strengths and weaknesses, and future development trends.\n\n2. Love and marriage analysis: Users can use He3 Astrologer to analyze love and marriage, understand the compatibility, personality traits, and future development trends between themselves and their partners.\n\n3. Career development analysis: Users can use He3 Astrologer to analyze career development, understand their career strengths and weaknesses, and future career development trends.\n\n4. Academic research: Astrology is an ancient and mysterious discipline. For academic researchers, using He3 Astrologer can provide a deeper understanding of the theory and practice of astrology."
    },
    "pt": {
      "$name": "Astrólogo✨",
      "$keywords": [
        "IA",
        "Astrologia",
        "Mapa Natal",
        "Interpretação do Zodíaco",
        "Interpretação Planetária",
        "Interpretação das Casas",
        "Mapa do Céu",
        "Gráfico do Ciclo Planetário",
        "Gráfico do Zodíaco",
        "Análise Astrológica Pessoal",
        "Análise de Amor e Casamento",
        "Análise de Desenvolvimento de Carreira",
        "Pesquisa Acadêmica"
      ],
      "$description": "O He3 Astrologer é uma ferramenta para astrologia. Ele pode gerar um mapa astral pessoal com base nas informações de data, hora e local de nascimento do usuário, e fornecer interpretação e análise detalhadas.\n\nRecursos:\n\n1. Os usuários podem inserir sua data, hora e local de nascimento, e a ferramenta calculará e gerará automaticamente um mapa astral pessoal.\n\n2. A ferramenta fornece várias ferramentas de análise astrológica, incluindo interpretação de signo do zodíaco, interpretação de planetas e interpretação de casas.\n\n3. A ferramenta também fornece vários gráficos astrológicos, incluindo gráfico celeste, gráfico de ciclo planetário e gráfico do zodíaco.\n\n4. Os usuários podem escolher diferentes ferramentas de análise astrológica e gráficos de acordo com suas necessidades para análise astrológica personalizada.\n\nCasos de uso:\n\n1. Análise astrológica pessoal: Os usuários podem usar o He3 Astrologer para analisar sua própria astrologia, entender seus traços de personalidade, pontos fortes e fracos e tendências de desenvolvimento futuro.\n\n2. Análise de amor e casamento: Os usuários podem usar o He3 Astrologer para analisar amor e casamento, entender a compatibilidade, traços de personalidade e tendências de desenvolvimento futuro entre eles e seus parceiros.\n\n3. Análise de desenvolvimento de carreira: Os usuários podem usar o He3 Astrologer para analisar o desenvolvimento de carreira, entender seus pontos fortes e fracos na carreira e tendências futuras de desenvolvimento de carreira.\n\n4. Pesquisa acadêmica: A astrologia é uma disciplina antiga e misteriosa. Para pesquisadores acadêmicos, usar o He3 Astrologer pode fornecer uma compreensão mais profunda da teoria e prática da astrologia."
    },
    "ru": {
      "$name": "Астролог✨",
      "$keywords": [
        "ИИ",
        "Астрология",
        "Натальная карта",
        "Интерпретация зодиака",
        "Интерпретация планет",
        "Интерпретация домов",
        "Карта неба",
        "Диаграмма цикла планет",
        "Диаграмма зодиака",
        "Персональный астрологический анализ",
        "Анализ любви и брака",
        "Анализ карьерного развития",
        "Академические исследования"
      ],
      "$description": "He3 Astrologer - это инструмент для астрологии. Он может генерировать персональную натальную карту на основе введенных пользователем даты рождения, времени и местоположения, а также предоставлять подробную интерпретацию и анализ.\n\nОсобенности:\n\n1. Пользователи могут ввести свою дату рождения, время и местоположение, и инструмент автоматически рассчитает и сгенерирует персональную натальную карту.\n\n2. Инструмент предоставляет различные инструменты астрологического анализа, включая интерпретацию знаков зодиака, интерпретацию планет и интерпретацию домов.\n\n3. Инструмент также предоставляет различные астрологические диаграммы, включая небесную диаграмму, диаграмму цикла планет и диаграмму зодиака.\n\n4. Пользователи могут выбирать различные инструменты астрологического анализа и диаграммы в соответствии с их потребностями для персонализированного астрологического анализа.\n\nПрименение:\n\n1. Персональный астрологический анализ: пользователи могут использовать He3 Astrologer для анализа своей собственной астрологии, понимания своих личностных черт, сильных и слабых сторон и тенденций будущего развития.\n\n2. Анализ любви и брака: пользователи могут использовать He3 Astrologer для анализа любви и брака, понимания совместимости, личностных черт и тенденций будущего развития между собой и своими партнерами.\n\n3. Анализ карьерного развития: пользователи могут использовать He3 Astrologer для анализа карьерного развития, понимания своих карьерных сильных и слабых сторон и тенденций будущего развития карьеры.\n\n4. Академические исследования: астрология - это древняя и загадочная дисциплина. Для академических исследователей использование He3 Astrologer может обеспечить более глубокое понимание теории и практики астрологии."
    },
    "it": {
      "$name": "Astrologo✨",
      "$keywords": [
        "IA",
        "Astrologia",
        "Carta Natal",
        "Interpretazione dello Zodiaco",
        "Interpretazione dei Pianeti",
        "Interpretazione delle Case",
        "Mappa del Cielo",
        "Grafico del Ciclo Planetario",
        "Grafico dello Zodiaco",
        "Analisi Astrologica Personale",
        "Analisi dell'Amore e del Matrimonio",
        "Analisi dello Sviluppo della Carriera",
        "Ricerca Accademica"
      ],
      "$description": "He3 Astrologer è uno strumento per l'astrologia. Può generare una carta natale personale basata sull'input dell'utente di data di nascita, ora e luogo, e fornire un'interpretazione e un'analisi dettagliata.\n\nCaratteristiche:\n\n1. Gli utenti possono inserire la loro data di nascita, ora e luogo e lo strumento calcolerà automaticamente e genererà una carta natale personale.\n\n2. Lo strumento fornisce vari strumenti di analisi astrologica, tra cui interpretazione del segno zodiacale, interpretazione dei pianeti e interpretazione delle case.\n\n3. Lo strumento fornisce anche vari grafici astrologici, tra cui il grafico celeste, il grafico del ciclo planetario e il grafico zodiacale.\n\n4. Gli utenti possono scegliere diversi strumenti di analisi astrologica e grafici in base alle loro esigenze per un'analisi astrologica personalizzata.\n\nCasi d'uso:\n\n1. Analisi astrologica personale: gli utenti possono utilizzare He3 Astrologer per analizzare la propria astrologia, comprendere i propri tratti di personalità, punti di forza e debolezza e le tendenze future di sviluppo.\n\n2. Analisi dell'amore e del matrimonio: gli utenti possono utilizzare He3 Astrologer per analizzare l'amore e il matrimonio, comprendere la compatibilità, i tratti di personalità e le tendenze future di sviluppo tra loro e i loro partner.\n\n3. Analisi dello sviluppo professionale: gli utenti possono utilizzare He3 Astrologer per analizzare lo sviluppo professionale, comprendere i loro punti di forza e debolezza professionali e le tendenze future di sviluppo professionale.\n\n4. Ricerca accademica: l'astrologia è una disciplina antica e misteriosa. Per i ricercatori accademici, l'utilizzo di He3 Astrologer può fornire una comprensione più profonda della teoria e della pratica dell'astrologia."
    },
    "fr": {
      "$name": "Astrologue✨",
      "$keywords": [
        "IA",
        "Astrologie",
        "Carte natale",
        "Interprétation du zodiaque",
        "Interprétation planétaire",
        "Interprétation de la maison",
        "Carte du ciel",
        "Tableau des cycles planétaires",
        "Tableau du zodiaque",
        "Analyse astrologique personnelle",
        "Analyse de l'amour et du mariage",
        "Analyse du développement de carrière",
        "Recherche académique"
      ],
      "$description": "Il3 Astrologer est un outil pour l'astrologie. Il peut générer une carte natale personnelle basée sur la date, l'heure et le lieu de naissance de l'utilisateur, et fournir une interprétation et une analyse détaillées.\n\nFonctionnalités:\n\n1. Les utilisateurs peuvent entrer leur date de naissance, leur heure de naissance et leur lieu de naissance, et l'outil calculera automatiquement et générera une carte natale personnelle.\n\n2. L'outil fournit divers outils d'analyse astrologique, y compris l'interprétation des signes du zodiaque, l'interprétation des planètes et l'interprétation des maisons.\n\n3. L'outil fournit également diverses cartes astrologiques, y compris la carte céleste, la carte des cycles planétaires et la carte du zodiaque.\n\n4. Les utilisateurs peuvent choisir différents outils d'analyse astrologique et des cartes en fonction de leurs besoins pour une analyse astrologique personnalisée.\n\nCas d'utilisation:\n\n1. Analyse astrologique personnelle: Les utilisateurs peuvent utiliser He3 Astrologer pour analyser leur propre astrologie, comprendre leurs traits de personnalité, leurs forces et leurs faiblesses, et les tendances de développement futures.\n\n2. Analyse de l'amour et du mariage: Les utilisateurs peuvent utiliser He3 Astrologer pour analyser l'amour et le mariage, comprendre la compatibilité, les traits de personnalité et les tendances de développement futures entre eux et leur partenaire.\n\n3. Analyse du développement de carrière: Les utilisateurs peuvent utiliser He3 Astrologer pour analyser le développement de carrière, comprendre leurs forces et leurs faiblesses professionnelles et les tendances futures de développement de carrière.\n\n4. Recherche académique: L'astrologie est une discipline ancienne et mystérieuse. Pour les chercheurs universitaires, l'utilisation de He3 Astrologer peut fournir une compréhension plus profonde de la théorie et de la pratique de l'astrologie."
    },
    "de": {
      "$name": "Astrologe✨",
      "$keywords": [
        "AI",
        "Astrologie",
        "Geburtshoroskop",
        "Zodiac-Interpretation",
        "Planet-Interpretation",
        "Haus-Interpretation",
        "Himmelskarte",
        "Planetary Cycle Chart",
        "Zodiac-Chart",
        "Persönliche astrologische Analyse",
        "Liebes- und Eheanalyse",
        "Karriereentwicklungsanalyse",
        "Akademische Forschung"
      ],
      "$description": "Er3 Astrologe ist ein Werkzeug für Astrologie. Es kann anhand der Eingabe von Geburtsdatum, -zeit und -ort des Benutzers eine persönliche Geburtskarte generieren und detaillierte Interpretationen und Analysen bereitstellen.\n\nFunktionen:\n\n1. Benutzer können ihr Geburtsdatum, ihre Geburtszeit und ihren Geburtsort eingeben, und das Werkzeug berechnet automatisch eine persönliche Geburtskarte.\n\n2. Das Werkzeug bietet verschiedene Astrologie-Analyse-Tools, einschließlich Interpretation des Tierkreiszeichens, Planeten-Interpretation und Haus-Interpretation.\n\n3. Das Werkzeug bietet auch verschiedene Astrologie-Charts, einschließlich Himmelskarte, Planetenzyklus-Karte und Tierkreis-Karte.\n\n4. Benutzer können je nach Bedarf verschiedene Astrologie-Analyse-Tools und -Charts auswählen.\n\nAnwendungsfälle:\n\n1. Persönliche Astrologie-Analyse: Benutzer können He3 Astrologe verwenden, um ihre eigene Astrologie zu analysieren, ihre Persönlichkeitsmerkmale, Stärken und Schwächen sowie zukünftige Entwicklungstrends zu verstehen.\n\n2. Liebe und Ehe-Analyse: Benutzer können He3 Astrologe verwenden, um Liebe und Ehe zu analysieren, die Kompatibilität, Persönlichkeitsmerkmale und zukünftige Entwicklungstrends zwischen sich und ihren Partnern zu verstehen.\n\n3. Karriere-Entwicklungsanalyse: Benutzer können He3 Astrologe verwenden, um Karriere-Entwicklung zu analysieren, ihre Karrierestärken und -schwächen sowie zukünftige Karriere-Entwicklungstrends zu verstehen.\n\n4. Akademische Forschung: Astrologie ist eine alte und mysteriöse Disziplin. Für akademische Forscher kann die Verwendung von He3 Astrologe ein tieferes Verständnis der Theorie und Praxis der Astrologie bieten."
    },
    "ko": {
      "$name": "점성술사✨",
      "$keywords": [
        "인공지능",
        "점성술",
        "태생도",
        "별자리 해석",
        "행성 해석",
        "하우스 해석",
        "하늘 지도",
        "행성 주기 차트",
        "별자리 차트",
        "개인 점성학 분석",
        "사랑과 결혼 분석",
        "직업 발전 분석",
        "학업 연구"
      ],
      "$description": "He3 Astrologer는 점성술에 대한 도구입니다. 사용자의 출생일, 시간 및 위치를 입력하면 개인 태양도를 생성하고 상세한 해석 및 분석을 제공할 수 있습니다.\n\n기능:\n\n1. 사용자는 출생일, 시간 및 위치를 입력하면 도구가 자동으로 개인 태양도를 계산하고 생성합니다.\n\n2. 도구는 별자리 해석, 행성 해석 및 하우스 해석을 포함한 다양한 점성술 분석 도구를 제공합니다.\n\n3. 도구는 천체 차트, 행성 주기 차트 및 별자리 차트를 포함한 다양한 점성술 차트를 제공합니다.\n\n4. 사용자는 맞춤형 점성술 분석을 위해 필요에 따라 다른 점성술 분석 도구 및 차트를 선택할 수 있습니다.\n\n사용 사례:\n\n1. 개인 점성술 분석: 사용자는 He3 Astrologer를 사용하여 자신의 점성술을 분석하고 성격 특성, 장단점 및 미래 발전 동향을 이해할 수 있습니다.\n\n2. 사랑 및 결혼 분석: 사용자는 He3 Astrologer를 사용하여 사랑과 결혼을 분석하고 자신과 파트너 간의 호환성, 성격 특성 및 미래 발전 동향을 이해할 수 있습니다.\n\n3. 직업 발전 분석: 사용자는 He3 Astrologer를 사용하여 직업 발전을 분석하고 자신의 직업 강점 및 약점, 미래 직업 발전 동향을 이해할 수 있습니다.\n\n4. 학술 연구: 점성술은 고대적이고 신비한 학문입니다. 학술 연구자는 He3 Astrologer를 사용하여 점성술 이론과 실제에 대한 깊은 이해를 얻을 수 있습니다."
    },
    "ja": {
      "$name": "占星家✨",
      "$keywords": [
        "AI",
        "占星術",
        "出生図",
        "十二星座の解釈",
        "惑星の解釈",
        "ハウスの解釈",
        "天空地図",
        "惑星サイクルチャート",
        "十二星座チャート",
        "個人の占星術分析",
        "恋愛と結婚の分析",
        "キャリア開発分析",
        "学術研究"
      ],
      "$description": "彼3占星術師は占星術のツールです。ユーザーの生年月日、時間、場所を入力することで、個人の出生図を生成し、詳細な解釈と分析を提供することができます。\n\n特徴：\n\n1. ユーザーは自分の生年月日、時間、場所を入力することができ、ツールは自動的に個人の出生図を計算して生成します。\n\n2. ツールは、星座の解釈、惑星の解釈、ハウスの解釈など、さまざまな占星術分析ツールを提供します。\n\n3. ツールは、天体図、惑星サイクル図、星座図など、さまざまな占星術図を提供します。\n\n4. ユーザーは、個人の占星術分析に必要なさまざまな占星術分析ツールや図を選択することができます。\n\n使用例：\n\n1. 個人の占星術分析：ユーザーはHe3占星術師を使用して、自分自身の占星術を分析し、自分の性格特性、強みや弱み、将来の発展傾向を理解することができます。\n\n2. 恋愛と結婚の分析：ユーザーはHe3占星術師を使用して、恋愛と結婚を分析し、自分自身とパートナーの相性、性格特性、将来の発展傾向を理解することができます。\n\n3. キャリア開発分析：ユーザーはHe3占星術師を使用して、キャリア開発を分析し、自分のキャリアの強みや弱み、将来のキャリア発展の傾向を理解することができます。\n\n4. 学術研究：占星術は古代の神秘的な学問です。学術研究者は、He3占星術師を使用することで、占星術の理論と実践についてより深く理解することができます。"
    },
    "es": {
      "$name": "Astrólogo✨",
      "$keywords": [
        "IA",
        "Astrología",
        "Carta Natal",
        "Interpretación del Zodiaco",
        "Interpretación Planetaria",
        "Interpretación de Casas",
        "Mapa del Cielo",
        "Gráfico de Ciclo Planetario",
        "Gráfico del Zodiaco",
        "Análisis Astrológico Personal",
        "Análisis de Amor y Matrimonio",
        "Análisis de Desarrollo Profesional",
        "Investigación Académica"
      ],
      "$description": "He3 Astrologer es una herramienta para la astrología. Puede generar una carta natal personalizada basada en la fecha, hora y lugar de nacimiento del usuario, y proporcionar una interpretación y análisis detallados.\n\nCaracterísticas:\n\n1. Los usuarios pueden ingresar su fecha de nacimiento, hora y lugar, y la herramienta calculará y generará automáticamente una carta natal personalizada.\n\n2. La herramienta proporciona varias herramientas de análisis astrológico, incluyendo interpretación de signos del zodiaco, interpretación de planetas e interpretación de casas.\n\n3. La herramienta también proporciona varios gráficos astrológicos, incluyendo gráfico celestial, gráfico de ciclo planetario y gráfico del zodiaco.\n\n4. Los usuarios pueden elegir diferentes herramientas de análisis y gráficos astrológicos según sus necesidades para un análisis astrológico personalizado.\n\nCasos de uso:\n\n1. Análisis astrológico personal: Los usuarios pueden usar He3 Astrologer para analizar su propia astrología, comprender sus rasgos de personalidad, fortalezas y debilidades, y las tendencias de desarrollo futuro.\n\n2. Análisis de amor y matrimonio: Los usuarios pueden usar He3 Astrologer para analizar el amor y el matrimonio, comprender la compatibilidad, los rasgos de personalidad y las tendencias de desarrollo futuro entre ellos y sus parejas.\n\n3. Análisis de desarrollo profesional: Los usuarios pueden usar He3 Astrologer para analizar el desarrollo profesional, comprender sus fortalezas y debilidades profesionales y las tendencias de desarrollo profesional futuro.\n\n4. Investigación académica: La astrología es una disciplina antigua y misteriosa. Para los investigadores académicos, el uso de He3 Astrologer puede proporcionar una comprensión más profunda de la teoría y la práctica de la astrología."
    },
    "zh-tw": {
      "$name": "占星師✨",
      "$keywords": [
        "人工智慧",
        "占星術",
        "出生星盤",
        "十二宮解讀",
        "行星解讀",
        "宮位解讀",
        "星空圖",
        "行星週期圖",
        "黃道帶圖",
        "個人占星分析",
        "愛情婚姻分析",
        "職業發展分析",
        "學術研究"
      ],
      "$description": "He3 Astrologer是一個占星學工具，它可以根據用戶輸入的出生日期、時間和地點生成個人出生星盤，並提供詳細的解釋和分析。\n\n功能：\n\n1. 用戶可以輸入他們的出生日期、時間和地點，工具將自動計算並生成個人出生星盤。\n\n2. 工具提供各種占星學分析工具，包括星座解釋、行星解釋和宮位解釋。\n\n3. 工具還提供各種占星學圖表，包括天體圖、行星週期圖和星座圖。\n\n4. 用戶可以根據自己的需要選擇不同的占星學分析工具和圖表進行個性化的占星學分析。\n\n使用案例：\n\n1. 個人占星學分析：用戶可以使用He3 Astrologer分析自己的占星學，了解自己的個性特徵、優點和缺點以及未來的發展趨勢。\n\n2. 愛情和婚姻分析：用戶可以使用He3 Astrologer分析愛情和婚姻，了解自己和伴侶之間的相容性、個性特徵和未來的發展趨勢。\n\n3. 職業發展分析：用戶可以使用He3 Astrologer分析職業發展，了解自己的職業優勢和劣勢以及未來的職業發展趨勢。\n\n4. 學術研究：占星學是一門古老而神秘的學科。對於學術研究人員來說，使用He3 Astrologer可以提供更深入的占星學理論和實踐的理解。"
    },
    "zh-cn": {
      "$name": "占星师✨",
      "$keywords": [
        "人工智能",
        "占星术",
        "出生图",
        "十二宫解读",
        "行星解读",
        "宫位解读",
        "星空图",
        "行星周期图",
        "黄道图",
        "个人占星分析",
        "爱情婚姻分析",
        "职业发展分析",
        "学术研究"
      ],
      "$description": "He3占星师是一款占星工具，可以根据用户输入的出生日期、时间和地点生成个人出生图，并提供详细的解释和分析。\n\n特点：\n\n1. 用户可以输入出生日期、时间和地点，工具将自动计算并生成个人出生图。\n\n2. 工具提供各种占星分析工具，包括星座解释、行星解释和宫位解释。\n\n3. 工具还提供各种占星图表，包括天体图表、行星周期图表和星座图表。\n\n4. 用户可以根据个人需求选择不同的占星分析工具和图表。\n\n使用场景：\n\n1. 个人占星分析：用户可以使用He3占星师分析自己的占星图，了解自己的个性特点、优点和缺点以及未来发展趋势。\n\n2. 爱情和婚姻分析：用户可以使用He3占星师分析爱情和婚姻，了解自己和伴侣之间的兼容性、个性特点和未来发展趋势。\n\n3. 职业发展分析：用户可以使用He3占星师分析职业发展，了解自己的职业优势和劣势以及未来职业发展趋势。\n\n4. 学术研究：占星学是一门古老而神秘的学科。对于学术研究者来说，使用He3占星师可以提供更深入的占星理论和实践理解。"
    }
  },
  {
    "id": "dify-dream",
    "en": {
      "$name": "Dream Analysis",
      "$keywords": [
        "AI",
        "He3 Dream",
        "creative tool",
        "editing tool",
        "export files",
        "materials",
        "brush",
        "eraser",
        "filling"
      ],
      "$description": "He3 Dream Tool is a tool used to create and edit He3 dreams. It can help users create their own He3 dreams and edit and modify them.\n\nFeatures:\n\n1. Create He3 dreams: Users can use the He3 Dream Tool to create their own He3 dreams. The tool provides rich materials and tools to help users create unique dreams.\n\n2. Edit He3 dreams: Users can use the He3 Dream Tool to edit and modify existing He3 dreams. The tool provides various editing tools such as brushes, erasers, and fill tools to help users easily modify their dreams.\n\n3. Export He3 dreams: Users can use the He3 Dream Tool to export their created or edited He3 dreams as He3 files for use in the He3 game.\n\nUse cases:\n\n1. Creating He3 dreams: For users who enjoy creating, the He3 Dream Tool is an excellent choice. Users can use the materials and tools provided in the tool to create their own unique He3 dreams.\n\n2. Modifying He3 dreams: For existing He3 dreams, users can use the He3 Dream Tool to modify and edit them. This is very useful for users who want to improve their dreams or fix some issues.\n\n3. Sharing He3 dreams: Users can use the He3 Dream Tool to export their created or edited He3 dreams as He3 files and share them with other He3 players. This is very useful for users who want to share their creations with other players."
    },
    "pt": {
      "$name": "Análise de sonhos",
      "$keywords": [
        "IA",
        "He3 Dream",
        "ferramenta criativa",
        "ferramenta de edição",
        "exportar arquivos",
        "materiais",
        "pincel",
        "borracha",
        "preenchimento"
      ],
      "$description": "O He3 Dream Tool é uma ferramenta usada para criar e editar sonhos He3. Ele pode ajudar os usuários a criar seus próprios sonhos He3 e editá-los e modificá-los.\n\nRecursos:\n\n1. Criar sonhos He3: Os usuários podem usar o He3 Dream Tool para criar seus próprios sonhos He3. A ferramenta fornece materiais e ferramentas ricas para ajudar os usuários a criar sonhos únicos.\n\n2. Editar sonhos He3: Os usuários podem usar o He3 Dream Tool para editar e modificar sonhos He3 existentes. A ferramenta fornece várias ferramentas de edição, como pincéis, borrachas e ferramentas de preenchimento, para ajudar os usuários a modificar seus sonhos facilmente.\n\n3. Exportar sonhos He3: Os usuários podem usar o He3 Dream Tool para exportar seus sonhos He3 criados ou editados como arquivos He3 para uso no jogo He3.\n\nCasos de uso:\n\n1. Criando sonhos He3: Para usuários que gostam de criar, o He3 Dream Tool é uma excelente escolha. Os usuários podem usar os materiais e ferramentas fornecidos na ferramenta para criar seus próprios sonhos He3 únicos.\n\n2. Modificando sonhos He3: Para sonhos He3 existentes, os usuários podem usar o He3 Dream Tool para modificá-los e editá-los. Isso é muito útil para usuários que desejam melhorar seus sonhos ou corrigir alguns problemas.\n\n3. Compartilhando sonhos He3: Os usuários podem usar o He3 Dream Tool para exportar seus sonhos He3 criados ou editados como arquivos He3 e compartilhá-los com outros jogadores He3. Isso é muito útil para usuários que desejam compartilhar suas criações com outros jogadores."
    },
    "ru": {
      "$name": "Анализ снов",
      "$keywords": [
        "ИИ",
        "He3 Dream",
        "творческий инструмент",
        "инструмент редактирования",
        "экспорт файлов",
        "материалы",
        "кисть",
        "ластик",
        "заливка"
      ],
      "$description": "He3 Dream Tool - это инструмент, используемый для создания и редактирования мечтаний He3. Он может помочь пользователям создавать свои собственные мечты He3 и редактировать и изменять их.\n\nОсобенности:\n\n1. Создание мечтаний He3: Пользователи могут использовать He3 Dream Tool для создания своих собственных мечтаний He3. Инструмент предоставляет богатый выбор материалов и инструментов, чтобы помочь пользователям создавать уникальные мечты.\n\n2. Редактирование мечтаний He3: Пользователи могут использовать He3 Dream Tool для редактирования и изменения существующих мечтаний He3. Инструмент предоставляет различные инструменты редактирования, такие как кисти, ластики и инструменты заливки, чтобы помочь пользователям легко изменять свои мечты.\n\n3. Экспорт мечтаний He3: Пользователи могут использовать He3 Dream Tool для экспорта созданных или измененных мечтаний He3 в виде файлов He3 для использования в игре He3.\n\nПрименение:\n\n1. Создание мечтаний He3: Для пользователей, которые любят создавать, He3 Dream Tool - отличный выбор. Пользователи могут использовать материалы и инструменты, предоставленные в инструменте, для создания своих собственных уникальных мечтаний He3.\n\n2. Изменение мечтаний He3: Для существующих мечтаний He3 пользователи могут использовать He3 Dream Tool для изменения и редактирования их. Это очень полезно для пользователей, которые хотят улучшить свои мечты или исправить некоторые проблемы.\n\n3. Обмен мечтаниями He3: Пользователи могут использовать He3 Dream Tool для экспорта созданных или измененных мечтаний He3 в виде файлов He3 и обмениваться ими с другими игроками He3. Это очень полезно для пользователей, которые хотят поделиться своими творениями с другими игроками."
    },
    "it": {
      "$name": "Analisi dei sogni",
      "$keywords": [
        "AI",
        "He3 Dream",
        "strumento creativo",
        "strumento di editing",
        "esportazione di file",
        "materiali",
        "pennello",
        "gomma",
        "riempimento"
      ],
      "$description": "Il He3 Dream Tool è uno strumento utilizzato per creare e modificare i sogni He3. Può aiutare gli utenti a creare i propri sogni He3 e modificarli.\n\nCaratteristiche:\n\n1. Creare sogni He3: gli utenti possono utilizzare il He3 Dream Tool per creare i propri sogni He3. Lo strumento fornisce materiali e strumenti per aiutare gli utenti a creare sogni unici.\n\n2. Modificare sogni He3: gli utenti possono utilizzare il He3 Dream Tool per modificare e modificare i sogni He3 esistenti. Lo strumento fornisce vari strumenti di modifica come pennelli, gomme e strumenti di riempimento per aiutare gli utenti a modificare facilmente i loro sogni.\n\n3. Esportare sogni He3: gli utenti possono utilizzare il He3 Dream Tool per esportare i loro sogni He3 creati o modificati come file He3 per l'uso nel gioco He3.\n\nCasi d'uso:\n\n1. Creazione di sogni He3: per gli utenti che amano creare, il He3 Dream Tool è un'ottima scelta. Gli utenti possono utilizzare i materiali e gli strumenti forniti nello strumento per creare i propri sogni He3 unici.\n\n2. Modifica di sogni He3: per i sogni He3 esistenti, gli utenti possono utilizzare il He3 Dream Tool per modificarli e modificarli. Questo è molto utile per gli utenti che vogliono migliorare i loro sogni o risolvere alcuni problemi.\n\n3. Condivisione di sogni He3: gli utenti possono utilizzare il He3 Dream Tool per esportare i loro sogni He3 creati o modificati come file He3 e condividerli con altri giocatori di He3. Questo è molto utile per gli utenti che vogliono condividere le proprie creazioni con altri giocatori."
    },
    "fr": {
      "$name": "Analyse des rêves",
      "$keywords": [
        "IA",
        "He3 Dream",
        "outil créatif",
        "outil d'édition",
        "exportation de fichiers",
        "matériaux",
        "pinceau",
        "gomme",
        "remplissage"
      ],
      "$description": "Le He3 Dream Tool est un outil utilisé pour créer et éditer des rêves He3. Il peut aider les utilisateurs à créer leurs propres rêves He3 et à les modifier.\n\nFonctionnalités :\n\n1. Créer des rêves He3 : Les utilisateurs peuvent utiliser le He3 Dream Tool pour créer leurs propres rêves He3. L'outil fournit des matériaux et des outils riches pour aider les utilisateurs à créer des rêves uniques.\n\n2. Modifier des rêves He3 : Les utilisateurs peuvent utiliser le He3 Dream Tool pour modifier et modifier des rêves He3 existants. L'outil fournit divers outils d'édition tels que des pinceaux, des gommes et des outils de remplissage pour aider les utilisateurs à modifier facilement leurs rêves.\n\n3. Exporter des rêves He3 : Les utilisateurs peuvent utiliser le He3 Dream Tool pour exporter leurs rêves He3 créés ou modifiés sous forme de fichiers He3 pour une utilisation dans le jeu He3.\n\nCas d'utilisation :\n\n1. Création de rêves He3 : Pour les utilisateurs qui aiment créer, le He3 Dream Tool est un excellent choix. Les utilisateurs peuvent utiliser les matériaux et les outils fournis dans l'outil pour créer leurs propres rêves He3 uniques.\n\n2. Modification de rêves He3 : Pour les rêves He3 existants, les utilisateurs peuvent utiliser le He3 Dream Tool pour les modifier et les éditer. Cela est très utile pour les utilisateurs qui souhaitent améliorer leurs rêves ou corriger certains problèmes.\n\n3. Partage de rêves He3 : Les utilisateurs peuvent utiliser le He3 Dream Tool pour exporter leurs rêves He3 créés ou modifiés sous forme de fichiers He3 et les partager avec d'autres joueurs He3. Cela est très utile pour les utilisateurs qui souhaitent partager leurs créations avec d'autres joueurs."
    },
    "de": {
      "$name": "Traumdeutung",
      "$keywords": [
        "AI",
        "He3 Dream",
        "kreatives Werkzeug",
        "Bearbeitungswerkzeug",
        "Export von Dateien",
        "Materialien",
        "Pinsel",
        "Radiergummi",
        "Füllung"
      ],
      "$description": "Er3 Dream Tool ist ein Werkzeug, das verwendet wird, um Er3-Träume zu erstellen und zu bearbeiten. Es kann Benutzern helfen, ihre eigenen Er3-Träume zu erstellen und zu bearbeiten und zu modifizieren.\n\nFunktionen:\n\n1. Erstellen von Er3-Träumen: Benutzer können das Er3 Dream Tool verwenden, um ihre eigenen Er3-Träume zu erstellen. Das Tool bietet reichhaltige Materialien und Werkzeuge, um Benutzern bei der Erstellung einzigartiger Träume zu helfen.\n\n2. Bearbeiten von Er3-Träumen: Benutzer können das Er3 Dream Tool verwenden, um vorhandene Er3-Träume zu bearbeiten und zu modifizieren. Das Tool bietet verschiedene Bearbeitungswerkzeuge wie Pinsel, Radiergummis und Füllwerkzeuge, um Benutzern das einfache Modifizieren ihrer Träume zu ermöglichen.\n\n3. Exportieren von Er3-Träumen: Benutzer können das Er3 Dream Tool verwenden, um ihre erstellten oder bearbeiteten Er3-Träume als Er3-Dateien für die Verwendung im Er3-Spiel zu exportieren.\n\nAnwendungsfälle:\n\n1. Erstellen von Er3-Träumen: Für Benutzer, die gerne erstellen, ist das Er3 Dream Tool eine ausgezeichnete Wahl. Benutzer können die im Tool bereitgestellten Materialien und Werkzeuge verwenden, um ihre eigenen einzigartigen Er3-Träume zu erstellen.\n\n2. Bearbeiten von Er3-Träumen: Für vorhandene Er3-Träume können Benutzer das Er3 Dream Tool verwenden, um sie zu modifizieren und zu bearbeiten. Dies ist sehr nützlich für Benutzer, die ihre Träume verbessern oder einige Probleme beheben möchten.\n\n3. Teilen von Er3-Träumen: Benutzer können das Er3 Dream Tool verwenden, um ihre erstellten oder bearbeiteten Er3-Träume als Er3-Dateien zu exportieren und sie mit anderen Er3-Spielern zu teilen. Dies ist sehr nützlich für Benutzer, die ihre Kreationen mit anderen Spielern teilen möchten."
    },
    "ko": {
      "$name": "꿈 해석",
      "$keywords": [
        "인공지능",
        "He3 Dream",
        "창의적인 도구",
        "편집 도구",
        "파일 내보내기",
        "재료",
        "붓",
        "지우개",
        "채우기"
      ],
      "$description": "He3 Dream Tool는 He3 꿈을 만들고 편집하는 데 사용되는 도구입니다. 사용자는 이 도구를 사용하여 자신만의 He3 꿈을 만들고 편집 및 수정할 수 있습니다.\n\n기능:\n\n1. He3 꿈 만들기: 사용자는 He3 Dream Tool을 사용하여 자신만의 He3 꿈을 만들 수 있습니다. 이 도구는 사용자가 독특한 꿈을 만들 수 있도록 다양한 자료와 도구를 제공합니다.\n\n2. He3 꿈 편집하기: 사용자는 He3 Dream Tool을 사용하여 기존의 He3 꿈을 편집하고 수정할 수 있습니다. 이 도구는 브러시, 지우개, 채우기 도구 등 다양한 편집 도구를 제공하여 사용자가 쉽게 꿈을 수정할 수 있도록 도와줍니다.\n\n3. He3 꿈 내보내기: 사용자는 He3 Dream Tool을 사용하여 만든 또는 편집한 He3 꿈을 He3 게임에서 사용할 수 있는 He3 파일로 내보낼 수 있습니다.\n\n사용 사례:\n\n1. He3 꿈 만들기: 창작을 즐기는 사용자에게 He3 Dream Tool은 탁월한 선택입니다. 사용자는 이 도구에서 제공하는 자료와 도구를 사용하여 자신만의 독특한 He3 꿈을 만들 수 있습니다.\n\n2. He3 꿈 수정하기: 기존의 He3 꿈에 대해서는 사용자가 He3 Dream Tool을 사용하여 수정하고 편집할 수 있습니다. 이는 꿈을 개선하거나 문제를 해결하려는 사용자에게 매우 유용합니다.\n\n3. He3 꿈 공유하기: 사용자는 He3 Dream Tool을 사용하여 만든 또는 편집한 He3 꿈을 He3 파일로 내보내어 다른 He3 플레이어와 공유할 수 있습니다. 이는 사용자가 자신의 창작물을 다른 플레이어와 공유하려는 경우 매우 유용합니다."
    },
    "ja": {
      "$name": "夢の解析",
      "$keywords": [
        "AI",
        "He3 Dream",
        "クリエイティブツール",
        "編集ツール",
        "ファイルのエクスポート",
        "素材",
        "ブラシ",
        "消しゴム",
        "塗りつぶし"
      ],
      "$description": "He3ドリームツールは、He3ドリームを作成および編集するためのツールです。ユーザーは自分自身のHe3ドリームを作成し、編集、修正することができます。\n\n特徴：\n\n1. He3ドリームの作成：ユーザーはHe3ドリームツールを使用して、自分自身のHe3ドリームを作成することができます。ツールは、ユーザーがユニークなドリームを作成するのを助ける豊富な素材とツールを提供します。\n\n2. He3ドリームの編集：ユーザーはHe3ドリームツールを使用して、既存のHe3ドリームを編集および修正することができます。ツールは、ブラシ、消しゴム、塗りつぶしツールなどのさまざまな編集ツールを提供し、ユーザーが簡単にドリームを修正できるようにします。\n\n3. He3ドリームのエクスポート：ユーザーはHe3ドリームツールを使用して、作成または編集したHe3ドリームをHe3ファイルとしてエクスポートし、He3ゲームで使用することができます。\n\n使用例：\n\n1. He3ドリームの作成：作成を楽しむユーザーにとって、He3ドリームツールは優れた選択肢です。ツールで提供される素材やツールを使用して、ユーザー自身のユニークなHe3ドリームを作成することができます。\n\n2. He3ドリームの修正：既存のHe3ドリームに対して、ユーザーはHe3ドリームツールを使用して修正や編集を行うことができます。これは、ドリームを改善したり、問題を修正したいユーザーにとって非常に役立ちます。\n\n3. He3ドリームの共有：ユーザーはHe3ドリームツールを使用して、作成または編集したHe3ドリームをHe3ファイルとしてエクスポートし、他のHe3プレイヤーと共有することができます。これは、自分の作品を他のプレイヤーと共有したいユーザーにとって非常に役立ちます。"
    },
    "es": {
      "$name": "Análisis de sueños",
      "$keywords": [
        "IA",
        "He3 Dream",
        "herramienta creativa",
        "herramienta de edición",
        "exportar archivos",
        "materiales",
        "pincel",
        "borrador",
        "relleno"
      ],
      "$description": "El He3 Dream Tool es una herramienta utilizada para crear y editar sueños He3. Puede ayudar a los usuarios a crear sus propios sueños He3 y editarlos y modificarlos.\n\nCaracterísticas:\n\n1. Crear sueños He3: Los usuarios pueden utilizar el He3 Dream Tool para crear sus propios sueños He3. La herramienta proporciona materiales y herramientas ricas para ayudar a los usuarios a crear sueños únicos.\n\n2. Editar sueños He3: Los usuarios pueden utilizar el He3 Dream Tool para editar y modificar los sueños He3 existentes. La herramienta proporciona varias herramientas de edición como pinceles, borradores y herramientas de relleno para ayudar a los usuarios a modificar fácilmente sus sueños.\n\n3. Exportar sueños He3: Los usuarios pueden utilizar el He3 Dream Tool para exportar sus sueños He3 creados o editados como archivos He3 para su uso en el juego He3.\n\nCasos de uso:\n\n1. Crear sueños He3: Para los usuarios que disfrutan creando, el He3 Dream Tool es una excelente opción. Los usuarios pueden utilizar los materiales y herramientas proporcionados en la herramienta para crear sus propios sueños He3 únicos.\n\n2. Modificar sueños He3: Para los sueños He3 existentes, los usuarios pueden utilizar el He3 Dream Tool para modificarlos y editarlos. Esto es muy útil para los usuarios que desean mejorar sus sueños o solucionar algunos problemas.\n\n3. Compartir sueños He3: Los usuarios pueden utilizar el He3 Dream Tool para exportar sus sueños He3 creados o editados como archivos He3 y compartirlos con otros jugadores de He3. Esto es muy útil para los usuarios que desean compartir sus creaciones con otros jugadores."
    },
    "zh-tw": {
      "$name": "夢的解析",
      "$keywords": [
        "人工智慧",
        "He3 Dream",
        "創意工具",
        "編輯工具",
        "匯出檔案",
        "素材",
        "畫筆",
        "橡皮擦",
        "填充"
      ],
      "$description": "He3 Dream Tool是一個用於創建和編輯He3夢想的工具。它可以幫助用戶創建自己的He3夢想並對其進行編輯和修改。\n\n功能：\n\n1. 創建He3夢想：用戶可以使用He3 Dream Tool創建自己的He3夢想。該工具提供豐富的材料和工具，幫助用戶創建獨特的夢想。\n\n2. 編輯He3夢想：用戶可以使用He3 Dream Tool編輯和修改現有的He3夢想。該工具提供各種編輯工具，如筆刷、橡皮擦和填充工具，幫助用戶輕鬆修改夢想。\n\n3. 導出He3夢想：用戶可以使用He3 Dream Tool將創建或編輯的He3夢想導出為He3文件，以在He3遊戲中使用。\n\n用例：\n\n1. 創建He3夢想：對於喜歡創作的用戶來說，He3 Dream Tool是一個很好的選擇。用戶可以使用工具中提供的材料和工具創建自己獨特的He3夢想。\n\n2. 修改He3夢想：對於現有的He3夢想，用戶可以使用He3 Dream Tool進行修改和編輯。這對於想要改進夢想或修復一些問題的用戶非常有用。\n\n3. 分享He3夢想：用戶可以使用He3 Dream Tool將創建或編輯的He3夢想導出為He3文件，並與其他He3玩家分享。這對於想要與其他玩家分享自己的創作的用戶非常有用。"
    },
    "zh-cn": {
      "$name": "梦的解析",
      "$keywords": [
        "人工智能",
        "He3 Dream",
        "创意工具",
        "编辑工具",
        "导出文件",
        "材料",
        "画笔",
        "橡皮擦",
        "填充"
      ],
      "$description": "He3 Dream Tool是一款用于创建和编辑He3梦想的工具。它可以帮助用户创建自己的He3梦想并进行编辑和修改。\n\n功能：\n\n1. 创建He3梦想：用户可以使用He3 Dream Tool创建自己的He3梦想。该工具提供了丰富的材料和工具，帮助用户创建独特的梦想。\n\n2. 编辑He3梦想：用户可以使用He3 Dream Tool编辑和修改现有的He3梦想。该工具提供了各种编辑工具，如画笔、橡皮擦和填充工具，帮助用户轻松修改他们的梦想。\n\n3. 导出He3梦想：用户可以使用He3 Dream Tool将创建或编辑的He3梦想导出为He3文件，以在He3游戏中使用。\n\n用例：\n\n1. 创建He3梦想：对于喜欢创作的用户来说，He3 Dream Tool是一个很好的选择。用户可以使用工具中提供的材料和工具创建自己独特的He3梦想。\n\n2. 修改He3梦想：对于现有的He3梦想，用户可以使用He3 Dream Tool进行修改和编辑。这对于想要改进自己的梦想或修复一些问题的用户非常有用。\n\n3. 分享He3梦想：用户可以使用He3 Dream Tool将创建或编辑的He3梦想导出为He3文件，并与其他He3玩家分享。这对于想要与其他玩家分享自己的创作的用户非常有用。"
    }
  },
  {
    "id": "dify-friend",
    "en": {
      "$name": "A Trusted Friend",
      "$keywords": [
        "AI",
        "Friend List",
        "Friend Operations",
        "Custom Styles",
        "Social Applications",
        "Personal Blog",
        "Online Store"
      ],
      "$description": "He3 friend is a tool used to implement a friend list in Vue.js. It helps users quickly create a friend list and provides some common friend operation functions.\n\nFunction description:\n\n1. Create a friend list: Users can quickly create a friend list, including the friend's avatar, nickname, and personal signature, etc. using the He3 friend tool.\n\n2. Friend operation functions: The tool provides some common friend operation functions, such as adding friends, deleting friends, and modifying friend information.\n\n3. Customizable style: Users can customize the style of the friend list according to their needs, including font, color, background, etc.\n\nUsage scenarios:\n\n1. Social application development: When developing social applications, developers can use the He3 friend tool to quickly create a friend list and provide some common friend operation functions, such as adding friends and deleting friends.\n\n2. Personal blog: In a personal blog, users can use the He3 friend tool to create a friend list, display their friend's information, and provide some common friend operation functions.\n\n3. Online shopping mall: In an online shopping mall, users can use the He3 friend tool to create a friend list, display their friend's information, and provide some common friend operation functions, such as inviting friends and sharing products."
    },
    "pt": {
      "$name": "Um amigo confiável",
      "$keywords": [
        "IA",
        "Lista de Amigos",
        "Operações de Amigos",
        "Estilos Personalizados",
        "Aplicações Sociais",
        "Blog Pessoal",
        "Loja Online"
      ],
      "$description": "O amigo He3 é uma ferramenta usada para implementar uma lista de amigos no Vue.js. Ele ajuda os usuários a criar rapidamente uma lista de amigos e fornece algumas funções comuns de operação de amigos.\n\nDescrição das funções:\n\n1. Criar uma lista de amigos: Os usuários podem criar rapidamente uma lista de amigos, incluindo o avatar do amigo, apelido e assinatura pessoal, etc. usando a ferramenta He3 amigo.\n\n2. Funções de operação de amigos: A ferramenta fornece algumas funções comuns de operação de amigos, como adicionar amigos, excluir amigos e modificar informações de amigos.\n\n3. Estilo personalizável: Os usuários podem personalizar o estilo da lista de amigos de acordo com suas necessidades, incluindo fonte, cor, fundo, etc.\n\nCenários de uso:\n\n1. Desenvolvimento de aplicativos sociais: Ao desenvolver aplicativos sociais, os desenvolvedores podem usar a ferramenta He3 amigo para criar rapidamente uma lista de amigos e fornecer algumas funções comuns de operação de amigos, como adicionar amigos e excluir amigos.\n\n2. Blog pessoal: Em um blog pessoal, os usuários podem usar a ferramenta He3 amigo para criar uma lista de amigos, exibir informações de seus amigos e fornecer algumas funções comuns de operação de amigos.\n\n3. Shopping online: Em um shopping online, os usuários podem usar a ferramenta He3 amigo para criar uma lista de amigos, exibir informações de seus amigos e fornecer algumas funções comuns de operação de amigos, como convidar amigos e compartilhar produtos."
    },
    "ru": {
      "$name": "Надежный друг",
      "$keywords": [
        "ИИ",
        "Список друзей",
        "Операции с друзьями",
        "Пользовательские стили",
        "Социальные приложения",
        "Личный блог",
        "Интернет-магазин"
      ],
      "$description": "Описание функций:\n\n1. Создание списка друзей: Пользователи могут быстро создать список друзей, включая аватар друга, никнейм и личную подпись и т.д., используя инструмент He3 friend.\n\n2. Функции работы с друзьями: Инструмент предоставляет некоторые общие функции работы с друзьями, такие как добавление друзей, удаление друзей и изменение информации о друзьях.\n\n3. Настраиваемый стиль: Пользователи могут настраивать стиль списка друзей в соответствии со своими потребностями, включая шрифт, цвет, фон и т.д.\n\nСценарии использования:\n\n1. Разработка социальных приложений: При разработке социальных приложений разработчики могут использовать инструмент He3 friend для быстрого создания списка друзей и предоставления некоторых общих функций работы с друзьями, таких как добавление друзей и удаление друзей.\n\n2. Личный блог: В личном блоге пользователи могут использовать инструмент He3 friend для создания списка друзей, отображения информации о своих друзьях и предоставления некоторых общих функций работы с друзьями.\n\n3. Интернет-магазин: В интернет-магазине пользователи могут использовать инструмент He3 friend для создания списка друзей, отображения информации о своих друзьях и предоставления некоторых общих функций работы с друзьями, таких как приглашение друзей и обмен продуктами."
    },
    "it": {
      "$name": "Un amico di fiducia",
      "$keywords": [
        "AI",
        "Lista amici",
        "Operazioni amici",
        "Stili personalizzati",
        "Applicazioni social",
        "Blog personale",
        "Negozio online"
      ],
      "$description": "Il tool He3 friend è uno strumento utilizzato per implementare una lista di amici in Vue.js. Aiuta gli utenti a creare rapidamente una lista di amici e fornisce alcune funzioni comuni di gestione degli amici.\n\nDescrizione delle funzioni:\n\n1. Creazione di una lista di amici: gli utenti possono creare rapidamente una lista di amici, inclusi l'avatar dell'amico, il nickname e la firma personale, utilizzando lo strumento He3 friend.\n\n2. Funzioni di gestione degli amici: lo strumento fornisce alcune funzioni comuni di gestione degli amici, come l'aggiunta di amici, la cancellazione di amici e la modifica delle informazioni degli amici.\n\n3. Stile personalizzabile: gli utenti possono personalizzare lo stile della lista di amici in base alle proprie esigenze, inclusi il font, il colore, lo sfondo, ecc.\n\nScenari di utilizzo:\n\n1. Sviluppo di applicazioni social: durante lo sviluppo di applicazioni social, gli sviluppatori possono utilizzare lo strumento He3 friend per creare rapidamente una lista di amici e fornire alcune funzioni comuni di gestione degli amici, come l'aggiunta di amici e la cancellazione di amici.\n\n2. Blog personale: in un blog personale, gli utenti possono utilizzare lo strumento He3 friend per creare una lista di amici, visualizzare le informazioni dei loro amici e fornire alcune funzioni comuni di gestione degli amici.\n\n3. Centro commerciale online: in un centro commerciale online, gli utenti possono utilizzare lo strumento He3 friend per creare una lista di amici, visualizzare le informazioni dei loro amici e fornire alcune funzioni comuni di gestione degli amici, come l'invito di amici e la condivisione di prodotti."
    },
    "fr": {
      "$name": "Un ami de confiance",
      "$keywords": [
        "IA",
        "Liste d'amis",
        "Opérations d'amis",
        "Styles personnalisés",
        "Applications sociales",
        "Blog personnel",
        "Boutique en ligne"
      ],
      "$description": "Son ami est un outil utilisé pour implémenter une liste d'amis dans Vue.js. Il aide les utilisateurs à créer rapidement une liste d'amis et fournit certaines fonctions courantes d'opération d'amis.\n\nDescription des fonctions :\n\n1. Créer une liste d'amis : Les utilisateurs peuvent rapidement créer une liste d'amis, y compris l'avatar de l'ami, le surnom et la signature personnelle, etc. en utilisant l'outil Son ami.\n\n2. Fonctions d'opération d'amis : L'outil fournit certaines fonctions courantes d'opération d'amis, telles que l'ajout d'amis, la suppression d'amis et la modification des informations d'amis.\n\n3. Style personnalisable : Les utilisateurs peuvent personnaliser le style de la liste d'amis selon leurs besoins, y compris la police, la couleur, l'arrière-plan, etc.\n\nScénarios d'utilisation :\n\n1. Développement d'applications sociales : Lors du développement d'applications sociales, les développeurs peuvent utiliser l'outil Son ami pour créer rapidement une liste d'amis et fournir certaines fonctions courantes d'opération d'amis, telles que l'ajout d'amis et la suppression d'amis.\n\n2. Blog personnel : Dans un blog personnel, les utilisateurs peuvent utiliser l'outil Son ami pour créer une liste d'amis, afficher les informations de leurs amis et fournir certaines fonctions courantes d'opération d'amis.\n\n3. Centre commercial en ligne : Dans un centre commercial en ligne, les utilisateurs peuvent utiliser l'outil Son ami pour créer une liste d'amis, afficher les informations de leurs amis et fournir certaines fonctions courantes d'opération d'amis, telles que l'invitation d'amis et le partage de produits."
    },
    "de": {
      "$name": "Ein vertrauter Freund",
      "$keywords": [
        "AI",
        "Freundesliste",
        "Freundesoperationen",
        "Benutzerdefinierte Stile",
        "Soziale Anwendungen",
        "Persönlicher Blog",
        "Online-Shop"
      ],
      "$description": "Er3 Freund ist ein Werkzeug, das verwendet wird, um eine Freundesliste in Vue.js zu implementieren. Es hilft Benutzern, schnell eine Freundesliste zu erstellen und bietet einige gemeinsame Freundesfunktionen.\n\nFunktionsbeschreibung:\n\n1. Erstellen einer Freundesliste: Benutzer können mithilfe des He3-Freund-Tools schnell eine Freundesliste erstellen, einschließlich des Freundes-Avatars, des Spitznamens und der persönlichen Signatur usw.\n\n2. Freundesfunktionen: Das Tool bietet einige gemeinsame Freundesfunktionen wie Hinzufügen von Freunden, Löschen von Freunden und Ändern von Freundesinformationen.\n\n3. Anpassbarer Stil: Benutzer können den Stil der Freundesliste nach ihren Bedürfnissen anpassen, einschließlich Schriftart, Farbe, Hintergrund usw.\n\nAnwendungsszenarien:\n\n1. Entwicklung von Social-Apps: Bei der Entwicklung von Social-Apps können Entwickler das He3-Freund-Tool verwenden, um schnell eine Freundesliste zu erstellen und einige gemeinsame Freundesfunktionen wie Hinzufügen von Freunden und Löschen von Freunden bereitzustellen.\n\n2. Persönlicher Blog: In einem persönlichen Blog können Benutzer das He3-Freund-Tool verwenden, um eine Freundesliste zu erstellen, die Informationen ihrer Freunde anzuzeigen und einige gemeinsame Freundesfunktionen bereitzustellen.\n\n3. Online-Shopping-Mall: In einer Online-Shopping-Mall können Benutzer das He3-Freund-Tool verwenden, um eine Freundesliste zu erstellen, die Informationen ihrer Freunde anzuzeigen und einige gemeinsame Freundesfunktionen wie Einladen von Freunden und Teilen von Produkten bereitzustellen."
    },
    "ko": {
      "$name": "신뢰할 수 있는 친구",
      "$keywords": [
        "인공지능",
        "친구 목록",
        "친구 작업",
        "사용자 정의 스타일",
        "소셜 애플리케이션",
        "개인 블로그",
        "온라인 스토어"
      ],
      "$description": "그의 친구는 Vue.js에서 친구 목록을 구현하는 데 사용되는 도구입니다. He3 친구 도구를 사용하면 사용자가 빠르게 친구 목록을 만들고 일부 일반적인 친구 작업 기능을 제공할 수 있습니다.\n\n기능 설명:\n\n1. 친구 목록 만들기: 사용자는 He3 친구 도구를 사용하여 친구의 아바타, 닉네임, 개인 서명 등을 포함한 친구 목록을 빠르게 만들 수 있습니다.\n\n2. 친구 작업 기능: 도구는 친구 추가, 친구 삭제, 친구 정보 수정 등 일부 일반적인 친구 작업 기능을 제공합니다.\n\n3. 사용자 정의 가능한 스타일: 사용자는 글꼴, 색상, 배경 등을 포함한 친구 목록의 스타일을 필요에 따라 사용자 정의할 수 있습니다.\n\n사용 시나리오:\n\n1. 소셜 애플리케이션 개발: 소셜 애플리케이션을 개발할 때 개발자는 He3 친구 도구를 사용하여 친구 목록을 빠르게 만들고 친구 추가 및 친구 삭제와 같은 일부 일반적인 친구 작업 기능을 제공할 수 있습니다.\n\n2. 개인 블로그: 개인 블로그에서 사용자는 He3 친구 도구를 사용하여 친구 목록을 만들고 친구 정보를 표시하며 친구 추가 및 친구 삭제와 같은 일부 일반적인 친구 작업 기능을 제공할 수 있습니다.\n\n3. 온라인 쇼핑몰: 온라인 쇼핑몰에서 사용자는 He3 친구 도구를 사용하여 친구 목록을 만들고 친구 정보를 표시하며 친구 초대 및 제품 공유와 같은 일부 일반적인 친구 작업 기능을 제공할 수 있습니다."
    },
    "ja": {
      "$name": "信頼できる友人",
      "$keywords": [
        "AI",
        "フレンドリスト",
        "フレンド操作",
        "カスタムスタイル",
        "ソーシャルアプリケーション",
        "パーソナルブログ",
        "オンラインストア"
      ],
      "$description": "彼は友達リストをVue.jsで実装するために使用されるツールであるHe3 friendを持っています。このツールは、ユーザーが素早く友達リストを作成し、一般的な友達操作機能を提供するのに役立ちます。\n\n機能の説明：\n\n1. 友達リストの作成：He3 friendツールを使用して、ユーザーは友達のアバター、ニックネーム、個人的な署名などを含む友達リストを素早く作成できます。\n\n2. 友達操作機能：このツールは、友達を追加、削除、情報を変更するなどの一般的な友達操作機能を提供します。\n\n3. カスタマイズ可能なスタイル：ユーザーは、フォント、色、背景など、必要に応じて友達リストのスタイルをカスタマイズできます。\n\n使用シナリオ：\n\n1. ソーシャルアプリケーションの開発：ソーシャルアプリケーションを開発する際に、開発者はHe3 friendツールを使用して、友達リストを素早く作成し、友達を追加したり削除したりするなどの一般的な友達操作機能を提供できます。\n\n2. 個人ブログ：個人ブログでは、ユーザーはHe3 friendツールを使用して友達リストを作成し、友達の情報を表示し、友達を追加したり削除したりするなどの一般的な友達操作機能を提供できます。\n\n3. オンラインショッピングモール：オンラインショッピングモールでは、ユーザーはHe3 friendツールを使用して友達リストを作成し、友達の情報を表示し、友達を招待したり商品を共有したりするなどの一般的な友達操作機能を提供できます。"
    },
    "es": {
      "$name": "Un amigo de confianza",
      "$keywords": [
        "AI",
        "Lista de amigos",
        "Operaciones de amigos",
        "Estilos personalizados",
        "Aplicaciones sociales",
        "Blog personal",
        "Tienda en línea"
      ],
      "$description": "He3 friend es una herramienta utilizada para implementar una lista de amigos en Vue.js. Ayuda a los usuarios a crear rápidamente una lista de amigos y proporciona algunas funciones comunes de operación de amigos.\n\nDescripción de funciones:\n\n1. Crear una lista de amigos: Los usuarios pueden crear rápidamente una lista de amigos, incluyendo el avatar del amigo, el apodo y la firma personal, etc. utilizando la herramienta He3 friend.\n\n2. Funciones de operación de amigos: La herramienta proporciona algunas funciones comunes de operación de amigos, como agregar amigos, eliminar amigos y modificar la información del amigo.\n\n3. Estilo personalizable: Los usuarios pueden personalizar el estilo de la lista de amigos según sus necesidades, incluyendo la fuente, el color, el fondo, etc.\n\nEscenarios de uso:\n\n1. Desarrollo de aplicaciones sociales: Al desarrollar aplicaciones sociales, los desarrolladores pueden utilizar la herramienta He3 friend para crear rápidamente una lista de amigos y proporcionar algunas funciones comunes de operación de amigos, como agregar amigos y eliminar amigos.\n\n2. Blog personal: En un blog personal, los usuarios pueden utilizar la herramienta He3 friend para crear una lista de amigos, mostrar la información de sus amigos y proporcionar algunas funciones comunes de operación de amigos.\n\n3. Centro comercial en línea: En un centro comercial en línea, los usuarios pueden utilizar la herramienta He3 friend para crear una lista de amigos, mostrar la información de sus amigos y proporcionar algunas funciones comunes de operación de amigos, como invitar amigos y compartir productos."
    },
    "zh-tw": {
      "$name": "一位你的摯友",
      "$keywords": [
        "人工智慧",
        "好友列表",
        "好友操作",
        "自訂樣式",
        "社交應用程式",
        "個人部落格",
        "線上商店"
      ],
      "$description": "He3 friend 是一個用於在 Vue.js 中實現好友列表的工具。它可以幫助用戶快速創建好友列表，並提供一些常見的好友操作功能。\n\n功能描述：\n\n1. 創建好友列表：用戶可以使用 He3 friend 工具快速創建好友列表，包括好友的頭像、暱稱和個人簽名等。\n\n2. 好友操作功能：該工具提供一些常見的好友操作功能，例如添加好友、刪除好友和修改好友信息。\n\n3. 可自定義風格：用戶可以根據自己的需求自定義好友列表的風格，包括字體、顏色、背景等。\n\n使用場景：\n\n1. 社交應用開發：在開發社交應用時，開發人員可以使用 He3 friend 工具快速創建好友列表，並提供一些常見的好友操作功能，例如添加好友和刪除好友。\n\n2. 個人博客：在個人博客中，用戶可以使用 He3 friend 工具創建好友列表，顯示他們的好友信息，並提供一些常見的好友操作功能。\n\n3. 在線購物中心：在線購物中心中，用戶可以使用 He3 friend 工具創建好友列表，顯示他們的好友信息，並提供一些常見的好友操作功能，例如邀請好友和分享產品。"
    },
    "zh-cn": {
      "$name": "一位你的挚友",
      "$keywords": [
        "人工智能",
        "好友列表",
        "好友操作",
        "自定义样式",
        "社交应用",
        "个人博客",
        "在线商店"
      ],
      "$description": "He3 friend是一个用于在Vue.js中实现好友列表的工具。它可以帮助用户快速创建好友列表，并提供一些常见的好友操作功能。\n\n功能描述：\n\n1. 创建好友列表：用户可以使用He3 friend工具快速创建好友列表，包括好友的头像、昵称和个性签名等。\n\n2. 好友操作功能：该工具提供一些常见的好友操作功能，如添加好友、删除好友和修改好友信息等。\n\n3. 可定制的样式：用户可以根据自己的需求自定义好友列表的样式，包括字体、颜色、背景等。\n\n使用场景：\n\n1. 社交应用程序开发：在开发社交应用程序时，开发人员可以使用He3 friend工具快速创建好友列表，并提供一些常见的好友操作功能，如添加好友和删除好友等。\n\n2. 个人博客：在个人博客中，用户可以使用He3 friend工具创建好友列表，显示他们的好友信息，并提供一些常见的好友操作功能。\n\n3. 在线购物商城：在在线购物商城中，用户可以使用He3 friend工具创建好友列表，显示他们的好友信息，并提供一些常见的好友操作功能，如邀请好友和分享产品等。"
    }
  },
  {
    "id": "dify-interviewer",
    "zh-tw": {
      "$name": "AI 模擬面試官",
      "$keywords": [
        "對話",
        "人工智慧",
        "模擬面試官",
        "自然語言處理",
        "面試反饋",
        "面試錄音",
        "面試準備",
        "面試練習",
        "面試評估",
        "面試培訓"
      ],
      "$description": "He3 AI 模擬面試官是一個基於人工智慧的面試模擬工具，可幫助使用者練習面試技巧並準備面試問題。該工具使用自然語言處理技術模擬真實面試場景中的面試官，提供針對性的面試問題和反饋。\n\n功能：\n\n1. 面試模擬：使用者可以選擇不同的面試職位和公司類型進行模擬。該工具將根據使用者的選擇提供相應的面試問題和反饋。\n\n2. 自然語言處理：該工具使用自然語言處理技術理解使用者的答案，並根據答案內容提供相應的反饋和建議。\n\n3. 面試反饋：該工具將根據使用者的答案提供面試反饋和建議。使用者可以根據反饋和建議改進面試技巧和答題策略。\n\n4. 面試記錄：該工具將記錄使用者的面試過程和答案內容。使用者可以隨時查看自己的面試記錄，了解自己的面試表現和進步情況。\n\n應用場景：\n\n1. 面試準備：使用者可以使用 He3 AI 模擬面試官進行面試模擬，提前了解面試問題和反饋，提高面試準備的效率和質量。\n\n2. 面試練習：使用者可以使用該工具進行多次面試練習，提高面試技巧和應對能力。\n\n3. 面試評估：人力資源部門可以使用該工具評估候選人的面試表現和能力，提高面試效率和準確性。\n\n4. 面試培訓：面試培訓機構可以使用該工具進行面試培訓，提高學生的面試技巧和應對能力。"
    },
    "en": {
      "$name": "AI Simulated Interviewer",
      "$keywords": [
        "conversation",
        "AI",
        "Simulated Interviewer",
        "Natural Language Processing",
        "Interview Feedback",
        "Interview Recording",
        "Interview Preparation",
        "Interview Practice",
        "Interview Evaluation",
        "Interview Training"
      ],
      "$description": "He3 AI Simulated Interviewer is an AI-based interview simulation tool that helps users practice interview skills and prepare for interview questions. The tool uses natural language processing technology to simulate interviewers in real interview scenarios, providing targeted interview questions and feedback.\n\nFeatures:\n\n1. Interview simulation: Users can choose different interview positions and company types for simulation. The tool will provide corresponding interview questions and feedback based on the user's selection.\n\n2. Natural language processing: The tool uses natural language processing technology to understand the user's answers and provide corresponding feedback and suggestions based on the answer content.\n\n3. Interview feedback: The tool will provide interview feedback and suggestions based on the user's answers. Users can improve their interview skills and answer strategies based on feedback and suggestions.\n\n4. Interview record: The tool will record the user's interview process and answer content. Users can view their interview records at any time to understand their interview performance and progress.\n\nUse cases:\n\n1. Interview preparation: Users can use He3 AI Simulated Interviewer to simulate interviews, understand interview questions and feedback in advance, and improve the efficiency and quality of interview preparation.\n\n2. Interview practice: Users can use the tool for multiple interview practices to improve their interview skills and response capabilities.\n\n3. Interview evaluation: HR can use the tool to evaluate candidates' interview performance and abilities, improve interview efficiency and accuracy.\n\n4. Interview training: Interview training institutions can use the tool for interview training to improve students' interview skills and response capabilities."
    },
    "pt": {
      "$name": "Entrevistador Simulado de IA",
      "$keywords": [
        "conversa",
        "IA",
        "Entrevistador Simulado",
        "Processamento de Linguagem Natural",
        "Feedback de Entrevista",
        "Gravação de Entrevista",
        "Preparação para Entrevista",
        "Prática de Entrevista",
        "Avaliação de Entrevista",
        "Treinamento de Entrevista"
      ],
      "$description": "O He3 AI Simulated Interviewer é uma ferramenta de simulação de entrevistas baseada em inteligência artificial que ajuda os usuários a praticar habilidades de entrevista e se preparar para perguntas de entrevista. A ferramenta usa tecnologia de processamento de linguagem natural para simular entrevistadores em cenários reais de entrevista, fornecendo perguntas de entrevista direcionadas e feedback.\n\nRecursos:\n\n1. Simulação de entrevista: os usuários podem escolher diferentes posições de entrevista e tipos de empresas para simulação. A ferramenta fornecerá perguntas de entrevista e feedback correspondentes com base na seleção do usuário.\n\n2. Processamento de linguagem natural: a ferramenta usa tecnologia de processamento de linguagem natural para entender as respostas do usuário e fornecer feedback e sugestões correspondentes com base no conteúdo da resposta.\n\n3. Feedback de entrevista: a ferramenta fornecerá feedback e sugestões de entrevista com base nas respostas do usuário. Os usuários podem melhorar suas habilidades de entrevista e estratégias de resposta com base no feedback e sugestões.\n\n4. Registro de entrevista: a ferramenta registrará o processo de entrevista e o conteúdo da resposta do usuário. Os usuários podem visualizar seus registros de entrevista a qualquer momento para entender seu desempenho e progresso na entrevista.\n\nCasos de uso:\n\n1. Preparação para entrevistas: os usuários podem usar o He3 AI Simulated Interviewer para simular entrevistas, entender perguntas de entrevista e feedback com antecedência e melhorar a eficiência e qualidade da preparação para entrevistas.\n\n2. Prática de entrevista: os usuários podem usar a ferramenta para várias práticas de entrevista para melhorar suas habilidades de entrevista e capacidades de resposta.\n\n3. Avaliação de entrevista: os profissionais de RH podem usar a ferramenta para avaliar o desempenho e as habilidades de entrevista dos candidatos, melhorar a eficiência e a precisão da entrevista.\n\n4. Treinamento de entrevista: as instituições de treinamento de entrevista podem usar a ferramenta para treinamento de entrevista para melhorar as habilidades de entrevista e capacidades de resposta dos alunos."
    },
    "ru": {
      "$name": "AI Симулированный интервьюер",
      "$keywords": [
        "разговор",
        "ИИ",
        "Симулятор интервью",
        "обработка естественного языка",
        "обратная связь по интервью",
        "запись интервью",
        "подготовка к интервью",
        "практика интервью",
        "оценка интервью",
        "тренировка интервью"
      ],
      "$description": "He3 AI Simulated Interviewer - это инструмент симуляции интервью на основе искусственного интеллекта, который помогает пользователям отрабатывать навыки интервью и готовиться к вопросам на интервью. Инструмент использует технологию обработки естественного языка для симуляции интервьюеров в реальных сценариях интервью, предоставляя целевые вопросы и обратную связь.\n\nОсобенности:\n\n1. Симуляция интервью: Пользователи могут выбирать различные позиции для интервью и типы компаний для симуляции. Инструмент предоставит соответствующие вопросы на интервью и обратную связь на основе выбора пользователя.\n\n2. Обработка естественного языка: Инструмент использует технологию обработки естественного языка для понимания ответов пользователя и предоставления соответствующей обратной связи и рекомендаций на основе содержания ответа.\n\n3. Обратная связь на интервью: Инструмент предоставит обратную связь и рекомендации на интервью на основе ответов пользователя. Пользователи могут улучшить свои навыки интервью и стратегии ответов на основе обратной связи и рекомендаций.\n\n4. Запись интервью: Инструмент будет записывать процесс интервью пользователя и содержание ответов. Пользователи могут просматривать свои записи интервью в любое время, чтобы понимать свою производительность и прогресс на интервью.\n\nВарианты использования:\n\n1. Подготовка к интервью: Пользователи могут использовать He3 AI Simulated Interviewer для симуляции интервью, понимания вопросов на интервью и обратной связи заранее, и улучшения эффективности и качества подготовки к интервью.\n\n2. Практика интервью: Пользователи могут использовать инструмент для нескольких практик интервью, чтобы улучшить свои навыки интервью и возможности ответа.\n\n3. Оценка интервью: HR может использовать инструмент для оценки производительности и способностей кандидатов на интервью, улучшения эффективности и точности интервью.\n\n4. Тренинг интервью: Учебные заведения могут использовать инструмент для тренинга интервью, чтобы улучшить навыки интервью и возможности ответа студентов."
    },
    "it": {
      "$name": "Intervistatore Simulato di IA",
      "$keywords": [
        "conversazione",
        "AI",
        "Simulated Interviewer",
        "Elaborazione del Linguaggio Naturale",
        "Feedback dell'Intervista",
        "Registrazione dell'Intervista",
        "Preparazione dell'Intervista",
        "Esercitazione dell'Intervista",
        "Valutazione dell'Intervista",
        "Formazione dell'Intervista"
      ],
      "$description": "He3 AI Simulated Interviewer è uno strumento di simulazione di interviste basato sull'IA che aiuta gli utenti a praticare le loro abilità di intervista e prepararsi per le domande dell'intervista. Lo strumento utilizza la tecnologia di elaborazione del linguaggio naturale per simulare intervistatori in scenari di intervista reali, fornendo domande mirate e feedback.\n\nCaratteristiche:\n\n1. Simulazione di interviste: gli utenti possono scegliere diverse posizioni di intervista e tipi di azienda per la simulazione. Lo strumento fornirà domande di intervista e feedback corrispondenti in base alla selezione dell'utente.\n\n2. Elaborazione del linguaggio naturale: lo strumento utilizza la tecnologia di elaborazione del linguaggio naturale per comprendere le risposte dell'utente e fornire feedback e suggerimenti corrispondenti in base al contenuto della risposta.\n\n3. Feedback dell'intervista: lo strumento fornirà feedback e suggerimenti sull'intervista in base alle risposte dell'utente. Gli utenti possono migliorare le loro abilità di intervista e le strategie di risposta in base ai feedback e ai suggerimenti.\n\n4. Registrazione dell'intervista: lo strumento registrerà il processo di intervista e il contenuto delle risposte dell'utente. Gli utenti possono visualizzare i loro record di intervista in qualsiasi momento per capire le loro prestazioni e il progresso dell'intervista.\n\nCasi d'uso:\n\n1. Preparazione all'intervista: gli utenti possono utilizzare He3 AI Simulated Interviewer per simulare interviste, comprendere le domande dell'intervista e il feedback in anticipo e migliorare l'efficienza e la qualità della preparazione all'intervista.\n\n2. Pratica dell'intervista: gli utenti possono utilizzare lo strumento per molteplici pratiche di intervista per migliorare le loro abilità di intervista e le capacità di risposta.\n\n3. Valutazione dell'intervista: le risorse umane possono utilizzare lo strumento per valutare le prestazioni e le capacità di intervista dei candidati, migliorare l'efficienza e l'accuratezza dell'intervista.\n\n4. Formazione all'intervista: le istituzioni di formazione all'intervista possono utilizzare lo strumento per la formazione all'intervista per migliorare le abilità di intervista e le capacità di risposta degli studenti."
    },
    "fr": {
      "$name": "Intervieweur Simulé IA",
      "$keywords": [
        "conversation",
        "IA",
        "Simulateur d'entretien",
        "Traitement du langage naturel",
        "Feedback d'entretien",
        "Enregistrement d'entretien",
        "Préparation d'entretien",
        "Pratique d'entretien",
        "Évaluation d'entretien",
        "Formation d'entretien"
      ],
      "$description": "He3 AI Simulated Interviewer est un outil de simulation d'entretien basé sur l'IA qui aide les utilisateurs à pratiquer leurs compétences d'entretien et à se préparer aux questions d'entretien. L'outil utilise la technologie de traitement du langage naturel pour simuler des intervieweurs dans des scénarios d'entretien réels, en fournissant des questions d'entretien ciblées et des commentaires.\n\nFonctionnalités :\n\n1. Simulation d'entretien : Les utilisateurs peuvent choisir différents postes d'entretien et types d'entreprises pour la simulation. L'outil fournira des questions d'entretien et des commentaires correspondants en fonction de la sélection de l'utilisateur.\n\n2. Traitement du langage naturel : L'outil utilise la technologie de traitement du langage naturel pour comprendre les réponses de l'utilisateur et fournir des commentaires et des suggestions correspondants en fonction du contenu de la réponse.\n\n3. Commentaires d'entretien : L'outil fournira des commentaires et des suggestions d'entretien en fonction des réponses de l'utilisateur. Les utilisateurs peuvent améliorer leurs compétences d'entretien et leurs stratégies de réponse en fonction des commentaires et des suggestions.\n\n4. Enregistrement d'entretien : L'outil enregistrera le processus d'entretien de l'utilisateur et le contenu de la réponse. Les utilisateurs peuvent consulter leurs enregistrements d'entretien à tout moment pour comprendre leur performance et leur progression en matière d'entretien.\n\nCas d'utilisation :\n\n1. Préparation à l'entretien : Les utilisateurs peuvent utiliser He3 AI Simulated Interviewer pour simuler des entretiens, comprendre les questions d'entretien et les commentaires à l'avance, et améliorer l'efficacité et la qualité de la préparation à l'entretien.\n\n2. Pratique d'entretien : Les utilisateurs peuvent utiliser l'outil pour plusieurs pratiques d'entretien afin d'améliorer leurs compétences d'entretien et leurs capacités de réponse.\n\n3. Évaluation d'entretien : Les RH peuvent utiliser l'outil pour évaluer la performance et les capacités d'entretien des candidats, améliorer l'efficacité et la précision de l'entretien.\n\n4. Formation à l'entretien : Les institutions de formation à l'entretien peuvent utiliser l'outil pour la formation à l'entretien afin d'améliorer les compétences d'entretien et les capacités de réponse des étudiants."
    },
    "de": {
      "$name": "KI-Simulierter Interviewer",
      "$keywords": [
        "Konversation",
        "KI",
        "Simulierter Interviewer",
        "Natürliche Sprachverarbeitung",
        "Interview-Feedback",
        "Interview-Aufzeichnung",
        "Interview-Vorbereitung",
        "Interview-Übung",
        "Interview-Bewertung",
        "Interview-Training"
      ],
      "$description": "He3 AI Simulated Interviewer ist ein auf KI basierendes Interview-Simulationswerkzeug, das Benutzern hilft, ihre Interviewfähigkeiten zu üben und sich auf Interviewfragen vorzubereiten. Das Werkzeug verwendet Technologie zur natürlichen Sprachverarbeitung, um Interviewer in realen Interview-Szenarien zu simulieren und gezielte Interviewfragen und Feedback zu bieten.\n\nFunktionen:\n\n1. Interview-Simulation: Benutzer können verschiedene Interviewpositionen und Unternehmensarten für die Simulation auswählen. Das Werkzeug bietet entsprechende Interviewfragen und Feedback basierend auf der Auswahl des Benutzers.\n\n2. Natürliche Sprachverarbeitung: Das Werkzeug verwendet Technologie zur natürlichen Sprachverarbeitung, um die Antworten des Benutzers zu verstehen und entsprechendes Feedback und Vorschläge basierend auf dem Inhalt der Antwort zu geben.\n\n3. Interview-Feedback: Das Werkzeug gibt Interview-Feedback und Vorschläge basierend auf den Antworten des Benutzers. Benutzer können ihre Interviewfähigkeiten und Antwortstrategien basierend auf Feedback und Vorschlägen verbessern.\n\n4. Interview-Aufzeichnung: Das Werkzeug zeichnet den Interviewprozess und den Inhalt der Antworten des Benutzers auf. Benutzer können ihre Interviewaufzeichnungen jederzeit einsehen, um ihre Interviewleistung und ihren Fortschritt zu verstehen.\n\nAnwendungsfälle:\n\n1. Interview-Vorbereitung: Benutzer können He3 AI Simulated Interviewer verwenden, um Interviews zu simulieren, Interviewfragen und Feedback im Voraus zu verstehen und die Effizienz und Qualität der Interviewvorbereitung zu verbessern.\n\n2. Interview-Praxis: Benutzer können das Werkzeug für mehrere Interview-Praktiken verwenden, um ihre Interviewfähigkeiten und Reaktionsfähigkeiten zu verbessern.\n\n3. Interview-Bewertung: HR kann das Werkzeug verwenden, um die Interviewleistung und -fähigkeiten von Kandidaten zu bewerten, die Effizienz und Genauigkeit von Interviews zu verbessern.\n\n4. Interview-Training: Interview-Trainingsinstitute können das Werkzeug für Interview-Training verwenden, um die Interviewfähigkeiten und Reaktionsfähigkeiten von Studenten zu verbessern."
    },
    "ko": {
      "$name": "AI 모의 면접관",
      "$keywords": [
        "대화",
        "인공지능",
        "시뮬레이션 면접관",
        "자연어 처리",
        "면접 피드백",
        "면접 녹음",
        "면접 준비",
        "면접 연습",
        "면접 평가",
        "면접 훈련"
      ],
      "$description": "He3 AI Simulated Interviewer는 AI 기반의 인터뷰 시뮬레이션 도구로, 사용자들이 인터뷰 기술을 연습하고 인터뷰 질문에 대비할 수 있도록 도와줍니다. 이 도구는 자연어 처리 기술을 사용하여 실제 인터뷰 상황에서 인터뷰어를 시뮬레이션하며, 대상 인터뷰 질문과 피드백을 제공합니다.\n\n기능:\n\n1. 인터뷰 시뮬레이션: 사용자는 시뮬레이션을 위해 다른 인터뷰 포지션과 회사 유형을 선택할 수 있습니다. 이 도구는 사용자의 선택에 따라 해당하는 인터뷰 질문과 피드백을 제공합니다.\n\n2. 자연어 처리: 이 도구는 자연어 처리 기술을 사용하여 사용자의 답변을 이해하고, 답변 내용에 따라 해당하는 피드백과 제안을 제공합니다.\n\n3. 인터뷰 피드백: 이 도구는 사용자의 답변에 따라 인터뷰 피드백과 제안을 제공합니다. 사용자는 피드백과 제안을 기반으로 인터뷰 기술과 답변 전략을 개선할 수 있습니다.\n\n4. 인터뷰 기록: 이 도구는 사용자의 인터뷰 과정과 답변 내용을 기록합니다. 사용자는 언제든지 자신의 인터뷰 기록을 확인하여 인터뷰 성과와 진행 상황을 이해할 수 있습니다.\n\n사용 사례:\n\n1. 인터뷰 준비: 사용자는 He3 AI Simulated Interviewer를 사용하여 인터뷰를 시뮬레이션하고, 인터뷰 질문과 피드백을 미리 이해하여 인터뷰 준비의 효율성과 품질을 개선할 수 있습니다.\n\n2. 인터뷰 연습: 사용자는 이 도구를 여러 번 사용하여 인터뷰 기술과 대응 능력을 개선할 수 있습니다.\n\n3. 인터뷰 평가: 인사 담당자는 이 도구를 사용하여 지원자의 인터뷰 성과와 능력을 평가하고, 인터뷰 효율성과 정확성을 개선할 수 있습니다.\n\n4. 인터뷰 훈련: 인터뷰 훈련 기관은 이 도구를 사용하여 학생들의 인터뷰 기술과 대응 능력을 개선할 수 있습니다."
    },
    "ja": {
      "$name": "AIシミュレート面接官",
      "$keywords": [
        "会話",
        "AI",
        "シミュレートされた面接官",
        "自然言語処理",
        "面接フィードバック",
        "面接録音",
        "面接準備",
        "面接練習",
        "面接評価",
        "面接トレーニング"
      ],
      "$description": "He3 AI Simulated Interviewerは、AIベースの面接シミュレーションツールで、ユーザーが面接スキルを練習し、面接の質問に備えるのを支援します。このツールは、自然言語処理技術を使用して、実際の面接シナリオで面接官をシミュレートし、ターゲットとなる面接質問とフィードバックを提供します。\n\n特徴：\n\n1. 面接シミュレーション：ユーザーは、異なる面接のポジションや企業タイプを選択してシミュレーションできます。ツールは、ユーザーの選択に基づいて対応する面接質問とフィードバックを提供します。\n\n2. 自然言語処理：ツールは、自然言語処理技術を使用して、ユーザーの回答を理解し、回答内容に基づいて対応するフィードバックや提案を提供します。\n\n3. 面接フィードバック：ツールは、ユーザーの回答に基づいて面接フィードバックや提案を提供します。ユーザーは、フィードバックや提案に基づいて面接スキルや回答戦略を改善できます。\n\n4. 面接記録：ツールは、ユーザーの面接プロセスと回答内容を記録します。ユーザーは、いつでも自分の面接記録を確認して、面接のパフォーマンスや進捗状況を理解できます。\n\n使用例：\n\n1. 面接の準備：ユーザーは、He3 AI Simulated Interviewerを使用して面接をシミュレートし、面接質問やフィードバックを事前に理解し、面接の準備の効率と質を向上させることができます。\n\n2. 面接の練習：ユーザーは、複数の面接練習にこのツールを使用して、面接スキルや回答能力を向上させることができます。\n\n3. 面接の評価：人事部門は、このツールを使用して、候補者の面接パフォーマンスや能力を評価し、面接の効率と正確性を向上させることができます。\n\n4. 面接のトレーニング：面接トレーニング機関は、このツールを使用して、学生の面接スキルや回答能力を向上させるための面接トレーニングを行うことができます。"
    },
    "es": {
      "$name": "Entrevistador Simulado de IA",
      "$keywords": [
        "conversación",
        "IA",
        "Entrevistador Simulado",
        "Procesamiento de Lenguaje Natural",
        "Retroalimentación de Entrevistas",
        "Grabación de Entrevistas",
        "Preparación de Entrevistas",
        "Práctica de Entrevistas",
        "Evaluación de Entrevistas",
        "Entrenamiento de Entrevistas"
      ],
      "$description": "He3 AI Simulated Interviewer es una herramienta de simulación de entrevistas basada en inteligencia artificial que ayuda a los usuarios a practicar habilidades de entrevista y prepararse para preguntas de entrevista. La herramienta utiliza tecnología de procesamiento de lenguaje natural para simular entrevistadores en escenarios de entrevista reales, proporcionando preguntas de entrevista dirigidas y retroalimentación.\n\nCaracterísticas:\n\n1. Simulación de entrevistas: los usuarios pueden elegir diferentes posiciones de entrevista y tipos de empresas para la simulación. La herramienta proporcionará preguntas de entrevista y retroalimentación correspondientes en función de la selección del usuario.\n\n2. Procesamiento de lenguaje natural: la herramienta utiliza tecnología de procesamiento de lenguaje natural para comprender las respuestas del usuario y proporcionar retroalimentación y sugerencias correspondientes en función del contenido de la respuesta.\n\n3. Retroalimentación de entrevistas: la herramienta proporcionará retroalimentación y sugerencias de entrevista en función de las respuestas del usuario. Los usuarios pueden mejorar sus habilidades de entrevista y estrategias de respuesta en función de la retroalimentación y sugerencias.\n\n4. Registro de entrevistas: la herramienta registrará el proceso de entrevista y el contenido de las respuestas del usuario. Los usuarios pueden ver sus registros de entrevista en cualquier momento para comprender su desempeño y progreso en la entrevista.\n\nCasos de uso:\n\n1. Preparación de entrevistas: los usuarios pueden utilizar He3 AI Simulated Interviewer para simular entrevistas, comprender preguntas de entrevista y retroalimentación de antemano, y mejorar la eficiencia y calidad de la preparación de entrevistas.\n\n2. Práctica de entrevistas: los usuarios pueden utilizar la herramienta para múltiples prácticas de entrevistas para mejorar sus habilidades de entrevista y capacidades de respuesta.\n\n3. Evaluación de entrevistas: los departamentos de recursos humanos pueden utilizar la herramienta para evaluar el desempeño y las habilidades de entrevista de los candidatos, mejorar la eficiencia y precisión de la entrevista.\n\n4. Entrenamiento de entrevistas: las instituciones de entrenamiento de entrevistas pueden utilizar la herramienta para el entrenamiento de entrevistas y mejorar las habilidades de entrevista y capacidades de respuesta de los estudiantes."
    },
    "zh-cn": {
      "$name": "AI 模拟面试官",
      "$keywords": [
        "对话",
        "人工智能",
        "模拟面试官",
        "自然语言处理",
        "面试反馈",
        "面试录音",
        "面试准备",
        "面试练习",
        "面试评估",
        "面试培训"
      ],
      "$description": "He3 AI模拟面试官是一款基于人工智能的面试模拟工具，帮助用户练习面试技巧并准备面试问题。该工具使用自然语言处理技术模拟真实面试场景中的面试官，提供有针对性的面试问题和反馈。\n\n功能：\n\n1. 面试模拟：用户可以选择不同的面试职位和公司类型进行模拟。该工具将根据用户的选择提供相应的面试问题和反馈。\n\n2. 自然语言处理：该工具使用自然语言处理技术理解用户的答案，并根据答案内容提供相应的反馈和建议。\n\n3. 面试反馈：该工具将根据用户的答案提供面试反馈和建议。用户可以根据反馈和建议改进面试技巧和答题策略。\n\n4. 面试记录：该工具将记录用户的面试过程和答案内容。用户可以随时查看自己的面试记录，了解自己的面试表现和进步情况。\n\n应用场景：\n\n1. 面试准备：用户可以使用He3 AI模拟面试官进行面试模拟，提前了解面试问题和反馈，提高面试准备的效率和质量。\n\n2. 面试练习：用户可以使用该工具进行多次面试练习，提高面试技巧和应对能力。\n\n3. 面试评估：人力资源部门可以使用该工具评估候选人的面试表现和能力，提高面试效率和准确性。\n\n4. 面试培训：面试培训机构可以使用该工具进行面试培训，提高学生的面试技巧和应对能力。"
    }
  },
  {
    "id": "dify-leader-word-translator",
    "en": {
      "$name": "Leadership Jargon Interpreter",
      "$keywords": [
        "conversation",
        "AI",
        "Leadership language",
        "Business occasions",
        "English word conversion",
        "Business letters",
        "Business reports",
        "Professionalism",
        "Standardization"
      ],
      "$description": "He3 leader word translator is a tool that converts English words into leadership language. It can convert the input English words into leadership language, making them more in line with the language norms of business occasions.\n\nFeatures:\n\n1. Enter the English words that need to be converted into the tool.\n\n2. The tool will automatically convert English words into leadership language.\n\n3. The converted leadership language will be displayed in the output area of the tool.\n\nUse cases:\n\n1. Business occasions: In business occasions, using standardized leadership language can improve communication efficiency and professionalism. Using He3 leader word translator tool can quickly convert English words into leadership language, making communication smoother.\n\n2. Business letters: When writing business letters, using standardized leadership language can improve the formality and professionalism of the letter. Using He3 leader word translator tool can quickly convert the English words that need to be used into leadership language, making the letter more standardized.\n\n3. Business reports: When writing business reports, using standardized leadership language can improve the professionalism and readability of the report. Using He3 leader word translator tool can quickly convert the English words that need to be used into leadership language, making the report more standardized."
    },
    "pt": {
      "$name": "Intérprete de Jargão de Liderança",
      "$keywords": [
        "conversação",
        "IA",
        "Linguagem de liderança",
        "Ocasiões de negócios",
        "Conversão de palavras em inglês",
        "Cartas de negócios",
        "Relatórios de negócios",
        "Profissionalismo",
        "Padronização"
      ],
      "$description": "O He3 líder tradutor de palavras é uma ferramenta que converte palavras em inglês para a linguagem de liderança. Ele pode converter as palavras em inglês inseridas na ferramenta para a linguagem de liderança, tornando-as mais adequadas às normas de linguagem em ocasiões de negócios.\n\nRecursos:\n\n1. Insira as palavras em inglês que precisam ser convertidas na ferramenta.\n\n2. A ferramenta converterá automaticamente as palavras em inglês para a linguagem de liderança.\n\n3. A linguagem de liderança convertida será exibida na área de saída da ferramenta.\n\nCasos de uso:\n\n1. Ocasiões de negócios: Em ocasiões de negócios, o uso de linguagem de liderança padronizada pode melhorar a eficiência e profissionalismo da comunicação. Usando a ferramenta He3 líder tradutor de palavras, as palavras em inglês podem ser rapidamente convertidas para a linguagem de liderança, tornando a comunicação mais suave.\n\n2. Cartas de negócios: Ao escrever cartas de negócios, o uso de linguagem de liderança padronizada pode melhorar a formalidade e profissionalismo da carta. Usando a ferramenta He3 líder tradutor de palavras, as palavras em inglês que precisam ser usadas podem ser rapidamente convertidas para a linguagem de liderança, tornando a carta mais padronizada.\n\n3. Relatórios de negócios: Ao escrever relatórios de negócios, o uso de linguagem de liderança padronizada pode melhorar o profissionalismo e a legibilidade do relatório. Usando a ferramenta He3 líder tradutor de palavras, as palavras em inglês que precisam ser usadas podem ser rapidamente convertidas para a linguagem de liderança, tornando o relatório mais padronizado."
    },
    "ru": {
      "$name": "Интерпретатор лидерского жаргона",
      "$keywords": [
        "разговор",
        "ИИ",
        "язык лидерства",
        "деловые случаи",
        "перевод английских слов",
        "деловые письма",
        "бизнес-отчеты",
        "профессионализм",
        "стандартизация"
      ],
      "$description": "He3 лидер-слово переводчик - это инструмент, который преобразует английские слова в язык лидерства. Он может преобразовывать вводимые английские слова в язык лидерства, делая их более соответствующими языковым нормам деловых мероприятий.\n\nОсобенности:\n\n1. Введите английские слова, которые нужно преобразовать в инструмент.\n\n2. Инструмент автоматически преобразует английские слова в язык лидерства.\n\n3. Преобразованный язык лидерства будет отображаться в выходной области инструмента.\n\nПрименение:\n\n1. Деловые мероприятия: На деловых мероприятиях использование стандартизированного языка лидерства может улучшить эффективность коммуникации и профессионализм. Использование инструмента He3 лидер-слово переводчик может быстро преобразовать английские слова в язык лидерства, делая коммуникацию более гладкой.\n\n2. Деловые письма: При написании деловых писем использование стандартизированного языка лидерства может улучшить формальность и профессионализм письма. Использование инструмента He3 лидер-слово переводчик может быстро преобразовать английские слова, которые нужно использовать, в язык лидерства, делая письмо более стандартизированным.\n\n3. Деловые отчеты: При написании деловых отчетов использование стандартизированного языка лидерства может улучшить профессионализм и читаемость отчета. Использование инструмента He3 лидер-слово переводчик может быстро преобразовать английские слова, которые нужно использовать, в язык лидерства, делая отчет более стандартизированным."
    },
    "it": {
      "$name": "Interprete di gergo di leadership",
      "$keywords": [
        "conversazione",
        "IA",
        "Linguaggio di leadership",
        "Occasioni di business",
        "Conversione di parole inglesi",
        "Lettere di affari",
        "Rapporti di affari",
        "Professionalità",
        "Standardizzazione"
      ],
      "$description": "Il traduttore di parole di leadership He3 è uno strumento che converte le parole inglesi in linguaggio di leadership. Può convertire le parole inglesi in linguaggio di leadership, rendendole più conformi alle norme linguistiche delle occasioni aziendali.\n\nCaratteristiche:\n\n1. Inserisci le parole inglesi che devono essere convertite nello strumento.\n\n2. Lo strumento convertirà automaticamente le parole inglesi in linguaggio di leadership.\n\n3. Il linguaggio di leadership convertito verrà visualizzato nell'area di output dello strumento.\n\nCasi d'uso:\n\n1. Occasioni aziendali: nelle occasioni aziendali, l'uso di un linguaggio di leadership standardizzato può migliorare l'efficienza della comunicazione e la professionalità. Utilizzando lo strumento di traduzione di parole di leadership He3, è possibile convertire rapidamente le parole inglesi in linguaggio di leadership, rendendo la comunicazione più fluida.\n\n2. Lettere aziendali: quando si scrivono lettere aziendali, l'uso di un linguaggio di leadership standardizzato può migliorare la formalità e la professionalità della lettera. Utilizzando lo strumento di traduzione di parole di leadership He3, è possibile convertire rapidamente le parole inglesi che devono essere utilizzate in linguaggio di leadership, rendendo la lettera più standardizzata.\n\n3. Rapporti aziendali: quando si scrivono rapporti aziendali, l'uso di un linguaggio di leadership standardizzato può migliorare la professionalità e la leggibilità del rapporto. Utilizzando lo strumento di traduzione di parole di leadership He3, è possibile convertire rapidamente le parole inglesi che devono essere utilizzate in linguaggio di leadership, rendendo il rapporto più standardizzato."
    },
    "fr": {
      "$name": "Interprète de jargon de leadership",
      "$keywords": [
        "conversation",
        "IA",
        "Langage de leadership",
        "Occasions d'affaires",
        "Conversion de mots anglais",
        "Lettres d'affaires",
        "Rapports d'affaires",
        "Professionnalisme",
        "Standardisation"
      ],
      "$description": "Le traducteur de mots de leader He3 est un outil qui convertit les mots anglais en langage de leadership. Il peut convertir les mots anglais en langage de leadership, les rendant ainsi plus conformes aux normes linguistiques des occasions d'affaires.\n\nCaractéristiques :\n\n1. Entrez les mots anglais à convertir dans l'outil.\n\n2. L'outil convertira automatiquement les mots anglais en langage de leadership.\n\n3. Le langage de leadership converti sera affiché dans la zone de sortie de l'outil.\n\nCas d'utilisation :\n\n1. Occasions d'affaires : Dans les occasions d'affaires, l'utilisation d'un langage de leadership normalisé peut améliorer l'efficacité de la communication et le professionnalisme. En utilisant l'outil de traduction de mots de leader He3, les mots anglais peuvent être rapidement convertis en langage de leadership, rendant la communication plus fluide.\n\n2. Lettres d'affaires : Lors de la rédaction de lettres d'affaires, l'utilisation d'un langage de leadership normalisé peut améliorer la formalité et le professionnalisme de la lettre. En utilisant l'outil de traduction de mots de leader He3, les mots anglais nécessaires peuvent être rapidement convertis en langage de leadership, rendant la lettre plus normalisée.\n\n3. Rapports d'affaires : Lors de la rédaction de rapports d'affaires, l'utilisation d'un langage de leadership normalisé peut améliorer le professionnalisme et la lisibilité du rapport. En utilisant l'outil de traduction de mots de leader He3, les mots anglais nécessaires peuvent être rapidement convertis en langage de leadership, rendant le rapport plus normalisé."
    },
    "de": {
      "$name": "Führungsjargon-Interpreter",
      "$keywords": [
        "Konversation",
        "KI",
        "Führungssprache",
        "Geschäftliche Anlässe",
        "Englische Wortumwandlung",
        "Geschäftsbriefe",
        "Geschäftsberichte",
        "Professionalität",
        "Standardisierung"
      ],
      "$description": "Er ist ein Führungs-Wortübersetzer, der ein Werkzeug ist, das englische Wörter in Führungssprache umwandelt. Es kann die eingegebenen englischen Wörter in Führungssprache umwandeln und sie somit besser an die Sprachnormen von Geschäftsanlässen anpassen.\n\nFunktionen:\n\n1. Geben Sie die englischen Wörter ein, die in das Werkzeug umgewandelt werden müssen.\n\n2. Das Werkzeug wandelt die englischen Wörter automatisch in Führungssprache um.\n\n3. Die umgewandelte Führungssprache wird im Ausgabe-Bereich des Werkzeugs angezeigt.\n\nAnwendungsfälle:\n\n1. Geschäftsanlässe: Bei Geschäftsanlässen kann die Verwendung standardisierter Führungssprache die Kommunikationseffizienz und Professionalität verbessern. Mit dem He3 Führungs-Wortübersetzer-Tool können englische Wörter schnell in Führungssprache umgewandelt werden, um die Kommunikation zu erleichtern.\n\n2. Geschäftsbriefe: Beim Schreiben von Geschäftsbriefen kann die Verwendung standardisierter Führungssprache die Formalität und Professionalität des Briefes verbessern. Mit dem He3 Führungs-Wortübersetzer-Tool können die englischen Wörter, die verwendet werden müssen, schnell in Führungssprache umgewandelt werden, um den Brief zu standardisieren.\n\n3. Geschäftsberichte: Beim Schreiben von Geschäftsberichten kann die Verwendung standardisierter Führungssprache die Professionalität und Lesbarkeit des Berichts verbessern. Mit dem He3 Führungs-Wortübersetzer-Tool können die englischen Wörter, die verwendet werden müssen, schnell in Führungssprache umgewandelt werden, um den Bericht zu standardisieren."
    },
    "ko": {
      "$name": "리더십 조언 해석기",
      "$keywords": [
        "대화",
        "인공지능",
        "리더십 언어",
        "비즈니스 행사",
        "영어 단어 변환",
        "비즈니스 편지",
        "비즈니스 보고서",
        "전문성",
        "표준화"
      ],
      "$description": "He3 리더 워드 번역기는 영어 단어를 리더십 언어로 변환하는 도구입니다. 이 도구는 입력된 영어 단어를 리더십 언어로 자동으로 변환하여 비즈니스 상황에서의 언어 규범에 더욱 부합하도록 만들어줍니다.\n\n특징:\n\n1. 변환해야 할 영어 단어를 도구에 입력합니다.\n\n2. 도구는 자동으로 영어 단어를 리더십 언어로 변환합니다.\n\n3. 변환된 리더십 언어는 도구의 출력 영역에 표시됩니다.\n\n사용 사례:\n\n1. 비즈니스 상황: 비즈니스 상황에서 표준화된 리더십 언어를 사용하면 의사 소통 효율과 전문성을 향상시킬 수 있습니다. He3 리더 워드 번역기 도구를 사용하면 영어 단어를 빠르게 리더십 언어로 변환하여 의사 소통을 원활하게 할 수 있습니다.\n\n2. 비즈니스 편지: 비즈니스 편지를 작성할 때 표준화된 리더십 언어를 사용하면 편지의 공식성과 전문성을 향상시킬 수 있습니다. He3 리더 워드 번역기 도구를 사용하면 사용해야 할 영어 단어를 빠르게 리더십 언어로 변환하여 편지를 더욱 표준화할 수 있습니다.\n\n3. 비즈니스 보고서: 비즈니스 보고서를 작성할 때 표준화된 리더십 언어를 사용하면 전문성과 가독성을 향상시킬 수 있습니다. He3 리더 워드 번역기 도구를 사용하면 사용해야 할 영어 단어를 빠르게 리더십 언어로 변환하여 보고서를 더욱 표준화할 수 있습니다."
    },
    "ja": {
      "$name": "リーダーシップ用語の解釈者",
      "$keywords": [
        "会話",
        "AI",
        "リーダーシップ言語",
        "ビジネスシーン",
        "英単語変換",
        "ビジネス書簡",
        "ビジネスレポート",
        "プロフェッショナリズム",
        "標準化"
      ],
      "$description": "He3リーダー言葉翻訳機は、英単語をリーダーシップ言語に変換するツールです。入力された英単語をリーダーシップ言語に自動的に変換し、ビジネスシーンでの言語規範に合わせることができます。\n\n特徴：\n\n1. 変換が必要な英単語をツールに入力します。\n\n2. ツールが英単語を自動的にリーダーシップ言語に変換します。\n\n3. 変換されたリーダーシップ言語がツールの出力エリアに表示されます。\n\n使用例：\n\n1. ビジネスシーン：ビジネスシーンでは、標準化されたリーダーシップ言語を使用することで、コミュニケーション効率と専門性を向上させることができます。He3リーダー言葉翻訳機を使用することで、英単語を素早くリーダーシップ言語に変換し、コミュニケーションをスムーズにすることができます。\n\n2. ビジネスレター：ビジネスレターを書く際には、標準化されたリーダーシップ言語を使用することで、レターの形式と専門性を向上させることができます。He3リーダー言葉翻訳機を使用することで、使用する必要のある英単語を素早くリーダーシップ言語に変換し、レターを標準化することができます。\n\n3. ビジネスレポート：ビジネスレポートを書く際には、標準化されたリーダーシップ言語を使用することで、専門性と読みやすさを向上させることができます。He3リーダー言葉翻訳機を使用することで、使用する必要のある英単語を素早くリーダーシップ言語に変換し、レポートを標準化することができます。"
    },
    "es": {
      "$name": "Intérprete de jerga de liderazgo",
      "$keywords": [
        "conversación",
        "IA",
        "Lenguaje de liderazgo",
        "Ocasiones de negocios",
        "Conversión de palabras en inglés",
        "Cartas de negocios",
        "Informes de negocios",
        "Profesionalismo",
        "Estandarización"
      ],
      "$description": "El traductor de palabras de liderazgo He3 es una herramienta que convierte palabras en inglés en lenguaje de liderazgo. Puede convertir las palabras en inglés ingresadas en lenguaje de liderazgo, haciéndolas más acordes con las normas lingüísticas de las ocasiones empresariales.\n\nCaracterísticas:\n\n1. Ingrese las palabras en inglés que necesitan ser convertidas en la herramienta.\n\n2. La herramienta convertirá automáticamente las palabras en inglés en lenguaje de liderazgo.\n\n3. El lenguaje de liderazgo convertido se mostrará en el área de salida de la herramienta.\n\nCasos de uso:\n\n1. Ocasiones empresariales: En ocasiones empresariales, el uso de un lenguaje de liderazgo estandarizado puede mejorar la eficiencia y profesionalismo de la comunicación. El uso de la herramienta de traducción de palabras de liderazgo He3 puede convertir rápidamente las palabras en inglés en lenguaje de liderazgo, haciendo que la comunicación sea más fluida.\n\n2. Cartas comerciales: Al escribir cartas comerciales, el uso de un lenguaje de liderazgo estandarizado puede mejorar la formalidad y profesionalismo de la carta. El uso de la herramienta de traducción de palabras de liderazgo He3 puede convertir rápidamente las palabras en inglés que se necesitan usar en lenguaje de liderazgo, haciendo que la carta sea más estandarizada.\n\n3. Informes comerciales: Al escribir informes comerciales, el uso de un lenguaje de liderazgo estandarizado puede mejorar el profesionalismo y la legibilidad del informe. El uso de la herramienta de traducción de palabras de liderazgo He3 puede convertir rápidamente las palabras en inglés que se necesitan usar en lenguaje de liderazgo, haciendo que el informe sea más estandarizado."
    },
    "zh-tw": {
      "$name": "領導黑話解釋器",
      "$keywords": [
        "對話",
        "人工智慧",
        "領導語言",
        "商務場合",
        "英文詞語轉換",
        "商務信函",
        "商務報告",
        "專業性",
        "標準化"
      ],
      "$description": "He3領袖詞彙翻譯器是一個將英文單詞轉換為領導語言的工具。它可以將輸入的英文單詞轉換為領導語言，使其更符合商務場合的語言規範。\n\n特點：\n\n1. 輸入需要轉換的英文單詞到工具中。\n\n2. 工具會自動將英文單詞轉換為領導語言。\n\n3. 轉換後的領導語言會顯示在工具的輸出區域中。\n\n使用場景：\n\n1. 商務場合：在商務場合中，使用標準化的領導語言可以提高溝通效率和專業性。使用He3領袖詞彙翻譯器工具可以快速將英文單詞轉換為領導語言，使溝通更加順暢。\n\n2. 商務信函：在撰寫商務信函時，使用標準化的領導語言可以提高信函的正式性和專業性。使用He3領袖詞彙翻譯器工具可以快速將需要使用的英文單詞轉換為領導語言，使信函更加標準化。\n\n3. 商務報告：在撰寫商務報告時，使用標準化的領導語言可以提高報告的專業性和可讀性。使用He3領袖詞彙翻譯器工具可以快速將需要使用的英文單詞轉換為領導語言，使報告更加標準化。"
    },
    "zh-cn": {
      "$name": "领导黑话解释器",
      "$keywords": [
        "对话",
        "人工智能",
        "领导语言",
        "商务场合",
        "英语单词转换",
        "商业信函",
        "商业报告",
        "专业性",
        "标准化"
      ],
      "$description": "He3领导力词汇转换器是一种将英语单词转换为领导力语言的工具。它可以将输入的英语单词转换为领导力语言，使它们更符合商务场合的语言规范。\n\n特点：\n\n1. 输入需要转换的英语单词到工具中。\n\n2. 工具会自动将英语单词转换为领导力语言。\n\n3. 转换后的领导力语言将显示在工具的输出区域。\n\n使用场景：\n\n1. 商务场合：在商务场合中，使用标准化的领导力语言可以提高沟通效率和专业性。使用He3领导力词汇转换器工具可以快速将英语单词转换为领导力语言，使沟通更加顺畅。\n\n2. 商务信函：在撰写商务信函时，使用标准化的领导力语言可以提高信函的正式性和专业性。使用He3领导力词汇转换器工具可以快速将需要使用的英语单词转换为领导力语言，使信函更加标准化。\n\n3. 商务报告：在撰写商务报告时，使用标准化的领导力语言可以提高报告的专业性和可读性。使用He3领导力词汇转换器工具可以快速将需要使用的英语单词转换为领导力语言，使报告更加标准化。"
    }
  },
  {
    "id": "dify-lyrics-generator",
    "en": {
      "$name": "AI Lyrics Generator",
      "$keywords": [
        "AI",
        "Lyrics generation",
        "Songwriting",
        "Song translation",
        "Song appreciation"
      ],
      "$description": "The He3 Lyrics Generator tool is a tool used to generate lyrics. It can automatically generate lyrics based on the user's input of the song title and artist name.\n\nFeatures:\n\n1. Users input the song title and artist name.\n\n2. The tool will automatically search for related lyrics on the internet and generate lyrics.\n\n3. The generated lyrics will be displayed in the tool's output area.\n\nUse cases:\n\n1. Song creation: Lyrics are a very important part of creating a song. Using the He3 Lyrics Generator tool, lyrics can be quickly generated to help songwriters better complete their songs.\n\n2. Song translation: Accuracy and fluency are both very important when translating lyrics. Using this tool, lyrics can be quickly generated and translated and modified to better complete the song translation.\n\n3. Song appreciation: Lyrics are a very important part of enjoying a song. Using the He3 Lyrics Generator tool, lyrics can be quickly generated to help listeners better understand the content and emotions of the song."
    },
    "pt": {
      "$name": "Gerador de Letras AI",
      "$keywords": [
        "IA",
        "Geração de letras",
        "Composição de músicas",
        "Tradução de músicas",
        "Apreciação de músicas"
      ],
      "$description": "O He3 Lyrics Generator é uma ferramenta usada para gerar letras de música. Ele pode gerar letras automaticamente com base no título da música e nome do artista inseridos pelo usuário.\n\nRecursos:\n\n1. Os usuários inserem o título da música e o nome do artista.\n\n2. A ferramenta irá automaticamente buscar letras relacionadas na internet e gerar as letras.\n\n3. As letras geradas serão exibidas na área de saída da ferramenta.\n\nCasos de uso:\n\n1. Criação de música: Letras são uma parte muito importante na criação de uma música. Usando o He3 Lyrics Generator, letras podem ser geradas rapidamente para ajudar os compositores a completar melhor suas músicas.\n\n2. Tradução de música: Precisão e fluência são muito importantes ao traduzir letras de música. Usando esta ferramenta, letras podem ser geradas rapidamente e traduzidas e modificadas para melhor completar a tradução da música.\n\n3. Apreciação de música: Letras são uma parte muito importante para apreciar uma música. Usando o He3 Lyrics Generator, letras podem ser geradas rapidamente para ajudar os ouvintes a entender melhor o conteúdo e as emoções da música."
    },
    "ru": {
      "$name": "Генератор текстов песен AI",
      "$keywords": [
        "ИИ",
        "Генерация текстов песен",
        "Создание песен",
        "Перевод песен",
        "Оценка песен"
      ],
      "$description": "Инструмент He3 Lyrics Generator - это инструмент, используемый для генерации текстов песен. Он может автоматически генерировать тексты песен на основе введенных пользователем названия песни и имени исполнителя.\n\nОсобенности:\n\n1. Пользователи вводят название песни и имя исполнителя.\n\n2. Инструмент автоматически ищет связанные тексты песен в Интернете и генерирует тексты.\n\n3. Сгенерированные тексты будут отображаться в выходной области инструмента.\n\nПрименение:\n\n1. Создание песен: Тексты песен являются очень важной частью создания песен. Используя инструмент He3 Lyrics Generator, тексты могут быть быстро сгенерированы, чтобы помочь авторам песен лучше завершить свои произведения.\n\n2. Перевод песен: Точность и беглость являются очень важными при переводе текстов песен. Используя этот инструмент, тексты могут быть быстро сгенерированы, переведены и изменены, чтобы лучше завершить перевод песни.\n\n3. Оценка песен: Тексты песен являются очень важной частью наслаждения песней. Используя инструмент He3 Lyrics Generator, тексты могут быть быстро сгенерированы, чтобы помочь слушателям лучше понять содержание и эмоции песни."
    },
    "it": {
      "$name": "Generatore di testi delle canzoni AI",
      "$keywords": [
        "AI",
        "Generazione di testi",
        "Composizione di canzoni",
        "Traduzione di canzoni",
        "Apprezzamento di canzoni"
      ],
      "$description": "Il tool He3 Lyrics Generator è uno strumento utilizzato per generare testi di canzoni. Può generare automaticamente i testi basandosi sull'input dell'utente del titolo della canzone e del nome dell'artista.\n\nCaratteristiche:\n\n1. Gli utenti inseriscono il titolo della canzone e il nome dell'artista.\n\n2. Lo strumento cercherà automaticamente i testi correlati su internet e genererà i testi.\n\n3. I testi generati verranno visualizzati nell'area di output dello strumento.\n\nCasi d'uso:\n\n1. Creazione di canzoni: i testi sono una parte molto importante nella creazione di una canzone. Utilizzando lo strumento He3 Lyrics Generator, i testi possono essere generati rapidamente per aiutare i cantautori a completare meglio le loro canzoni.\n\n2. Traduzione di canzoni: l'accuratezza e la fluidità sono entrambe molto importanti nella traduzione dei testi. Utilizzando questo strumento, i testi possono essere generati, tradotti e modificati rapidamente per completare meglio la traduzione della canzone.\n\n3. Apprezzamento delle canzoni: i testi sono una parte molto importante per apprezzare una canzone. Utilizzando lo strumento He3 Lyrics Generator, i testi possono essere generati rapidamente per aiutare gli ascoltatori a comprendere meglio il contenuto e le emozioni della canzone."
    },
    "fr": {
      "$name": "Générateur de paroles AI",
      "$keywords": [
        "IA",
        "Génération de paroles",
        "Composition de chansons",
        "Traduction de chansons",
        "Appréciation de chansons"
      ],
      "$description": "Le générateur de paroles He3 Lyrics est un outil utilisé pour générer des paroles de chansons. Il peut automatiquement générer des paroles en fonction du titre de la chanson et du nom de l'artiste saisis par l'utilisateur.\n\nFonctionnalités :\n\n1. Les utilisateurs saisissent le titre de la chanson et le nom de l'artiste.\n\n2. L'outil recherche automatiquement des paroles liées sur Internet et génère des paroles.\n\n3. Les paroles générées sont affichées dans la zone de sortie de l'outil.\n\nCas d'utilisation :\n\n1. Création de chansons : Les paroles sont une partie très importante de la création d'une chanson. En utilisant l'outil He3 Lyrics Generator, les paroles peuvent être rapidement générées pour aider les auteurs-compositeurs à mieux compléter leurs chansons.\n\n2. Traduction de chansons : L'exactitude et la fluidité sont toutes deux très importantes lors de la traduction de paroles. En utilisant cet outil, les paroles peuvent être rapidement générées, traduites et modifiées pour mieux compléter la traduction de la chanson.\n\n3. Appréciation de chansons : Les paroles sont une partie très importante de l'appréciation d'une chanson. En utilisant l'outil He3 Lyrics Generator, les paroles peuvent être rapidement générées pour aider les auditeurs à mieux comprendre le contenu et les émotions de la chanson."
    },
    "de": {
      "$name": "AI Liedtext Generator",
      "$keywords": [
        "AI",
        "Liedtext-Generierung",
        "Songwriting",
        "Song-Übersetzung",
        "Song-Wertschätzung"
      ],
      "$description": "Der He3 Lyrics Generator ist ein Tool, das verwendet wird, um Liedtexte zu generieren. Es kann automatisch Liedtexte generieren, basierend auf den Eingaben des Benutzers zum Titel des Liedes und dem Namen des Künstlers.\n\nFunktionen:\n\n1. Benutzer geben den Titel des Liedes und den Namen des Künstlers ein.\n\n2. Das Tool sucht automatisch nach verwandten Liedtexten im Internet und generiert Liedtexte.\n\n3. Die generierten Liedtexte werden im Ausgabe-Bereich des Tools angezeigt.\n\nAnwendungsfälle:\n\n1. Lied-Erstellung: Liedtexte sind ein sehr wichtiger Teil der Erstellung eines Liedes. Mit dem He3 Lyrics Generator können Liedtexte schnell generiert werden, um Songwritern bei der Fertigstellung ihrer Lieder zu helfen.\n\n2. Lied-Übersetzung: Genauigkeit und Flüssigkeit sind beide sehr wichtig bei der Übersetzung von Liedtexten. Mit diesem Tool können Liedtexte schnell generiert, übersetzt und modifiziert werden, um die Übersetzung des Liedes zu verbessern.\n\n3. Lied-Wertschätzung: Liedtexte sind ein sehr wichtiger Teil des Genusses eines Liedes. Mit dem He3 Lyrics Generator können Liedtexte schnell generiert werden, um Zuhörern zu helfen, den Inhalt und die Emotionen des Liedes besser zu verstehen."
    },
    "ko": {
      "$name": "AI 가사 생성기",
      "$keywords": [
        "인공지능",
        "가사 생성",
        "노래 작곡",
        "노래 번역",
        "노래 감상"
      ],
      "$description": "He3 가사 생성기 도구는 가사를 생성하는 데 사용되는 도구입니다. 사용자가 노래 제목과 아티스트 이름을 입력하면 자동으로 가사를 생성할 수 있습니다.\n\n기능:\n\n1. 사용자는 노래 제목과 아티스트 이름을 입력합니다.\n\n2. 도구는 인터넷에서 관련된 가사를 자동으로 검색하고 생성합니다.\n\n3. 생성된 가사는 도구의 출력 영역에 표시됩니다.\n\n사용 사례:\n\n1. 노래 작성: 가사는 노래 작성의 매우 중요한 부분입니다. He3 가사 생성기 도구를 사용하면 가사를 빠르게 생성하여 작곡가가 노래를 완성하는 데 도움을 줄 수 있습니다.\n\n2. 노래 번역: 가사 번역 시 정확성과 유창성이 모두 매우 중요합니다. 이 도구를 사용하면 가사를 빠르게 생성하고 번역하고 수정하여 노래 번역을 더욱 완성도 있게 할 수 있습니다.\n\n3. 노래 감상: 가사는 노래를 즐기는 데 매우 중요한 부분입니다. He3 가사 생성기 도구를 사용하면 가사를 빠르게 생성하여 청취자가 노래의 내용과 감정을 더 잘 이해할 수 있도록 도와줍니다."
    },
    "ja": {
      "$name": "AI 歌詞生成器",
      "$keywords": [
        "AI",
        "歌詞生成",
        "作詞",
        "歌詞翻訳",
        "歌詞鑑賞"
      ],
      "$description": "He3歌詞ジェネレーターツールは、歌詞を生成するために使用されるツールです。ユーザーが曲のタイトルとアーティスト名を入力すると、自動的に歌詞を生成することができます。\n\n特徴：\n\n1. ユーザーは曲のタイトルとアーティスト名を入力します。\n\n2. ツールは自動的にインターネット上で関連する歌詞を検索し、歌詞を生成します。\n\n3. 生成された歌詞は、ツールの出力エリアに表示されます。\n\n使用例：\n\n1. 曲の制作：歌詞は曲を作る上で非常に重要な要素です。He3歌詞ジェネレーターツールを使用することで、歌詞を素早く生成して、作曲家が曲を完成させるのを手助けすることができます。\n\n2. 曲の翻訳：歌詞の翻訳には正確性と流暢さの両方が非常に重要です。このツールを使用することで、歌詞を素早く生成して翻訳し、修正して曲の翻訳をより完成させることができます。\n\n3. 曲の鑑賞：歌詞は曲を楽しむ上で非常に重要な要素です。He3歌詞ジェネレーターツールを使用することで、歌詞を素早く生成して、聴衆が曲の内容や感情をより理解するのを手助けすることができます。"
    },
    "es": {
      "$name": "Generador de letras de canciones AI",
      "$keywords": [
        "Inteligencia Artificial",
        "Generación de Letras",
        "Composición de Canciones",
        "Traducción de Canciones",
        "Apreciación de Canciones"
      ],
      "$description": "El generador de letras He3 es una herramienta utilizada para generar letras de canciones. Puede generar automáticamente letras basadas en la entrada del usuario del título de la canción y el nombre del artista.\n\nCaracterísticas:\n\n1. Los usuarios ingresan el título de la canción y el nombre del artista.\n\n2. La herramienta buscará automáticamente letras relacionadas en Internet y generará letras.\n\n3. Las letras generadas se mostrarán en el área de salida de la herramienta.\n\nCasos de uso:\n\n1. Creación de canciones: Las letras son una parte muy importante de la creación de una canción. Usando la herramienta de generación de letras He3, las letras pueden generarse rápidamente para ayudar a los compositores a completar mejor sus canciones.\n\n2. Traducción de canciones: La precisión y fluidez son muy importantes al traducir letras. Usando esta herramienta, las letras pueden generarse rápidamente y traducirse y modificarse para completar mejor la traducción de la canción.\n\n3. Apreciación de canciones: Las letras son una parte muy importante de disfrutar de una canción. Usando la herramienta de generación de letras He3, las letras pueden generarse rápidamente para ayudar a los oyentes a comprender mejor el contenido y las emociones de la canción."
    },
    "zh-tw": {
      "$name": "AI 歌詞生成器",
      "$keywords": [
        "人工智慧",
        "歌詞生成",
        "創作歌曲",
        "歌曲翻譯",
        "歌曲欣賞"
      ],
      "$description": "He3 歌詞生成器是一個用於生成歌詞的工具。它可以根據用戶輸入的歌曲標題和藝術家名稱自動生成歌詞。\n\n功能：\n\n1. 用戶輸入歌曲標題和藝術家名稱。\n\n2. 工具將自動在互聯網上搜索相關歌詞並生成歌詞。\n\n3. 生成的歌詞將顯示在工具的輸出區域中。\n\n用例：\n\n1. 歌曲創作：歌詞是創作歌曲的非常重要的一部分。使用 He3 歌詞生成器工具，歌詞可以快速生成，幫助作曲家更好地完成他們的歌曲。\n\n2. 歌曲翻譯：在翻譯歌詞時，準確性和流暢度都非常重要。使用這個工具，歌詞可以快速生成、翻譯和修改，以更好地完成歌曲翻譯。\n\n3. 歌曲欣賞：歌詞是欣賞歌曲的非常重要的一部分。使用 He3 歌詞生成器工具，歌詞可以快速生成，幫助聽眾更好地理解歌曲的內容和情感。"
    },
    "zh-cn": {
      "$name": "AI 歌词生成器",
      "$keywords": [
        "人工智能",
        "歌词生成",
        "创作歌曲",
        "歌曲翻译",
        "歌曲欣赏"
      ],
      "$description": "He3歌词生成器是一种用于生成歌词的工具。它可以根据用户输入的歌曲标题和艺术家名称自动生成歌词。\n\n特点：\n\n1. 用户输入歌曲标题和艺术家名称。\n\n2. 工具将自动在互联网上搜索相关歌词并生成歌词。\n\n3. 生成的歌词将显示在工具的输出区域中。\n\n用例：\n\n1. 歌曲创作：歌词是创作歌曲的重要组成部分。使用He3歌词生成器工具，可以快速生成歌词，帮助词曲作者更好地完成歌曲。\n\n2. 歌曲翻译：在翻译歌词时，准确性和流畅性都非常重要。使用这个工具，可以快速生成、翻译和修改歌词，更好地完成歌曲翻译。\n\n3. 歌曲欣赏：歌词是欣赏歌曲的重要组成部分。使用He3歌词生成器工具，可以快速生成歌词，帮助听众更好地理解歌曲的内容和情感。"
    }
  },
  {
    "id": "dify-red-style-generator",
    "en": {
      "$name": "Little Red Sweet Potato Style Generator",
      "$keywords": [
        "conversation",
        "AI",
        "Red theme style",
        "Style code generation",
        "Custom style properties",
        "Website development",
        "Application development",
        "Website beautification",
        "Application beautification",
        "CSS learning"
      ],
      "$description": "He3 red style generator is a tool used to generate red-themed style codes. It can generate style codes that meet the requirements of the red theme according to the user's needs, making it convenient for users to use on websites or applications.\n\nFeatures:\n\n1. Users can customize the generated style code by selecting different style properties.\n\n2. The tool will automatically generate style codes that meet the requirements of the red theme based on the user's selected properties.\n\n3. The generated style code will be displayed in the tool's output area, and users can copy and paste it into their own projects.\n\nUse cases:\n\n1. Website or application development: When developing a website or application, developers need to use style codes that meet the theme. Using He3 red style generator can quickly generate style codes that meet the requirements of the red theme, making it convenient for developers to use.\n\n2. Website or application beautification: When beautifying a website or application, designers need to use style codes that meet the theme. Using He3 red style generator can quickly generate style codes that meet the requirements of the red theme, making it convenient for designers to use.\n\n3. Learning CSS: For those who are learning CSS, using He3 red style generator can help them understand different CSS properties and how to use them to generate style codes."
    },
    "pt": {
      "$name": "Gerador de estilo de batata-doce vermelha",
      "$keywords": [
        "conversa",
        "IA",
        "Estilo de tema vermelho",
        "Geração de código de estilo",
        "Propriedades de estilo personalizadas",
        "Desenvolvimento de sites",
        "Desenvolvimento de aplicativos",
        "Embelezamento de sites",
        "Embelezamento de aplicativos",
        "Aprendizado de CSS"
      ],
      "$description": "O gerador de estilo He3 vermelho é uma ferramenta usada para gerar códigos de estilo com tema vermelho. Ele pode gerar códigos de estilo que atendam aos requisitos do tema vermelho de acordo com as necessidades do usuário, tornando conveniente para os usuários usá-lo em sites ou aplicativos.\n\nRecursos:\n\n1. Os usuários podem personalizar o código de estilo gerado selecionando diferentes propriedades de estilo.\n\n2. A ferramenta gerará automaticamente códigos de estilo que atendam aos requisitos do tema vermelho com base nas propriedades selecionadas pelo usuário.\n\n3. O código de estilo gerado será exibido na área de saída da ferramenta e os usuários poderão copiá-lo e colá-lo em seus próprios projetos.\n\nCasos de uso:\n\n1. Desenvolvimento de sites ou aplicativos: ao desenvolver um site ou aplicativo, os desenvolvedores precisam usar códigos de estilo que atendam ao tema. Usar o gerador de estilo He3 vermelho pode gerar rapidamente códigos de estilo que atendam aos requisitos do tema vermelho, tornando conveniente para os desenvolvedores usá-los.\n\n2. Embelezamento de sites ou aplicativos: ao embelezar um site ou aplicativo, os designers precisam usar códigos de estilo que atendam ao tema. Usar o gerador de estilo He3 vermelho pode gerar rapidamente códigos de estilo que atendam aos requisitos do tema vermelho, tornando conveniente para os designers usá-los.\n\n3. Aprendendo CSS: para aqueles que estão aprendendo CSS, usar o gerador de estilo He3 vermelho pode ajudá-los a entender diferentes propriedades CSS e como usá-las para gerar códigos de estilo."
    },
    "ru": {
      "$name": "Генератор стиля маленькой красной сладкой картошки",
      "$keywords": [
        "разговор",
        "ИИ",
        "красная тема стиля",
        "генерация кода стиля",
        "настройка свойств стиля",
        "разработка веб-сайтов",
        "разработка приложений",
        "украшение веб-сайтов",
        "украшение приложений",
        "изучение CSS"
      ],
      "$description": "He3 генератор стилей в красной теме - это инструмент, используемый для генерации кодов стилей в красной теме. Он может генерировать коды стилей, соответствующие требованиям красной темы в соответствии с потребностями пользователя, что удобно для использования на веб-сайтах или приложениях.\n\nОсобенности:\n\n1. Пользователи могут настроить сгенерированный код стиля, выбрав различные свойства стиля.\n\n2. Инструмент автоматически генерирует коды стилей, соответствующие требованиям красной темы на основе выбранных пользователем свойств.\n\n3. Сгенерированный код стиля будет отображаться в выходной области инструмента, и пользователи могут скопировать и вставить его в свои собственные проекты.\n\nПрименение:\n\n1. Разработка веб-сайтов или приложений: при разработке веб-сайта или приложения разработчикам необходимо использовать коды стилей, соответствующие теме. Использование генератора стилей He3 в красной теме позволяет быстро генерировать коды стилей, соответствующие требованиям красной темы, что удобно для разработчиков.\n\n2. Улучшение веб-сайтов или приложений: при улучшении веб-сайта или приложения дизайнерам необходимо использовать коды стилей, соответствующие теме. Использование генератора стилей He3 в красной теме позволяет быстро генерировать коды стилей, соответствующие требованиям красной темы, что удобно для дизайнеров.\n\n3. Изучение CSS: для тех, кто изучает CSS, использование генератора стилей He3 в красной теме может помочь им понять различные свойства CSS и как использовать их для генерации кодов стилей."
    },
    "it": {
      "$name": "Generatore di stile di scrittura di patate dolci rosse",
      "$keywords": [
        "conversazione",
        "AI",
        "Stile tema Rosso",
        "Generazione codice stile",
        "Proprietà di stile personalizzate",
        "Sviluppo di siti web",
        "Sviluppo di applicazioni",
        "Abbellimento siti web",
        "Abbellimento applicazioni",
        "Apprendimento CSS"
      ],
      "$description": "Il generatore di stile He3 rosso è uno strumento utilizzato per generare codici di stile a tema rosso. Può generare codici di stile che soddisfano i requisiti del tema rosso in base alle esigenze dell'utente, rendendo comodo l'utilizzo su siti web o applicazioni.\n\nCaratteristiche:\n\n1. Gli utenti possono personalizzare il codice di stile generato selezionando diverse proprietà di stile.\n\n2. Lo strumento genererà automaticamente codici di stile che soddisfano i requisiti del tema rosso in base alle proprietà selezionate dall'utente.\n\n3. Il codice di stile generato verrà visualizzato nell'area di output dello strumento e gli utenti potranno copiarlo e incollarlo nei propri progetti.\n\nCasi d'uso:\n\n1. Sviluppo di siti web o applicazioni: durante lo sviluppo di un sito web o di un'applicazione, gli sviluppatori devono utilizzare codici di stile che soddisfino il tema. Utilizzando il generatore di stile He3 rosso, è possibile generare rapidamente codici di stile che soddisfano i requisiti del tema rosso, rendendo comodo l'utilizzo per gli sviluppatori.\n\n2. Abbellimento di siti web o applicazioni: durante l'abbellimento di un sito web o di un'applicazione, i designer devono utilizzare codici di stile che soddisfino il tema. Utilizzando il generatore di stile He3 rosso, è possibile generare rapidamente codici di stile che soddisfano i requisiti del tema rosso, rendendo comodo l'utilizzo per i designer.\n\n3. Apprendimento di CSS: per coloro che stanno imparando CSS, utilizzare il generatore di stile He3 rosso può aiutarli a comprendere le diverse proprietà CSS e come utilizzarle per generare codici di stile."
    },
    "fr": {
      "$name": "Générateur de style de patate douce rouge",
      "$keywords": [
        "conversation",
        "IA",
        "Style de thème rouge",
        "Génération de code de style",
        "Propriétés de style personnalisées",
        "Développement de site web",
        "Développement d'application",
        "Embellissement de site web",
        "Embellissement d'application",
        "Apprentissage CSS"
      ],
      "$description": "Le générateur de style rouge He3 est un outil utilisé pour générer des codes de style à thème rouge. Il peut générer des codes de style qui répondent aux exigences du thème rouge selon les besoins de l'utilisateur, ce qui facilite son utilisation sur les sites web ou les applications.\n\nFonctionnalités :\n\n1. Les utilisateurs peuvent personnaliser le code de style généré en sélectionnant différentes propriétés de style.\n\n2. L'outil générera automatiquement des codes de style qui répondent aux exigences du thème rouge en fonction des propriétés sélectionnées par l'utilisateur.\n\n3. Le code de style généré sera affiché dans la zone de sortie de l'outil, et les utilisateurs pourront le copier et le coller dans leurs propres projets.\n\nCas d'utilisation :\n\n1. Développement de sites web ou d'applications : Lors du développement d'un site web ou d'une application, les développeurs ont besoin d'utiliser des codes de style qui répondent au thème. En utilisant le générateur de style rouge He3, ils peuvent rapidement générer des codes de style qui répondent aux exigences du thème rouge, ce qui facilite leur utilisation.\n\n2. Embellissement de sites web ou d'applications : Lors de l'embellissement d'un site web ou d'une application, les designers ont besoin d'utiliser des codes de style qui répondent au thème. En utilisant le générateur de style rouge He3, ils peuvent rapidement générer des codes de style qui répondent aux exigences du thème rouge, ce qui facilite leur utilisation.\n\n3. Apprentissage de CSS : Pour ceux qui apprennent CSS, l'utilisation du générateur de style rouge He3 peut les aider à comprendre les différentes propriétés CSS et comment les utiliser pour générer des codes de style."
    },
    "de": {
      "$name": "Generator für den Sweet-Potato-Stil von Little Red",
      "$keywords": [
        "Konversation",
        "KI",
        "Rotes Themen-Design",
        "Generierung von Style-Codes",
        "Benutzerdefinierte Style-Eigenschaften",
        "Website-Entwicklung",
        "Anwendungs-Entwicklung",
        "Website-Verschönerung",
        "Anwendungs-Verschönerung",
        "CSS-Lernen"
      ],
      "$description": "He3 Red Style Generator ist ein Werkzeug, das verwendet wird, um rote Stilcodes zu generieren. Es kann Stilcodes generieren, die den Anforderungen des roten Themas entsprechend den Bedürfnissen des Benutzers entsprechen, was es Benutzern erleichtert, sie auf Websites oder Anwendungen zu verwenden.\n\nFunktionen:\n\n1. Benutzer können den generierten Stilcode anpassen, indem sie verschiedene Stileigenschaften auswählen.\n\n2. Das Tool generiert automatisch Stilcodes, die den Anforderungen des roten Themas basierend auf den vom Benutzer ausgewählten Eigenschaften entsprechen.\n\n3. Der generierte Stilcode wird im Ausgabe-Bereich des Tools angezeigt, und Benutzer können ihn in ihre eigenen Projekte kopieren und einfügen.\n\nAnwendungsfälle:\n\n1. Website- oder Anwendungsentwicklung: Bei der Entwicklung einer Website oder Anwendung müssen Entwickler Stilcodes verwenden, die dem Thema entsprechen. Mit He3 Red Style Generator können schnell Stilcodes generiert werden, die den Anforderungen des roten Themas entsprechen, was es Entwicklern erleichtert, sie zu verwenden.\n\n2. Website- oder Anwendungsschönheit: Bei der Verschönerung einer Website oder Anwendung müssen Designer Stilcodes verwenden, die dem Thema entsprechen. Mit He3 Red Style Generator können schnell Stilcodes generiert werden, die den Anforderungen des roten Themas entsprechen, was es Designern erleichtert, sie zu verwenden.\n\n3. CSS lernen: Für diejenigen, die CSS lernen, kann die Verwendung von He3 Red Style Generator ihnen helfen, verschiedene CSS-Eigenschaften zu verstehen und wie sie verwendet werden können, um Stilcodes zu generieren."
    },
    "ko": {
      "$name": "작은 빨간 고구마 스타일 생성기",
      "$keywords": [
        "대화",
        "인공지능",
        "빨간색 테마 스타일",
        "스타일 코드 생성",
        "사용자 정의 스타일 속성",
        "웹사이트 개발",
        "애플리케이션 개발",
        "웹사이트 꾸미기",
        "애플리케이션 꾸미기",
        "CSS 학습"
      ],
      "$description": "He3 레드 스타일 생성기는 레드 테마 스타일 코드를 생성하는 데 사용되는 도구입니다. 사용자의 요구에 따라 레드 테마 요구 사항을 충족하는 스타일 코드를 생성할 수 있으며, 웹 사이트나 애플리케이션에서 사용하기 편리합니다.\n\n기능:\n\n1. 사용자는 다양한 스타일 속성을 선택하여 생성된 스타일 코드를 사용자 정의할 수 있습니다.\n\n2. 도구는 사용자가 선택한 속성을 기반으로 레드 테마 요구 사항을 충족하는 스타일 코드를 자동으로 생성합니다.\n\n3. 생성된 스타일 코드는 도구의 출력 영역에 표시되며, 사용자는 자신의 프로젝트에 복사하여 붙여넣을 수 있습니다.\n\n사용 사례:\n\n1. 웹 사이트나 애플리케이션 개발: 웹 사이트나 애플리케이션을 개발할 때 개발자는 테마에 맞는 스타일 코드를 사용해야 합니다. He3 레드 스타일 생성기를 사용하면 레드 테마 요구 사항을 충족하는 스타일 코드를 빠르게 생성하여 개발자가 사용하기 편리합니다.\n\n2. 웹 사이트나 애플리케이션 꾸미기: 웹 사이트나 애플리케이션을 꾸밀 때 디자이너는 테마에 맞는 스타일 코드를 사용해야 합니다. He3 레드 스타일 생성기를 사용하면 레드 테마 요구 사항을 충족하는 스타일 코드를 빠르게 생성하여 디자이너가 사용하기 편리합니다.\n\n3. CSS 학습: CSS를 배우는 사람들은 He3 레드 스타일 생성기를 사용하여 다양한 CSS 속성을 이해하고 스타일 코드를 생성하는 방법을 배울 수 있습니다."
    },
    "ja": {
      "$name": "リトルレッドスイートポテトスタイルジェネレーター",
      "$keywords": [
        "会話",
        "AI",
        "赤いテーマスタイル",
        "スタイルコード生成",
        "カスタムスタイルプロパティ",
        "ウェブサイト開発",
        "アプリケーション開発",
        "ウェブサイト美化",
        "アプリケーション美化",
        "CSS学習"
      ],
      "$description": "He3レッドスタイルジェネレーターは、赤をテーマとしたスタイルコードを生成するためのツールです。ユーザーのニーズに応じて、赤いテーマの要件を満たすスタイルコードを生成することができ、ウェブサイトやアプリケーションでの使用が便利です。\n\n特徴：\n\n1. ユーザーは、異なるスタイルプロパティを選択することで生成されたスタイルコードをカスタマイズすることができます。\n\n2. ツールは、ユーザーが選択したプロパティに基づいて、自動的に赤いテーマの要件を満たすスタイルコードを生成します。\n\n3. 生成されたスタイルコードは、ツールの出力エリアに表示され、ユーザーはそれを自分のプロジェクトにコピー＆ペーストすることができます。\n\n使用例：\n\n1. ウェブサイトやアプリケーションの開発：ウェブサイトやアプリケーションを開発する際、開発者はテーマに合ったスタイルコードを使用する必要があります。He3レッドスタイルジェネレーターを使用することで、赤いテーマの要件を満たすスタイルコードを素早く生成し、開発者が使用するのに便利です。\n\n2. ウェブサイトやアプリケーションの美化：ウェブサイトやアプリケーションを美化する際、デザイナーはテーマに合ったスタイルコードを使用する必要があります。He3レッドスタイルジェネレーターを使用することで、赤いテーマの要件を満たすスタイルコードを素早く生成し、デザイナーが使用するのに便利です。\n\n3. CSSの学習：CSSを学んでいる人にとって、He3レッドスタイルジェネレーターを使用することで、異なるCSSプロパティやそれらを使用してスタイルコードを生成する方法を理解するのに役立ちます。"
    },
    "es": {
      "$name": "Generador de estilo de escritura de Sweet Potato de Little Red",
      "$keywords": [
        "conversación",
        "IA",
        "Estilo de tema rojo",
        "Generación de código de estilo",
        "Propiedades de estilo personalizadas",
        "Desarrollo de sitios web",
        "Desarrollo de aplicaciones",
        "Embellecimiento de sitios web",
        "Embellecimiento de aplicaciones",
        "Aprendizaje de CSS"
      ],
      "$description": "El generador de estilo rojo He3 es una herramienta utilizada para generar códigos de estilo con temática roja. Puede generar códigos de estilo que cumplan con los requisitos del tema rojo según las necesidades del usuario, lo que hace que sea conveniente para los usuarios utilizarlos en sitios web o aplicaciones.\n\nCaracterísticas:\n\n1. Los usuarios pueden personalizar el código de estilo generado seleccionando diferentes propiedades de estilo.\n\n2. La herramienta generará automáticamente códigos de estilo que cumplan con los requisitos del tema rojo según las propiedades seleccionadas por el usuario.\n\n3. El código de estilo generado se mostrará en el área de salida de la herramienta, y los usuarios pueden copiarlo y pegarlo en sus propios proyectos.\n\nCasos de uso:\n\n1. Desarrollo de sitios web o aplicaciones: al desarrollar un sitio web o aplicación, los desarrolladores necesitan utilizar códigos de estilo que cumplan con el tema. El uso del generador de estilo rojo He3 puede generar rápidamente códigos de estilo que cumplan con los requisitos del tema rojo, lo que hace que sea conveniente para los desarrolladores utilizarlos.\n\n2. Embellecimiento de sitios web o aplicaciones: al embellecer un sitio web o aplicación, los diseñadores necesitan utilizar códigos de estilo que cumplan con el tema. El uso del generador de estilo rojo He3 puede generar rápidamente códigos de estilo que cumplan con los requisitos del tema rojo, lo que hace que sea conveniente para los diseñadores utilizarlos.\n\n3. Aprendizaje de CSS: para aquellos que están aprendiendo CSS, el uso del generador de estilo rojo He3 puede ayudarles a comprender diferentes propiedades de CSS y cómo utilizarlas para generar códigos de estilo."
    },
    "zh-tw": {
      "$name": "小紅🍠文風生成器",
      "$keywords": [
        "對話",
        "人工智慧",
        "紅色主題風格",
        "風格代碼生成",
        "自定義風格屬性",
        "網站開發",
        "應用程式開發",
        "網站美化",
        "應用程式美化",
        "CSS學習"
      ],
      "$description": "He3紅色風格生成器是一個工具，用於生成紅色主題風格代碼。它可以根據用戶的需求生成符合紅色主題要求的風格代碼，方便用戶在網站或應用程序中使用。\n\n特點：\n\n1. 用戶可以通過選擇不同的風格屬性自定義生成的風格代碼。\n\n2. 工具將根據用戶選擇的屬性自動生成符合紅色主題要求的風格代碼。\n\n3. 生成的風格代碼將顯示在工具的輸出區域中，用戶可以將其複製並粘貼到自己的項目中。\n\n用例：\n\n1. 網站或應用程序開發：在開發網站或應用程序時，開發人員需要使用符合主題的風格代碼。使用He3紅色風格生成器可以快速生成符合紅色主題要求的風格代碼，方便開發人員使用。\n\n2. 網站或應用程序美化：在美化網站或應用程序時，設計師需要使用符合主題的風格代碼。使用He3紅色風格生成器可以快速生成符合紅色主題要求的風格代碼，方便設計師使用。\n\n3. 學習CSS：對於正在學習CSS的人來說，使用He3紅色風格生成器可以幫助他們了解不同的CSS屬性以及如何使用它們生成風格代碼。"
    },
    "zh-cn": {
      "$name": "小红🍠文风生成器",
      "$keywords": [
        "对话",
        "人工智能",
        "红色主题风格",
        "样式代码生成",
        "自定义样式属性",
        "网站开发",
        "应用程序开发",
        "网站美化",
        "应用程序美化",
        "CSS学习"
      ],
      "$description": "He3红色风格生成器是一种工具，用于生成红色主题风格代码。它可以根据用户的需求生成符合红色主题要求的风格代码，方便用户在网站或应用程序中使用。\n\n特点：\n\n1. 用户可以通过选择不同的风格属性来自定义生成的风格代码。\n\n2. 根据用户选择的属性，该工具将自动生成符合红色主题要求的风格代码。\n\n3. 生成的风格代码将显示在工具的输出区域中，用户可以将其复制并粘贴到自己的项目中。\n\n用例：\n\n1. 网站或应用程序开发：在开发网站或应用程序时，开发人员需要使用符合主题的风格代码。使用He3红色风格生成器可以快速生成符合红色主题要求的风格代码，方便开发人员使用。\n\n2. 网站或应用程序美化：在美化网站或应用程序时，设计师需要使用符合主题的风格代码。使用He3红色风格生成器可以快速生成符合红色主题要求的风格代码，方便设计师使用。\n\n3. 学习CSS：对于正在学习CSS的人来说，使用He3红色风格生成器可以帮助他们了解不同的CSS属性以及如何使用它们生成风格代码。"
    }
  },
  {
    "id": "dify-weekly-report-generator",
    "fr": {
      "$name": "Générateur de rapports hebdomadaires📓",
      "$keywords": [
        "轉換",
        "JSON",
        "Properties",
        "轉換",
        "轉換格式",
        "格式轉換"
      ],
      "$description": "JSON to Properties 工具是一個用於將 JSON 格式轉換為 Properties 格式的工具。它可以將輸入的 JSON 字符串轉換為 Properties 格式的鍵值對，並輸出到工具的輸出區域。此外，該工具還支持將 Properties 格式字符串轉換為 JSON 格式。\n\n功能描述：\n\n1. 將 JSON 格式字符串粘貼或輸入到工具中。\n\n2. 工具將自動將 JSON 格式字符串轉換為 Properties 格式的鍵值對，並輸出到工具的輸出區域。\n\n3. 支持將 Properties 格式字符串轉換為 JSON 格式。\n\n使用案例：\n\n1. 配置文件轉換：在項目開發中，通常需要將配置文件從 JSON 格式轉換為 Properties 格式。使用 JSON to Properties 工具可以快速將 JSON 格式配置文件轉換為 Properties 格式，使項目更容易使用。\n\n2. 數據轉換：在數據處理過程中，有時需要將 JSON 格式數據轉換為 Properties 格式。使用此工具，可以快速將 JSON 格式數據轉換為 Properties 格式，使數據處理更加容易。\n\n3. 數據導出：在某些情況下，需要將數據導出為 Properties 格式。使用 JSON to Properties 工具，可以將數據轉換為 Properties 格式並導出到文件。"
    },
    "zh-tw": {
      "$name": "週報生成器📓",
      "$keywords": [
        "人工智慧",
        "週報產生器",
        "自動產生週報",
        "多種風格和格式",
        "PDF匯出",
        "Word匯出",
        "公司內部週報",
        "學生週報",
        "個人週報"
      ],
      "$description": "He3週報生成器是一個用於生成週報的工具。它可以根據用戶輸入的數據自動生成報告，並提供多種風格和格式供用戶選擇。\n\n功能描述：\n\n1. 用戶可以輸入週報的標題、時間範圍和內容等信息。\n\n2. 工具將根據用戶的輸入自動生成報告，並提供多種風格和格式供用戶選擇。\n\n3. 用戶可以選擇將報告導出為PDF或Word文檔，方便分享和打印。\n\n使用場景：\n\n1. 公司內部週報：在公司內部，部門經理或團隊負責人需要定期向上級報告工作進展和成就。使用He3週報生成器，他們可以輕鬆生成報告，並選擇適合內部公司使用的風格和格式。\n\n2. 學生週報：在學校，學生需要定期向老師報告他們的學習進度和成就。使用He3週報生成器，他們可以輕鬆生成報告，並選擇適合學校使用的風格和格式。\n\n3. 個人週報：在工作或學習中，個人需要定期總結自己的工作或學習進度和成就。使用He3週報生成器，他們可以輕鬆生成報告，並選擇適合個人使用的風格和格式。"
    },
    "en": {
      "$name": "Weekly Report Generator📓",
      "$keywords": [
        "AI",
        "Weekly report generator",
        "Automatically generate weekly report",
        "Multiple styles and formats",
        "PDF export",
        "Word export",
        "Company internal weekly report",
        "Student weekly report",
        "Personal weekly report"
      ],
      "$description": "He3 weekly report generator is a tool used to generate weekly reports. It can automatically generate a report based on the data input by the user and provide multiple styles and formats for the user to choose from.\n\nFunction description:\n\n1. Users can input information such as the title, time range, and content of the weekly report.\n\n2. The tool will automatically generate a report based on the user's input and provide multiple styles and formats for the user to choose from.\n\n3. Users can choose to export the report as a PDF or Word document for easy sharing and printing.\n\nUsage scenarios:\n\n1. Company internal weekly report: Within a company, department managers or team leaders need to regularly report on work progress and achievements to their superiors. Using He3 weekly report generator, they can easily generate a report and choose a style and format suitable for internal company use.\n\n2. Student weekly report: In school, students need to regularly report on their learning progress and achievements to their teachers. Using He3 weekly report generator, they can easily generate a report and choose a style and format suitable for school use.\n\n3. Personal weekly report: In work or study, individuals need to regularly summarize their work or learning progress and achievements. Using He3 weekly report generator, they can easily generate a report and choose a style and format suitable for personal use."
    },
    "pt": {
      "$name": "Gerador de relatórios semanais📓",
      "$keywords": [
        "AI",
        "Gerador de relatório semanal",
        "Geração automática de relatório semanal",
        "Múltiplos estilos e formatos",
        "Exportação em PDF",
        "Exportação em Word",
        "Relatório semanal interno da empresa",
        "Relatório semanal do estudante",
        "Relatório semanal pessoal"
      ],
      "$description": "O gerador de relatórios semanais He3 é uma ferramenta usada para gerar relatórios semanais. Ele pode gerar automaticamente um relatório com base nos dados inseridos pelo usuário e fornecer vários estilos e formatos para o usuário escolher.\n\nDescrição da função:\n\n1. Os usuários podem inserir informações como título, período de tempo e conteúdo do relatório semanal.\n\n2. A ferramenta irá gerar automaticamente um relatório com base na entrada do usuário e fornecer vários estilos e formatos para o usuário escolher.\n\n3. Os usuários podem escolher exportar o relatório como um documento PDF ou Word para compartilhamento e impressão fácil.\n\nCenários de uso:\n\n1. Relatório semanal interno da empresa: Dentro de uma empresa, gerentes de departamento ou líderes de equipe precisam relatar regularmente o progresso e as conquistas do trabalho aos seus superiores. Usando o gerador de relatórios semanais He3, eles podem facilmente gerar um relatório e escolher um estilo e formato adequado para uso interno da empresa.\n\n2. Relatório semanal do estudante: Na escola, os alunos precisam relatar regularmente seu progresso e conquistas de aprendizagem aos seus professores. Usando o gerador de relatórios semanais He3, eles podem facilmente gerar um relatório e escolher um estilo e formato adequado para uso escolar.\n\n3. Relatório semanal pessoal: No trabalho ou estudo, indivíduos precisam resumir regularmente seu progresso e conquistas de trabalho ou aprendizagem. Usando o gerador de relatórios semanais He3, eles podem facilmente gerar um relatório e escolher um estilo e formato adequado para uso pessoal."
    },
    "ru": {
      "$name": "Генератор еженедельных отчетов📓",
      "$keywords": [
        "Искусственный интеллект",
        "Генератор еженедельных отчетов",
        "Автоматическая генерация еженедельных отчетов",
        "Множество стилей и форматов",
        "Экспорт в PDF",
        "Экспорт в Word",
        "Внутренний еженедельный отчет компании",
        "Еженедельный отчет студента",
        "Личный еженедельный отчет"
      ],
      "$description": "Генератор еженедельных отчетов He3 - это инструмент, используемый для создания еженедельных отчетов. Он может автоматически генерировать отчет на основе данных, введенных пользователем, и предоставлять несколько стилей и форматов для выбора пользователем.\n\nОписание функций:\n\n1. Пользователи могут вводить информацию, такую как заголовок, временной диапазон и содержание еженедельного отчета.\n\n2. Инструмент автоматически генерирует отчет на основе ввода пользователя и предоставляет несколько стилей и форматов для выбора пользователем.\n\n3. Пользователи могут выбрать экспорт отчета в формате PDF или Word для удобного обмена и печати.\n\nСценарии использования:\n\n1. Внутренний еженедельный отчет компании: Внутри компании менеджеры отделов или руководители команд должны регулярно докладывать о ходе работы и достижениях своим начальникам. Используя генератор еженедельных отчетов He3, они могут легко создавать отчеты и выбирать стиль и формат, подходящие для внутреннего использования в компании.\n\n2. Еженедельный отчет студента: В школе студенты должны регулярно докладывать о своем учебном прогрессе и достижениях своим учителям. Используя генератор еженедельных отчетов He3, они могут легко создавать отчеты и выбирать стиль и формат, подходящие для использования в школе.\n\n3. Личный еженедельный отчет: В работе или учебе люди должны регулярно подводить итоги своего рабочего или учебного прогресса и достижений. Используя генератор еженедельных отчетов He3, они могут легко создавать отчеты и выбирать стиль и формат, подходящие для личного использования."
    },
    "it": {
      "$name": "Generatore di report settimanali📓",
      "$keywords": [
        "AI",
        "Generatore di rapporti settimanali",
        "Generazione automatica di rapporti settimanali",
        "Stili e formati multipli",
        "Esportazione in PDF",
        "Esportazione in Word",
        "Rapporto settimanale interno dell'azienda",
        "Rapporto settimanale degli studenti",
        "Rapporto settimanale personale"
      ],
      "$description": "Il generatore di rapporti settimanali He3 è uno strumento utilizzato per generare rapporti settimanali. Può generare automaticamente un rapporto in base ai dati inseriti dall'utente e fornire molteplici stili e formati tra cui scegliere.\n\nDescrizione delle funzioni:\n\n1. Gli utenti possono inserire informazioni come il titolo, l'intervallo di tempo e il contenuto del rapporto settimanale.\n\n2. Lo strumento genererà automaticamente un rapporto in base all'input dell'utente e fornirà molteplici stili e formati tra cui scegliere.\n\n3. Gli utenti possono scegliere di esportare il rapporto come documento PDF o Word per una facile condivisione e stampa.\n\nScenari d'uso:\n\n1. Rapporto settimanale interno dell'azienda: All'interno di un'azienda, i responsabili di dipartimento o i capi squadra devono regolarmente riportare i progressi e i risultati del lavoro ai loro superiori. Utilizzando il generatore di rapporti settimanali He3, possono facilmente generare un rapporto e scegliere uno stile e un formato adatti all'uso interno dell'azienda.\n\n2. Rapporto settimanale degli studenti: A scuola, gli studenti devono regolarmente riportare i loro progressi di apprendimento e i risultati ai loro insegnanti. Utilizzando il generatore di rapporti settimanali He3, possono facilmente generare un rapporto e scegliere uno stile e un formato adatti all'uso scolastico.\n\n3. Rapporto settimanale personale: Nel lavoro o nello studio, gli individui devono regolarmente riassumere i loro progressi di lavoro o di apprendimento e i risultati. Utilizzando il generatore di rapporti settimanali He3, possono facilmente generare un rapporto e scegliere uno stile e un formato adatti all'uso personale."
    },
    "de": {
      "$name": "Wochenbericht-Generator📓",
      "$keywords": [
        "AI",
        "Wöchentlicher Berichtsgenerator",
        "Automatisches Generieren von wöchentlichen Berichten",
        "Mehrere Stile und Formate",
        "PDF-Export",
        "Word-Export",
        "Wöchentlicher interner Firmenbericht",
        "Studentischer Wochenbericht",
        "Persönlicher Wochenbericht"
      ],
      "$description": "Der He3 wöchentliche Berichtsgenerator ist ein Werkzeug, das zur Erstellung von wöchentlichen Berichten verwendet wird. Es kann automatisch einen Bericht auf der Grundlage der vom Benutzer eingegebenen Daten generieren und dem Benutzer mehrere Stile und Formate zur Auswahl bieten.\n\nFunktionsbeschreibung:\n\n1. Benutzer können Informationen wie Titel, Zeitraum und Inhalt des wöchentlichen Berichts eingeben.\n\n2. Das Tool generiert automatisch einen Bericht auf der Grundlage der Eingabe des Benutzers und bietet dem Benutzer mehrere Stile und Formate zur Auswahl.\n\n3. Benutzer können den Bericht als PDF- oder Word-Dokument exportieren, um ihn einfach zu teilen und auszudrucken.\n\nAnwendungsszenarien:\n\n1. Wöchentlicher interner Bericht des Unternehmens: Innerhalb eines Unternehmens müssen Abteilungsleiter oder Teamleiter regelmäßig über den Arbeitsfortschritt und Erfolge an ihre Vorgesetzten berichten. Mit dem He3 wöchentlichen Berichtsgenerator können sie einfach einen Bericht generieren und einen für den internen Gebrauch im Unternehmen geeigneten Stil und Format auswählen.\n\n2. Wöchentlicher Schülerbericht: In der Schule müssen Schüler regelmäßig über ihren Lernfortschritt und Erfolge an ihre Lehrer berichten. Mit dem He3 wöchentlichen Berichtsgenerator können sie einfach einen Bericht generieren und einen für den Schulgebrauch geeigneten Stil und Format auswählen.\n\n3. Persönlicher wöchentlicher Bericht: Im Beruf oder Studium müssen Einzelpersonen regelmäßig ihren Arbeits- oder Lernfortschritt und Erfolge zusammenfassen. Mit dem He3 wöchentlichen Berichtsgenerator können sie einfach einen Bericht generieren und einen für den persönlichen Gebrauch geeigneten Stil und Format auswählen."
    },
    "ko": {
      "$name": "주간 보고서 생성기📓",
      "$keywords": [
        "인공지능",
        "주간 보고서 생성기",
        "주간 보고서 자동 생성",
        "다양한 스타일 및 형식",
        "PDF 내보내기",
        "Word 내보내기",
        "회사 내부 주간 보고서",
        "학생 주간 보고서",
        "개인 주간 보고서"
      ],
      "$description": "He3 주간 보고서 생성기는 주간 보고서를 생성하는 데 사용되는 도구입니다. 사용자가 입력한 데이터를 기반으로 자동으로 보고서를 생성하고 사용자가 선택할 수 있는 다양한 스타일과 형식을 제공할 수 있습니다.\n\n기능 설명:\n\n1. 사용자는 주간 보고서의 제목, 시간 범위 및 내용과 같은 정보를 입력할 수 있습니다.\n\n2. 도구는 사용자의 입력을 기반으로 자동으로 보고서를 생성하고 사용자가 선택할 수 있는 다양한 스타일과 형식을 제공합니다.\n\n3. 사용자는 PDF 또는 워드 문서로 보고서를 내보내어 쉽게 공유하고 인쇄할 수 있습니다.\n\n사용 시나리오:\n\n1. 회사 내부 주간 보고서: 회사 내에서 부서 관리자 또는 팀 리더는 상사에게 작업 진행 상황 및 성과를 정기적으로 보고해야 합니다. He3 주간 보고서 생성기를 사용하면 쉽게 보고서를 생성하고 내부 회사용에 적합한 스타일과 형식을 선택할 수 있습니다.\n\n2. 학생 주간 보고서: 학교에서 학생들은 교사에게 학습 진행 상황 및 성과를 정기적으로 보고해야 합니다. He3 주간 보고서 생성기를 사용하면 쉽게 보고서를 생성하고 학교용에 적합한 스타일과 형식을 선택할 수 있습니다.\n\n3. 개인 주간 보고서: 업무나 학습에서 개인은 정기적으로 작업 또는 학습 진행 상황 및 성과를 요약해야 합니다. He3 주간 보고서 생성기를 사용하면 쉽게 보고서를 생성하고 개인용에 적합한 스타일과 형식을 선택할 수 있습니다."
    },
    "ja": {
      "$name": "週報ジェネレーター📓",
      "$keywords": [
        "AI",
        "週次レポートジェネレーター",
        "週次レポートの自動生成",
        "複数のスタイルとフォーマット",
        "PDFエクスポート",
        "Wordエクスポート",
        "企業内部の週次レポート",
        "学生の週次レポート",
        "個人の週次レポート"
      ],
      "$description": "He3週次報告生成ツールは、週次報告を生成するために使用されるツールです。ユーザーが入力したデータに基づいて自動的にレポートを生成し、ユーザーが選択できる複数のスタイルとフォーマットを提供することができます。\n\n機能の説明：\n\n1. ユーザーは、週次報告のタイトル、時間範囲、および内容などの情報を入力することができます。\n\n2. ツールは、ユーザーの入力に基づいて自動的にレポートを生成し、ユーザーが選択できる複数のスタイルとフォーマットを提供することができます。\n\n3. ユーザーは、PDFまたはWordドキュメントとしてレポートをエクスポートして、簡単に共有や印刷ができます。\n\n使用シナリオ：\n\n1. 企業内週次報告：企業内では、部門マネージャーやチームリーダーが上司に対して定期的に業務の進捗状況や成果を報告する必要があります。He3週次報告生成ツールを使用することで、彼らは簡単にレポートを生成し、内部企業で使用するために適したスタイルとフォーマットを選択することができます。\n\n2. 学生の週次報告：学校では、生徒が定期的に教師に対して学習の進捗状況や成果を報告する必要があります。He3週次報告生成ツールを使用することで、彼らは簡単にレポートを生成し、学校で使用するために適したスタイルとフォーマットを選択することができます。\n\n3. 個人の週次報告：仕事や学習において、個人は定期的に自分の業務や学習の進捗状況や成果をまとめる必要があります。He3週次報告生成ツールを使用することで、彼らは簡単にレポートを生成し、個人で使用するために適したスタイルとフォーマットを選択することができます。"
    },
    "es": {
      "$name": "Generador de informes semanales📓",
      "$keywords": [
        "AI",
        "Generador de informe semanal",
        "Generación automática de informe semanal",
        "Múltiples estilos y formatos",
        "Exportación en PDF",
        "Exportación en Word",
        "Informe semanal interno de la empresa",
        "Informe semanal de estudiante",
        "Informe semanal personal"
      ],
      "$description": "El generador de informes semanales He3 es una herramienta utilizada para generar informes semanales. Puede generar automáticamente un informe basado en los datos ingresados por el usuario y proporcionar múltiples estilos y formatos para que el usuario elija.\n\nDescripción de la función:\n\n1. Los usuarios pueden ingresar información como el título, el rango de tiempo y el contenido del informe semanal.\n\n2. La herramienta generará automáticamente un informe basado en la entrada del usuario y proporcionará múltiples estilos y formatos para que el usuario elija.\n\n3. Los usuarios pueden elegir exportar el informe como un documento PDF o Word para compartir y imprimir fácilmente.\n\nEscenarios de uso:\n\n1. Informe semanal interno de la empresa: Dentro de una empresa, los gerentes de departamento o líderes de equipo necesitan informar regularmente sobre el progreso y los logros del trabajo a sus superiores. Usando el generador de informes semanales He3, pueden generar fácilmente un informe y elegir un estilo y formato adecuado para uso interno de la empresa.\n\n2. Informe semanal de estudiante: En la escuela, los estudiantes necesitan informar regularmente sobre su progreso y logros de aprendizaje a sus profesores. Usando el generador de informes semanales He3, pueden generar fácilmente un informe y elegir un estilo y formato adecuado para uso escolar.\n\n3. Informe semanal personal: En el trabajo o estudio, las personas necesitan resumir regularmente su progreso y logros de trabajo o aprendizaje. Usando el generador de informes semanales He3, pueden generar fácilmente un informe y elegir un estilo y formato adecuado para uso personal."
    },
    "zh-cn": {
      "$name": "周报生成器📓",
      "$keywords": [
        "人工智能",
        "周报生成器",
        "自动生成周报",
        "多种风格和格式",
        "PDF导出",
        "Word导出",
        "公司内部周报",
        "学生周报",
        "个人周报"
      ],
      "$description": "He3周报生成器是一种用于生成周报的工具。它可以根据用户输入的数据自动生成报告，并提供多种风格和格式供用户选择。\n\n功能描述：\n\n1. 用户可以输入周报的标题、时间范围和内容等信息。\n\n2. 工具将根据用户的输入自动生成报告，并提供多种风格和格式供用户选择。\n\n3. 用户可以选择将报告导出为PDF或Word文档，以便于分享和打印。\n\n使用场景：\n\n1. 公司内部周报：在公司内部，部门经理或团队负责人需要定期向上级汇报工作进展和成果。使用He3周报生成器，他们可以轻松生成报告，并选择适合公司内部使用的风格和格式。\n\n2. 学生周报：在学校，学生需要定期向老师汇报他们的学习进展和成果。使用He3周报生成器，他们可以轻松生成报告，并选择适合学校使用的风格和格式。\n\n3. 个人周报：在工作或学习中，个人需要定期总结自己的工作或学习进展和成果。使用He3周报生成器，他们可以轻松生成报告，并选择适合个人使用的风格和格式。"
    }
  }
]